earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico 2W
# -----------------------------------
rpipico2w.name=Raspberry Pi Pico 2W
rpipico2w.vid.0=0x2e8a
rpipico2w.pid.0=0xf00f
rpipico2w.vid.1=0x2e8a
rpipico2w.pid.1=0xf10f
rpipico2w.upload_port.0.vid=0x2e8a
rpipico2w.upload_port.0.pid=0xf00f
rpipico2w.upload_port.1.vid=0x2e8a
rpipico2w.upload_port.1.pid=0xf10f
rpipico2w.build.usbvid=-DUSBD_VID=0x2e8a
rpipico2w.build.usbpid=-DUSBD_PID=0xf00f
rpipico2w.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipico2w.build.board=RASPBERRY_PI_PICO_2W
rpipico2w.build.variant=rpipico2w
rpipico2w.upload.maximum_size=4194304
rpipico2w.upload.wait_for_upload_port=true
rpipico2w.upload.erase_cmd=
rpipico2w.serial.disableDTR=false
rpipico2w.serial.disableRTS=false
rpipico2w.build.f_cpu=125000000
rpipico2w.build.led=
rpipico2w.build.core=rp2040
rpipico2w.build.ldscript=memmap_default.ld
rpipico2w.build.boot2=none
rpipico2w.build.usb_manufacturer="Raspberry Pi"
rpipico2w.build.usb_product="Pico 2W"
rpipico2w.build.psram_length=0x000000
rpipico2w.build.extra_flags=-DPICO_CYW43_SUPPORTED=1 -DCYW43_PIN_WL_DYNAMIC=1
rpipico2w.menu.flash.4194304_0=4MB (no FS)
rpipico2w.menu.flash.4194304_0.upload.maximum_size=4186112
rpipico2w.menu.flash.4194304_0.build.flash_total=4194304
rpipico2w.menu.flash.4194304_0.build.flash_length=4186112
rpipico2w.menu.flash.4194304_0.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_0.build.fs_start=272621568
rpipico2w.menu.flash.4194304_0.build.fs_end=272621568
rpipico2w.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
rpipico2w.menu.flash.4194304_65536.upload.maximum_size=4120576
rpipico2w.menu.flash.4194304_65536.build.flash_total=4194304
rpipico2w.menu.flash.4194304_65536.build.flash_length=4120576
rpipico2w.menu.flash.4194304_65536.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_65536.build.fs_start=272556032
rpipico2w.menu.flash.4194304_65536.build.fs_end=272621568
rpipico2w.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
rpipico2w.menu.flash.4194304_131072.upload.maximum_size=4055040
rpipico2w.menu.flash.4194304_131072.build.flash_total=4194304
rpipico2w.menu.flash.4194304_131072.build.flash_length=4055040
rpipico2w.menu.flash.4194304_131072.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_131072.build.fs_start=272490496
rpipico2w.menu.flash.4194304_131072.build.fs_end=272621568
rpipico2w.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
rpipico2w.menu.flash.4194304_262144.upload.maximum_size=3923968
rpipico2w.menu.flash.4194304_262144.build.flash_total=4194304
rpipico2w.menu.flash.4194304_262144.build.flash_length=3923968
rpipico2w.menu.flash.4194304_262144.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_262144.build.fs_start=272359424
rpipico2w.menu.flash.4194304_262144.build.fs_end=272621568
rpipico2w.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
rpipico2w.menu.flash.4194304_524288.upload.maximum_size=3661824
rpipico2w.menu.flash.4194304_524288.build.flash_total=4194304
rpipico2w.menu.flash.4194304_524288.build.flash_length=3661824
rpipico2w.menu.flash.4194304_524288.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_524288.build.fs_start=272097280
rpipico2w.menu.flash.4194304_524288.build.fs_end=272621568
rpipico2w.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
rpipico2w.menu.flash.4194304_1048576.upload.maximum_size=3137536
rpipico2w.menu.flash.4194304_1048576.build.flash_total=4194304
rpipico2w.menu.flash.4194304_1048576.build.flash_length=3137536
rpipico2w.menu.flash.4194304_1048576.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_1048576.build.fs_start=271572992
rpipico2w.menu.flash.4194304_1048576.build.fs_end=272621568
rpipico2w.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
rpipico2w.menu.flash.4194304_2097152.upload.maximum_size=2088960
rpipico2w.menu.flash.4194304_2097152.build.flash_total=4194304
rpipico2w.menu.flash.4194304_2097152.build.flash_length=2088960
rpipico2w.menu.flash.4194304_2097152.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_2097152.build.fs_start=270524416
rpipico2w.menu.flash.4194304_2097152.build.fs_end=272621568
rpipico2w.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
rpipico2w.menu.flash.4194304_3145728.upload.maximum_size=1040384
rpipico2w.menu.flash.4194304_3145728.build.flash_total=4194304
rpipico2w.menu.flash.4194304_3145728.build.flash_length=1040384
rpipico2w.menu.flash.4194304_3145728.build.eeprom_start=272621568
rpipico2w.menu.flash.4194304_3145728.build.fs_start=269475840
rpipico2w.menu.flash.4194304_3145728.build.fs_end=272621568
rpipico2w.menu.arch.arm=ARM
rpipico2w.menu.arch.arm.build.chip=rp2350
rpipico2w.menu.arch.arm.build.toolchain=arm-none-eabi
rpipico2w.menu.arch.arm.build.toolchainpkg=pqt-gcc
rpipico2w.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
rpipico2w.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
rpipico2w.menu.arch.arm.build.mcu=cortex-m33
rpipico2w.menu.arch.riscv=RISC-V
rpipico2w.menu.arch.riscv.build.chip=rp2350-riscv
rpipico2w.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
rpipico2w.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
rpipico2w.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
rpipico2w.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
rpipico2w.menu.arch.riscv.build.mcu=rv32imac
rpipico2w.menu.freq.150=150 MHz
rpipico2w.menu.freq.150.build.f_cpu=150000000L
rpipico2w.menu.freq.50=50 MHz
rpipico2w.menu.freq.50.build.f_cpu=50000000L
rpipico2w.menu.freq.100=100 MHz
rpipico2w.menu.freq.100.build.f_cpu=100000000L
rpipico2w.menu.freq.120=120 MHz
rpipico2w.menu.freq.120.build.f_cpu=120000000L
rpipico2w.menu.freq.125=125 MHz
rpipico2w.menu.freq.125.build.f_cpu=125000000L
rpipico2w.menu.freq.128=128 MHz
rpipico2w.menu.freq.128.build.f_cpu=128000000L
rpipico2w.menu.freq.133=133 MHz
rpipico2w.menu.freq.133.build.f_cpu=133000000L
rpipico2w.menu.freq.176=176 MHz (Overclock)
rpipico2w.menu.freq.176.build.f_cpu=176000000L
rpipico2w.menu.freq.200=200 MHz (Overclock)
rpipico2w.menu.freq.200.build.f_cpu=200000000L
rpipico2w.menu.freq.225=225 MHz (Overclock)
rpipico2w.menu.freq.225.build.f_cpu=225000000L
rpipico2w.menu.freq.240=240 MHz (Overclock)
rpipico2w.menu.freq.240.build.f_cpu=240000000L
rpipico2w.menu.freq.250=250 MHz (Overclock)
rpipico2w.menu.freq.250.build.f_cpu=250000000L
rpipico2w.menu.freq.276=276 MHz (Overclock)
rpipico2w.menu.freq.276.build.f_cpu=276000000L
rpipico2w.menu.freq.300=300 MHz (Overclock)
rpipico2w.menu.freq.300.build.f_cpu=300000000L
rpipico2w.menu.opt.Small=Small (-Os) (standard)
rpipico2w.menu.opt.Small.build.flags.optimize=-Os
rpipico2w.menu.opt.Optimize=Optimize (-O)
rpipico2w.menu.opt.Optimize.build.flags.optimize=-O
rpipico2w.menu.opt.Optimize2=Optimize More (-O2)
rpipico2w.menu.opt.Optimize2.build.flags.optimize=-O2
rpipico2w.menu.opt.Optimize3=Optimize Even More (-O3)
rpipico2w.menu.opt.Optimize3.build.flags.optimize=-O3
rpipico2w.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipico2w.menu.opt.Fast.build.flags.optimize=-Ofast
rpipico2w.menu.opt.Debug=Debug (-Og)
rpipico2w.menu.opt.Debug.build.flags.optimize=-Og
rpipico2w.menu.opt.Disabled=Disabled (-O0)
rpipico2w.menu.opt.Disabled.build.flags.optimize=-O0
rpipico2w.menu.profile.Disabled=Disabled
rpipico2w.menu.profile.Disabled.build.flags.profile=
rpipico2w.menu.profile.Enabled=Enabled
rpipico2w.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
rpipico2w.menu.rtti.Disabled=Disabled
rpipico2w.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipico2w.menu.rtti.Enabled=Enabled
rpipico2w.menu.rtti.Enabled.build.flags.rtti=
rpipico2w.menu.stackprotect.Disabled=Disabled
rpipico2w.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipico2w.menu.stackprotect.Enabled=Enabled
rpipico2w.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
rpipico2w.menu.exceptions.Disabled=Disabled
rpipico2w.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipico2w.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipico2w.menu.exceptions.Enabled=Enabled
rpipico2w.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipico2w.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipico2w.menu.dbgport.Disabled=Disabled
rpipico2w.menu.dbgport.Disabled.build.debug_port=
rpipico2w.menu.dbgport.Serial=Serial
rpipico2w.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipico2w.menu.dbgport.Serial1=Serial1
rpipico2w.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipico2w.menu.dbgport.Serial2=Serial2
rpipico2w.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipico2w.menu.dbgport.SerialSemi=SerialSemi
rpipico2w.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
rpipico2w.menu.dbglvl.None=None
rpipico2w.menu.dbglvl.None.build.debug_level=
rpipico2w.menu.dbglvl.Core=Core
rpipico2w.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipico2w.menu.dbglvl.SPI=SPI
rpipico2w.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipico2w.menu.dbglvl.Wire=Wire
rpipico2w.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipico2w.menu.dbglvl.Bluetooth=Bluetooth
rpipico2w.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
rpipico2w.menu.dbglvl.All=All
rpipico2w.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
rpipico2w.menu.dbglvl.NDEBUG=NDEBUG
rpipico2w.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipico2w.menu.usbstack.picosdk=Pico SDK
rpipico2w.menu.usbstack.picosdk.build.usbstack_flags=
rpipico2w.menu.usbstack.tinyusb=Adafruit TinyUSB
rpipico2w.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rpipico2w.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
rpipico2w.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rpipico2w.menu.usbstack.nousb=No USB
rpipico2w.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
rpipico2w.menu.wificountry.worldwide=Worldwide
rpipico2w.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
rpipico2w.menu.wificountry.australia=Australia
rpipico2w.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
rpipico2w.menu.wificountry.austria=Austria
rpipico2w.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
rpipico2w.menu.wificountry.belgium=Belgium
rpipico2w.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
rpipico2w.menu.wificountry.brazil=Brazil
rpipico2w.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
rpipico2w.menu.wificountry.canada=Canada
rpipico2w.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
rpipico2w.menu.wificountry.chile=Chile
rpipico2w.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
rpipico2w.menu.wificountry.china=China
rpipico2w.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
rpipico2w.menu.wificountry.colombia=Colombia
rpipico2w.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
rpipico2w.menu.wificountry.czech_republic=Czech Republic
rpipico2w.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
rpipico2w.menu.wificountry.denmark=Denmark
rpipico2w.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
rpipico2w.menu.wificountry.estonia=Estonia
rpipico2w.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
rpipico2w.menu.wificountry.finland=Finland
rpipico2w.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
rpipico2w.menu.wificountry.france=France
rpipico2w.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
rpipico2w.menu.wificountry.germany=Germany
rpipico2w.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
rpipico2w.menu.wificountry.greece=Greece
rpipico2w.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
rpipico2w.menu.wificountry.hong_kong=Hong Kong
rpipico2w.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
rpipico2w.menu.wificountry.hungary=Hungary
rpipico2w.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
rpipico2w.menu.wificountry.iceland=Iceland
rpipico2w.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
rpipico2w.menu.wificountry.india=India
rpipico2w.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
rpipico2w.menu.wificountry.israel=Israel
rpipico2w.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
rpipico2w.menu.wificountry.italy=Italy
rpipico2w.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
rpipico2w.menu.wificountry.japan=Japan
rpipico2w.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
rpipico2w.menu.wificountry.kenya=Kenya
rpipico2w.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
rpipico2w.menu.wificountry.latvia=Latvia
rpipico2w.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
rpipico2w.menu.wificountry.liechtenstein=Liechtenstein
rpipico2w.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
rpipico2w.menu.wificountry.lithuania=Lithuania
rpipico2w.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
rpipico2w.menu.wificountry.luxembourg=Luxembourg
rpipico2w.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
rpipico2w.menu.wificountry.malaysia=Malaysia
rpipico2w.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
rpipico2w.menu.wificountry.malta=Malta
rpipico2w.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
rpipico2w.menu.wificountry.mexico=Mexico
rpipico2w.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
rpipico2w.menu.wificountry.netherlands=Netherlands
rpipico2w.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
rpipico2w.menu.wificountry.new_zealand=New Zealand
rpipico2w.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
rpipico2w.menu.wificountry.nigeria=Nigeria
rpipico2w.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
rpipico2w.menu.wificountry.norway=Norway
rpipico2w.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
rpipico2w.menu.wificountry.peru=Peru
rpipico2w.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
rpipico2w.menu.wificountry.philippines=Philippines
rpipico2w.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
rpipico2w.menu.wificountry.poland=Poland
rpipico2w.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
rpipico2w.menu.wificountry.portugal=Portugal
rpipico2w.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
rpipico2w.menu.wificountry.singapore=Singapore
rpipico2w.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
rpipico2w.menu.wificountry.slovakia=Slovakia
rpipico2w.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
rpipico2w.menu.wificountry.slovenia=Slovenia
rpipico2w.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
rpipico2w.menu.wificountry.south_africa=South Africa
rpipico2w.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
rpipico2w.menu.wificountry.south_korea=South Korea
rpipico2w.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
rpipico2w.menu.wificountry.spain=Spain
rpipico2w.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
rpipico2w.menu.wificountry.sweden=Sweden
rpipico2w.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
rpipico2w.menu.wificountry.switzerland=Switzerland
rpipico2w.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
rpipico2w.menu.wificountry.taiwan=Taiwan
rpipico2w.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
rpipico2w.menu.wificountry.thailand=Thailand
rpipico2w.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
rpipico2w.menu.wificountry.turkey=Turkey
rpipico2w.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
rpipico2w.menu.wificountry.uk=UK
rpipico2w.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
rpipico2w.menu.wificountry.usa=USA
rpipico2w.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
rpipico2w.menu.ipbtstack.ipv4only=IPv4 Only
rpipico2w.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
rpipico2w.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipico2w.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
rpipico2w.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
rpipico2w.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
rpipico2w.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
rpipico2w.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
rpipico2w.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
rpipico2w.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
rpipico2w.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
rpipico2w.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
rpipico2w.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
rpipico2w.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
rpipico2w.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
rpipico2w.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
rpipico2w.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
rpipico2w.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
