earlephilhower/arduino-pico/boards.txt
rpipico2w.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
rpipico2w.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
rpipico2w.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
rpipico2w.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
rpipico2w.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
rpipico2w.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
rpipico2w.menu.uploadmethod.default=Default (UF2)
rpipico2w.menu.uploadmethod.default.build.ram_length=512k
rpipico2w.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
rpipico2w.menu.uploadmethod.default.upload.maximum_data_size=524288
rpipico2w.menu.uploadmethod.default.upload.tool=uf2conv
rpipico2w.menu.uploadmethod.default.upload.tool.default=uf2conv
rpipico2w.menu.uploadmethod.default.upload.tool.network=uf2conv-network
rpipico2w.menu.uploadmethod.picotool=Picotool
rpipico2w.menu.uploadmethod.picotool.build.ram_length=512k
rpipico2w.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
rpipico2w.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
rpipico2w.menu.uploadmethod.picotool.upload.maximum_data_size=524288
rpipico2w.menu.uploadmethod.picotool.upload.tool=picotool
rpipico2w.menu.uploadmethod.picotool.upload.tool.default=picotool
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
rpipico2w.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# 0xCB Helios
# -----------------------------------
0xcb_helios.name=0xCB Helios
0xcb_helios.vid.0=0x1209
0xcb_helios.pid.0=0xcb74
0xcb_helios.upload_port.0.vid=0x1209
0xcb_helios.upload_port.0.pid=0xcb74
0xcb_helios.build.usbvid=-DUSBD_VID=0x1209
0xcb_helios.build.usbpid=-DUSBD_PID=0xcb74
0xcb_helios.build.usbpwr=-DUSBD_MAX_POWER_MA=500
0xcb_helios.build.board=0XCB_HELIOS
0xcb_helios.build.mcu=cortex-m0plus
0xcb_helios.build.chip=rp2040
0xcb_helios.build.toolchain=arm-none-eabi
0xcb_helios.build.toolchainpkg=pqt-gcc
0xcb_helios.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
0xcb_helios.build.uf2family=--family rp2040
0xcb_helios.build.variant=0xcb_helios
0xcb_helios.upload.maximum_size=16777216
0xcb_helios.upload.wait_for_upload_port=true
0xcb_helios.upload.erase_cmd=
0xcb_helios.serial.disableDTR=false
0xcb_helios.serial.disableRTS=false
0xcb_helios.build.f_cpu=125000000
0xcb_helios.build.led=
0xcb_helios.build.core=rp2040
0xcb_helios.build.ldscript=memmap_default.ld
0xcb_helios.build.boot2=boot2_w25q128jvxq_4_padded_checksum
0xcb_helios.build.usb_manufacturer="0xCB"
0xcb_helios.build.usb_product="Helios"
0xcb_helios.menu.flash.16777216_0=16MB (no FS)
0xcb_helios.menu.flash.16777216_0.upload.maximum_size=16773120
0xcb_helios.menu.flash.16777216_0.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_0.build.flash_length=16773120
0xcb_helios.menu.flash.16777216_0.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_0.build.fs_start=285208576
0xcb_helios.menu.flash.16777216_0.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
0xcb_helios.menu.flash.16777216_65536.upload.maximum_size=16707584
0xcb_helios.menu.flash.16777216_65536.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_65536.build.flash_length=16707584
0xcb_helios.menu.flash.16777216_65536.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_65536.build.fs_start=285143040
0xcb_helios.menu.flash.16777216_65536.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
0xcb_helios.menu.flash.16777216_131072.upload.maximum_size=16642048
0xcb_helios.menu.flash.16777216_131072.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_131072.build.flash_length=16642048
0xcb_helios.menu.flash.16777216_131072.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_131072.build.fs_start=285077504
0xcb_helios.menu.flash.16777216_131072.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
0xcb_helios.menu.flash.16777216_262144.upload.maximum_size=16510976
0xcb_helios.menu.flash.16777216_262144.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_262144.build.flash_length=16510976
0xcb_helios.menu.flash.16777216_262144.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_262144.build.fs_start=284946432
0xcb_helios.menu.flash.16777216_262144.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
0xcb_helios.menu.flash.16777216_524288.upload.maximum_size=16248832
0xcb_helios.menu.flash.16777216_524288.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_524288.build.flash_length=16248832
0xcb_helios.menu.flash.16777216_524288.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_524288.build.fs_start=284684288
0xcb_helios.menu.flash.16777216_524288.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
0xcb_helios.menu.flash.16777216_1048576.upload.maximum_size=15724544
0xcb_helios.menu.flash.16777216_1048576.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_1048576.build.flash_length=15724544
0xcb_helios.menu.flash.16777216_1048576.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_1048576.build.fs_start=284160000
0xcb_helios.menu.flash.16777216_1048576.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
0xcb_helios.menu.flash.16777216_2097152.upload.maximum_size=14675968
0xcb_helios.menu.flash.16777216_2097152.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_2097152.build.flash_length=14675968
0xcb_helios.menu.flash.16777216_2097152.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_2097152.build.fs_start=283111424
0xcb_helios.menu.flash.16777216_2097152.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
0xcb_helios.menu.flash.16777216_3145728.upload.maximum_size=13627392
0xcb_helios.menu.flash.16777216_3145728.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_3145728.build.flash_length=13627392
0xcb_helios.menu.flash.16777216_3145728.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_3145728.build.fs_start=282062848
0xcb_helios.menu.flash.16777216_3145728.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
0xcb_helios.menu.flash.16777216_4194304.upload.maximum_size=12578816
0xcb_helios.menu.flash.16777216_4194304.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_4194304.build.flash_length=12578816
0xcb_helios.menu.flash.16777216_4194304.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_4194304.build.fs_start=281014272
0xcb_helios.menu.flash.16777216_4194304.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
0xcb_helios.menu.flash.16777216_5242880.upload.maximum_size=11530240
0xcb_helios.menu.flash.16777216_5242880.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_5242880.build.flash_length=11530240
0xcb_helios.menu.flash.16777216_5242880.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_5242880.build.fs_start=279965696
0xcb_helios.menu.flash.16777216_5242880.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
0xcb_helios.menu.flash.16777216_6291456.upload.maximum_size=10481664
0xcb_helios.menu.flash.16777216_6291456.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_6291456.build.flash_length=10481664
0xcb_helios.menu.flash.16777216_6291456.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_6291456.build.fs_start=278917120
0xcb_helios.menu.flash.16777216_6291456.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
0xcb_helios.menu.flash.16777216_7340032.upload.maximum_size=9433088
0xcb_helios.menu.flash.16777216_7340032.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_7340032.build.flash_length=9433088
0xcb_helios.menu.flash.16777216_7340032.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_7340032.build.fs_start=277868544
0xcb_helios.menu.flash.16777216_7340032.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
0xcb_helios.menu.flash.16777216_8388608.upload.maximum_size=8384512
0xcb_helios.menu.flash.16777216_8388608.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_8388608.build.flash_length=8384512
0xcb_helios.menu.flash.16777216_8388608.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_8388608.build.fs_start=276819968
0xcb_helios.menu.flash.16777216_8388608.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
0xcb_helios.menu.flash.16777216_9437184.upload.maximum_size=7335936
0xcb_helios.menu.flash.16777216_9437184.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_9437184.build.flash_length=7335936
0xcb_helios.menu.flash.16777216_9437184.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_9437184.build.fs_start=275771392
0xcb_helios.menu.flash.16777216_9437184.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
0xcb_helios.menu.flash.16777216_10485760.upload.maximum_size=6287360
0xcb_helios.menu.flash.16777216_10485760.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_10485760.build.flash_length=6287360
0xcb_helios.menu.flash.16777216_10485760.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_10485760.build.fs_start=274722816
0xcb_helios.menu.flash.16777216_10485760.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
0xcb_helios.menu.flash.16777216_11534336.upload.maximum_size=5238784
0xcb_helios.menu.flash.16777216_11534336.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_11534336.build.flash_length=5238784
0xcb_helios.menu.flash.16777216_11534336.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_11534336.build.fs_start=273674240
0xcb_helios.menu.flash.16777216_11534336.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
0xcb_helios.menu.flash.16777216_12582912.upload.maximum_size=4190208
0xcb_helios.menu.flash.16777216_12582912.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_12582912.build.flash_length=4190208
0xcb_helios.menu.flash.16777216_12582912.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_12582912.build.fs_start=272625664
0xcb_helios.menu.flash.16777216_12582912.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
0xcb_helios.menu.flash.16777216_13631488.upload.maximum_size=3141632
0xcb_helios.menu.flash.16777216_13631488.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_13631488.build.flash_length=3141632
0xcb_helios.menu.flash.16777216_13631488.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_13631488.build.fs_start=271577088
0xcb_helios.menu.flash.16777216_13631488.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
0xcb_helios.menu.flash.16777216_14680064.upload.maximum_size=2093056
0xcb_helios.menu.flash.16777216_14680064.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_14680064.build.flash_length=2093056
0xcb_helios.menu.flash.16777216_14680064.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_14680064.build.fs_start=270528512
0xcb_helios.menu.flash.16777216_14680064.build.fs_end=285208576
0xcb_helios.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
0xcb_helios.menu.flash.16777216_15728640.upload.maximum_size=1044480
0xcb_helios.menu.flash.16777216_15728640.build.flash_total=16777216
0xcb_helios.menu.flash.16777216_15728640.build.flash_length=1044480
0xcb_helios.menu.flash.16777216_15728640.build.eeprom_start=285208576
0xcb_helios.menu.flash.16777216_15728640.build.fs_start=269479936
0xcb_helios.menu.flash.16777216_15728640.build.fs_end=285208576
0xcb_helios.menu.freq.200=200 MHz
0xcb_helios.menu.freq.200.build.f_cpu=200000000L
0xcb_helios.menu.freq.50=50 MHz
0xcb_helios.menu.freq.50.build.f_cpu=50000000L
0xcb_helios.menu.freq.100=100 MHz
0xcb_helios.menu.freq.100.build.f_cpu=100000000L
0xcb_helios.menu.freq.120=120 MHz
0xcb_helios.menu.freq.120.build.f_cpu=120000000L
0xcb_helios.menu.freq.125=125 MHz
0xcb_helios.menu.freq.125.build.f_cpu=125000000L
0xcb_helios.menu.freq.128=128 MHz
0xcb_helios.menu.freq.128.build.f_cpu=128000000L
0xcb_helios.menu.freq.133=133 MHz
0xcb_helios.menu.freq.133.build.f_cpu=133000000L
0xcb_helios.menu.freq.150=150 MHz
0xcb_helios.menu.freq.150.build.f_cpu=150000000L
0xcb_helios.menu.freq.176=176 MHz
0xcb_helios.menu.freq.176.build.f_cpu=176000000L
0xcb_helios.menu.freq.225=225 MHz (Overclock)
0xcb_helios.menu.freq.225.build.f_cpu=225000000L
0xcb_helios.menu.freq.240=240 MHz (Overclock)
0xcb_helios.menu.freq.240.build.f_cpu=240000000L
0xcb_helios.menu.freq.250=250 MHz (Overclock)
0xcb_helios.menu.freq.250.build.f_cpu=250000000L
0xcb_helios.menu.freq.276=276 MHz (Overclock)
0xcb_helios.menu.freq.276.build.f_cpu=276000000L
0xcb_helios.menu.freq.300=300 MHz (Overclock)
0xcb_helios.menu.freq.300.build.f_cpu=300000000L
0xcb_helios.menu.opt.Small=Small (-Os) (standard)
0xcb_helios.menu.opt.Small.build.flags.optimize=-Os
0xcb_helios.menu.opt.Optimize=Optimize (-O)
0xcb_helios.menu.opt.Optimize.build.flags.optimize=-O
0xcb_helios.menu.opt.Optimize2=Optimize More (-O2)
0xcb_helios.menu.opt.Optimize2.build.flags.optimize=-O2
0xcb_helios.menu.opt.Optimize3=Optimize Even More (-O3)
0xcb_helios.menu.opt.Optimize3.build.flags.optimize=-O3
0xcb_helios.menu.opt.Fast=Fast (-Ofast) (maybe slower)
0xcb_helios.menu.opt.Fast.build.flags.optimize=-Ofast
0xcb_helios.menu.opt.Debug=Debug (-Og)
0xcb_helios.menu.opt.Debug.build.flags.optimize=-Og
0xcb_helios.menu.opt.Disabled=Disabled (-O0)
0xcb_helios.menu.opt.Disabled.build.flags.optimize=-O0
0xcb_helios.menu.profile.Disabled=Disabled
0xcb_helios.menu.profile.Disabled.build.flags.profile=
0xcb_helios.menu.profile.Enabled=Enabled
0xcb_helios.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
0xcb_helios.menu.rtti.Disabled=Disabled
0xcb_helios.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
0xcb_helios.menu.rtti.Enabled=Enabled
0xcb_helios.menu.rtti.Enabled.build.flags.rtti=
0xcb_helios.menu.stackprotect.Disabled=Disabled
0xcb_helios.menu.stackprotect.Disabled.build.flags.stackprotect=
0xcb_helios.menu.stackprotect.Enabled=Enabled
0xcb_helios.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
0xcb_helios.menu.exceptions.Disabled=Disabled
0xcb_helios.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
0xcb_helios.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
0xcb_helios.menu.exceptions.Enabled=Enabled
0xcb_helios.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
0xcb_helios.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
0xcb_helios.menu.dbgport.Disabled=Disabled
0xcb_helios.menu.dbgport.Disabled.build.debug_port=
0xcb_helios.menu.dbgport.Serial=Serial
0xcb_helios.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
0xcb_helios.menu.dbgport.Serial1=Serial1
0xcb_helios.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
0xcb_helios.menu.dbgport.Serial2=Serial2
0xcb_helios.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
0xcb_helios.menu.dbgport.SerialSemi=SerialSemi
0xcb_helios.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
0xcb_helios.menu.dbglvl.None=None
0xcb_helios.menu.dbglvl.None.build.debug_level=
0xcb_helios.menu.dbglvl.Core=Core
0xcb_helios.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
0xcb_helios.menu.dbglvl.SPI=SPI
0xcb_helios.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
0xcb_helios.menu.dbglvl.Wire=Wire
0xcb_helios.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
0xcb_helios.menu.dbglvl.Bluetooth=Bluetooth
0xcb_helios.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
0xcb_helios.menu.dbglvl.All=All
0xcb_helios.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
0xcb_helios.menu.dbglvl.NDEBUG=NDEBUG
0xcb_helios.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
0xcb_helios.menu.usbstack.picosdk=Pico SDK
0xcb_helios.menu.usbstack.picosdk.build.usbstack_flags=
0xcb_helios.menu.usbstack.tinyusb=Adafruit TinyUSB
0xcb_helios.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
0xcb_helios.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
0xcb_helios.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
0xcb_helios.menu.usbstack.nousb=No USB
0xcb_helios.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
0xcb_helios.menu.ipbtstack.ipv4only=IPv4 Only
0xcb_helios.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
0xcb_helios.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
0xcb_helios.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
0xcb_helios.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
0xcb_helios.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
0xcb_helios.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
0xcb_helios.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
