earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Adafruit Metro RP2040
# -----------------------------------
adafruit_metro.name=Adafruit Metro RP2040
adafruit_metro.vid.0=0x239a
adafruit_metro.pid.0=0x813d
adafruit_metro.vid.1=0x239a
adafruit_metro.pid.1=0xc13d
adafruit_metro.upload_port.0.vid=0x239a
adafruit_metro.upload_port.0.pid=0x813d
adafruit_metro.upload_port.1.vid=0x239a
adafruit_metro.upload_port.1.pid=0xc13d
adafruit_metro.build.usbvid=-DUSBD_VID=0x239a
adafruit_metro.build.usbpid=-DUSBD_PID=0x813d
adafruit_metro.build.usbpwr=-DUSBD_MAX_POWER_MA=250
adafruit_metro.build.board=ADAFRUIT_METRO_RP2040
adafruit_metro.build.mcu=cortex-m0plus
adafruit_metro.build.chip=rp2040
adafruit_metro.build.toolchain=arm-none-eabi
adafruit_metro.build.toolchainpkg=pqt-gcc
adafruit_metro.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
adafruit_metro.build.uf2family=--family rp2040
adafruit_metro.build.variant=adafruit_metro
adafruit_metro.upload.maximum_size=16777216
adafruit_metro.upload.wait_for_upload_port=true
adafruit_metro.upload.erase_cmd=
adafruit_metro.serial.disableDTR=false
adafruit_metro.serial.disableRTS=false
adafruit_metro.build.f_cpu=125000000
adafruit_metro.build.led=
adafruit_metro.build.core=rp2040
adafruit_metro.build.ldscript=memmap_default.ld
adafruit_metro.build.boot2=boot2_w25q080_2_padded_checksum
adafruit_metro.build.usb_manufacturer="Adafruit"
adafruit_metro.build.usb_product="Metro RP2040"
adafruit_metro.menu.flash.16777216_0=16MB (no FS)
adafruit_metro.menu.flash.16777216_0.upload.maximum_size=16773120
adafruit_metro.menu.flash.16777216_0.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_0.build.flash_length=16773120
adafruit_metro.menu.flash.16777216_0.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_0.build.fs_start=285208576
adafruit_metro.menu.flash.16777216_0.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
adafruit_metro.menu.flash.16777216_65536.upload.maximum_size=16707584
adafruit_metro.menu.flash.16777216_65536.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_65536.build.flash_length=16707584
adafruit_metro.menu.flash.16777216_65536.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_65536.build.fs_start=285143040
adafruit_metro.menu.flash.16777216_65536.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
adafruit_metro.menu.flash.16777216_131072.upload.maximum_size=16642048
adafruit_metro.menu.flash.16777216_131072.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_131072.build.flash_length=16642048
adafruit_metro.menu.flash.16777216_131072.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_131072.build.fs_start=285077504
adafruit_metro.menu.flash.16777216_131072.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
adafruit_metro.menu.flash.16777216_262144.upload.maximum_size=16510976
adafruit_metro.menu.flash.16777216_262144.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_262144.build.flash_length=16510976
adafruit_metro.menu.flash.16777216_262144.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_262144.build.fs_start=284946432
adafruit_metro.menu.flash.16777216_262144.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
adafruit_metro.menu.flash.16777216_524288.upload.maximum_size=16248832
adafruit_metro.menu.flash.16777216_524288.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_524288.build.flash_length=16248832
adafruit_metro.menu.flash.16777216_524288.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_524288.build.fs_start=284684288
adafruit_metro.menu.flash.16777216_524288.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
adafruit_metro.menu.flash.16777216_1048576.upload.maximum_size=15724544
adafruit_metro.menu.flash.16777216_1048576.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_1048576.build.flash_length=15724544
adafruit_metro.menu.flash.16777216_1048576.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_1048576.build.fs_start=284160000
adafruit_metro.menu.flash.16777216_1048576.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
adafruit_metro.menu.flash.16777216_2097152.upload.maximum_size=14675968
adafruit_metro.menu.flash.16777216_2097152.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_2097152.build.flash_length=14675968
adafruit_metro.menu.flash.16777216_2097152.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_2097152.build.fs_start=283111424
adafruit_metro.menu.flash.16777216_2097152.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
adafruit_metro.menu.flash.16777216_3145728.upload.maximum_size=13627392
adafruit_metro.menu.flash.16777216_3145728.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_3145728.build.flash_length=13627392
adafruit_metro.menu.flash.16777216_3145728.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_3145728.build.fs_start=282062848
adafruit_metro.menu.flash.16777216_3145728.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
adafruit_metro.menu.flash.16777216_4194304.upload.maximum_size=12578816
adafruit_metro.menu.flash.16777216_4194304.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_4194304.build.flash_length=12578816
adafruit_metro.menu.flash.16777216_4194304.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_4194304.build.fs_start=281014272
adafruit_metro.menu.flash.16777216_4194304.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
adafruit_metro.menu.flash.16777216_5242880.upload.maximum_size=11530240
adafruit_metro.menu.flash.16777216_5242880.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_5242880.build.flash_length=11530240
adafruit_metro.menu.flash.16777216_5242880.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_5242880.build.fs_start=279965696
adafruit_metro.menu.flash.16777216_5242880.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
adafruit_metro.menu.flash.16777216_6291456.upload.maximum_size=10481664
adafruit_metro.menu.flash.16777216_6291456.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_6291456.build.flash_length=10481664
adafruit_metro.menu.flash.16777216_6291456.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_6291456.build.fs_start=278917120
adafruit_metro.menu.flash.16777216_6291456.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
adafruit_metro.menu.flash.16777216_7340032.upload.maximum_size=9433088
adafruit_metro.menu.flash.16777216_7340032.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_7340032.build.flash_length=9433088
adafruit_metro.menu.flash.16777216_7340032.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_7340032.build.fs_start=277868544
adafruit_metro.menu.flash.16777216_7340032.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
adafruit_metro.menu.flash.16777216_8388608.upload.maximum_size=8384512
adafruit_metro.menu.flash.16777216_8388608.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_8388608.build.flash_length=8384512
adafruit_metro.menu.flash.16777216_8388608.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_8388608.build.fs_start=276819968
adafruit_metro.menu.flash.16777216_8388608.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
adafruit_metro.menu.flash.16777216_9437184.upload.maximum_size=7335936
adafruit_metro.menu.flash.16777216_9437184.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_9437184.build.flash_length=7335936
adafruit_metro.menu.flash.16777216_9437184.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_9437184.build.fs_start=275771392
adafruit_metro.menu.flash.16777216_9437184.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
adafruit_metro.menu.flash.16777216_10485760.upload.maximum_size=6287360
adafruit_metro.menu.flash.16777216_10485760.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_10485760.build.flash_length=6287360
adafruit_metro.menu.flash.16777216_10485760.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_10485760.build.fs_start=274722816
adafruit_metro.menu.flash.16777216_10485760.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
adafruit_metro.menu.flash.16777216_11534336.upload.maximum_size=5238784
adafruit_metro.menu.flash.16777216_11534336.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_11534336.build.flash_length=5238784
adafruit_metro.menu.flash.16777216_11534336.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_11534336.build.fs_start=273674240
adafruit_metro.menu.flash.16777216_11534336.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
adafruit_metro.menu.flash.16777216_12582912.upload.maximum_size=4190208
adafruit_metro.menu.flash.16777216_12582912.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_12582912.build.flash_length=4190208
adafruit_metro.menu.flash.16777216_12582912.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_12582912.build.fs_start=272625664
adafruit_metro.menu.flash.16777216_12582912.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
adafruit_metro.menu.flash.16777216_13631488.upload.maximum_size=3141632
adafruit_metro.menu.flash.16777216_13631488.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_13631488.build.flash_length=3141632
adafruit_metro.menu.flash.16777216_13631488.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_13631488.build.fs_start=271577088
adafruit_metro.menu.flash.16777216_13631488.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
adafruit_metro.menu.flash.16777216_14680064.upload.maximum_size=2093056
adafruit_metro.menu.flash.16777216_14680064.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_14680064.build.flash_length=2093056
adafruit_metro.menu.flash.16777216_14680064.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_14680064.build.fs_start=270528512
adafruit_metro.menu.flash.16777216_14680064.build.fs_end=285208576
adafruit_metro.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
adafruit_metro.menu.flash.16777216_15728640.upload.maximum_size=1044480
adafruit_metro.menu.flash.16777216_15728640.build.flash_total=16777216
adafruit_metro.menu.flash.16777216_15728640.build.flash_length=1044480
adafruit_metro.menu.flash.16777216_15728640.build.eeprom_start=285208576
adafruit_metro.menu.flash.16777216_15728640.build.fs_start=269479936
adafruit_metro.menu.flash.16777216_15728640.build.fs_end=285208576
adafruit_metro.menu.freq.200=200 MHz
adafruit_metro.menu.freq.200.build.f_cpu=200000000L
adafruit_metro.menu.freq.50=50 MHz
adafruit_metro.menu.freq.50.build.f_cpu=50000000L
adafruit_metro.menu.freq.100=100 MHz
adafruit_metro.menu.freq.100.build.f_cpu=100000000L
adafruit_metro.menu.freq.120=120 MHz
adafruit_metro.menu.freq.120.build.f_cpu=120000000L
adafruit_metro.menu.freq.125=125 MHz
adafruit_metro.menu.freq.125.build.f_cpu=125000000L
adafruit_metro.menu.freq.128=128 MHz
adafruit_metro.menu.freq.128.build.f_cpu=128000000L
adafruit_metro.menu.freq.133=133 MHz
adafruit_metro.menu.freq.133.build.f_cpu=133000000L
adafruit_metro.menu.freq.150=150 MHz
adafruit_metro.menu.freq.150.build.f_cpu=150000000L
adafruit_metro.menu.freq.176=176 MHz
adafruit_metro.menu.freq.176.build.f_cpu=176000000L
adafruit_metro.menu.freq.225=225 MHz (Overclock)
adafruit_metro.menu.freq.225.build.f_cpu=225000000L
adafruit_metro.menu.freq.240=240 MHz (Overclock)
adafruit_metro.menu.freq.240.build.f_cpu=240000000L
adafruit_metro.menu.freq.250=250 MHz (Overclock)
adafruit_metro.menu.freq.250.build.f_cpu=250000000L
adafruit_metro.menu.freq.276=276 MHz (Overclock)
adafruit_metro.menu.freq.276.build.f_cpu=276000000L
adafruit_metro.menu.freq.300=300 MHz (Overclock)
adafruit_metro.menu.freq.300.build.f_cpu=300000000L
adafruit_metro.menu.opt.Small=Small (-Os) (standard)
adafruit_metro.menu.opt.Small.build.flags.optimize=-Os
adafruit_metro.menu.opt.Optimize=Optimize (-O)
adafruit_metro.menu.opt.Optimize.build.flags.optimize=-O
adafruit_metro.menu.opt.Optimize2=Optimize More (-O2)
adafruit_metro.menu.opt.Optimize2.build.flags.optimize=-O2
adafruit_metro.menu.opt.Optimize3=Optimize Even More (-O3)
adafruit_metro.menu.opt.Optimize3.build.flags.optimize=-O3
adafruit_metro.menu.opt.Fast=Fast (-Ofast) (maybe slower)
adafruit_metro.menu.opt.Fast.build.flags.optimize=-Ofast
adafruit_metro.menu.opt.Debug=Debug (-Og)
adafruit_metro.menu.opt.Debug.build.flags.optimize=-Og
adafruit_metro.menu.opt.Disabled=Disabled (-O0)
adafruit_metro.menu.opt.Disabled.build.flags.optimize=-O0
adafruit_metro.menu.profile.Disabled=Disabled
adafruit_metro.menu.profile.Disabled.build.flags.profile=
adafruit_metro.menu.profile.Enabled=Enabled
adafruit_metro.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
adafruit_metro.menu.rtti.Disabled=Disabled
adafruit_metro.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
adafruit_metro.menu.rtti.Enabled=Enabled
adafruit_metro.menu.rtti.Enabled.build.flags.rtti=
adafruit_metro.menu.stackprotect.Disabled=Disabled
adafruit_metro.menu.stackprotect.Disabled.build.flags.stackprotect=
adafruit_metro.menu.stackprotect.Enabled=Enabled
adafruit_metro.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
adafruit_metro.menu.exceptions.Disabled=Disabled
adafruit_metro.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
adafruit_metro.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
adafruit_metro.menu.exceptions.Enabled=Enabled
adafruit_metro.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
adafruit_metro.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
adafruit_metro.menu.dbgport.Disabled=Disabled
adafruit_metro.menu.dbgport.Disabled.build.debug_port=
adafruit_metro.menu.dbgport.Serial=Serial
adafruit_metro.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_metro.menu.dbgport.Serial1=Serial1
adafruit_metro.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_metro.menu.dbgport.Serial2=Serial2
adafruit_metro.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_metro.menu.dbgport.SerialSemi=SerialSemi
adafruit_metro.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
adafruit_metro.menu.dbglvl.None=None
adafruit_metro.menu.dbglvl.None.build.debug_level=
adafruit_metro.menu.dbglvl.Core=Core
adafruit_metro.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_metro.menu.dbglvl.SPI=SPI
adafruit_metro.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_metro.menu.dbglvl.Wire=Wire
adafruit_metro.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_metro.menu.dbglvl.Bluetooth=Bluetooth
adafruit_metro.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
adafruit_metro.menu.dbglvl.All=All
adafruit_metro.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
adafruit_metro.menu.dbglvl.NDEBUG=NDEBUG
adafruit_metro.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_metro.menu.usbstack.picosdk=Pico SDK
adafruit_metro.menu.usbstack.picosdk.build.usbstack_flags=
adafruit_metro.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_metro.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_metro.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
adafruit_metro.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_metro.menu.usbstack.nousb=No USB
adafruit_metro.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
adafruit_metro.menu.ipbtstack.ipv4only=IPv4 Only
adafruit_metro.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
adafruit_metro.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
adafruit_metro.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
adafruit_metro.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
adafruit_metro.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
adafruit_metro.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
adafruit_metro.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
adafruit_metro.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_metro.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
adafruit_metro.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
adafruit_metro.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_metro.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
adafruit_metro.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
adafruit_metro.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_metro.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
adafruit_metro.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
adafruit_metro.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_metro.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
