earlephilhower/arduino-pico/boards.txt
adafruit_kb2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
adafruit_kb2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_kb2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
adafruit_kb2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
adafruit_kb2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Adafruit Feather RP2350 Adalogger
# -----------------------------------
adafruit_feather_rp2350_adalogger.name=Adafruit Feather RP2350 Adalogger
adafruit_feather_rp2350_adalogger.vid.0=0x239a
adafruit_feather_rp2350_adalogger.pid.0=0x816d
adafruit_feather_rp2350_adalogger.vid.1=0x239a
adafruit_feather_rp2350_adalogger.pid.1=0xc16d
adafruit_feather_rp2350_adalogger.upload_port.0.vid=0x239a
adafruit_feather_rp2350_adalogger.upload_port.0.pid=0x816d
adafruit_feather_rp2350_adalogger.upload_port.1.vid=0x239a
adafruit_feather_rp2350_adalogger.upload_port.1.pid=0xc16d
adafruit_feather_rp2350_adalogger.build.usbvid=-DUSBD_VID=0x239a
adafruit_feather_rp2350_adalogger.build.usbpid=-DUSBD_PID=0x816d
adafruit_feather_rp2350_adalogger.build.usbpwr=-DUSBD_MAX_POWER_MA=250
adafruit_feather_rp2350_adalogger.build.board=ADAFRUIT_FEATHER_RP2350_ADALOGGER
adafruit_feather_rp2350_adalogger.build.variant=adafruit_feather_rp2350_adalogger
adafruit_feather_rp2350_adalogger.upload.maximum_size=8388608
adafruit_feather_rp2350_adalogger.upload.wait_for_upload_port=true
adafruit_feather_rp2350_adalogger.upload.erase_cmd=
adafruit_feather_rp2350_adalogger.serial.disableDTR=false
adafruit_feather_rp2350_adalogger.serial.disableRTS=false
adafruit_feather_rp2350_adalogger.build.f_cpu=125000000
adafruit_feather_rp2350_adalogger.build.led=
adafruit_feather_rp2350_adalogger.build.core=rp2040
adafruit_feather_rp2350_adalogger.build.ldscript=memmap_default.ld
adafruit_feather_rp2350_adalogger.build.boot2=none
adafruit_feather_rp2350_adalogger.build.usb_manufacturer="Adafruit"
adafruit_feather_rp2350_adalogger.build.usb_product="Feather RP2350 Adalogger"
adafruit_feather_rp2350_adalogger.build.psram_length=0x000000
adafruit_feather_rp2350_adalogger.menu.flash.8388608_0=8MB (no FS)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_0.upload.maximum_size=8380416
adafruit_feather_rp2350_adalogger.menu.flash.8388608_0.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_0.build.flash_length=8380416
adafruit_feather_rp2350_adalogger.menu.flash.8388608_0.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_0.build.fs_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_0.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_65536.upload.maximum_size=8314880
adafruit_feather_rp2350_adalogger.menu.flash.8388608_65536.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_65536.build.flash_length=8314880
adafruit_feather_rp2350_adalogger.menu.flash.8388608_65536.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_65536.build.fs_start=276750336
adafruit_feather_rp2350_adalogger.menu.flash.8388608_65536.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_131072.upload.maximum_size=8249344
adafruit_feather_rp2350_adalogger.menu.flash.8388608_131072.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_131072.build.flash_length=8249344
adafruit_feather_rp2350_adalogger.menu.flash.8388608_131072.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_131072.build.fs_start=276684800
adafruit_feather_rp2350_adalogger.menu.flash.8388608_131072.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_262144.upload.maximum_size=8118272
adafruit_feather_rp2350_adalogger.menu.flash.8388608_262144.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_262144.build.flash_length=8118272
adafruit_feather_rp2350_adalogger.menu.flash.8388608_262144.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_262144.build.fs_start=276553728
adafruit_feather_rp2350_adalogger.menu.flash.8388608_262144.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_524288.upload.maximum_size=7856128
adafruit_feather_rp2350_adalogger.menu.flash.8388608_524288.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_524288.build.flash_length=7856128
adafruit_feather_rp2350_adalogger.menu.flash.8388608_524288.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_524288.build.fs_start=276291584
adafruit_feather_rp2350_adalogger.menu.flash.8388608_524288.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_1048576.upload.maximum_size=7331840
adafruit_feather_rp2350_adalogger.menu.flash.8388608_1048576.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_1048576.build.flash_length=7331840
adafruit_feather_rp2350_adalogger.menu.flash.8388608_1048576.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_1048576.build.fs_start=275767296
adafruit_feather_rp2350_adalogger.menu.flash.8388608_1048576.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_2097152.upload.maximum_size=6283264
adafruit_feather_rp2350_adalogger.menu.flash.8388608_2097152.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_2097152.build.flash_length=6283264
adafruit_feather_rp2350_adalogger.menu.flash.8388608_2097152.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_2097152.build.fs_start=274718720
adafruit_feather_rp2350_adalogger.menu.flash.8388608_2097152.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_3145728.upload.maximum_size=5234688
adafruit_feather_rp2350_adalogger.menu.flash.8388608_3145728.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_3145728.build.flash_length=5234688
adafruit_feather_rp2350_adalogger.menu.flash.8388608_3145728.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_3145728.build.fs_start=273670144
adafruit_feather_rp2350_adalogger.menu.flash.8388608_3145728.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_4194304.upload.maximum_size=4186112
adafruit_feather_rp2350_adalogger.menu.flash.8388608_4194304.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_4194304.build.flash_length=4186112
adafruit_feather_rp2350_adalogger.menu.flash.8388608_4194304.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_4194304.build.fs_start=272621568
adafruit_feather_rp2350_adalogger.menu.flash.8388608_4194304.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_5242880.upload.maximum_size=3137536
adafruit_feather_rp2350_adalogger.menu.flash.8388608_5242880.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_5242880.build.flash_length=3137536
adafruit_feather_rp2350_adalogger.menu.flash.8388608_5242880.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_5242880.build.fs_start=271572992
adafruit_feather_rp2350_adalogger.menu.flash.8388608_5242880.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_6291456.upload.maximum_size=2088960
adafruit_feather_rp2350_adalogger.menu.flash.8388608_6291456.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_6291456.build.flash_length=2088960
adafruit_feather_rp2350_adalogger.menu.flash.8388608_6291456.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_6291456.build.fs_start=270524416
adafruit_feather_rp2350_adalogger.menu.flash.8388608_6291456.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
adafruit_feather_rp2350_adalogger.menu.flash.8388608_7340032.upload.maximum_size=1040384
adafruit_feather_rp2350_adalogger.menu.flash.8388608_7340032.build.flash_total=8388608
adafruit_feather_rp2350_adalogger.menu.flash.8388608_7340032.build.flash_length=1040384
adafruit_feather_rp2350_adalogger.menu.flash.8388608_7340032.build.eeprom_start=276815872
adafruit_feather_rp2350_adalogger.menu.flash.8388608_7340032.build.fs_start=269475840
adafruit_feather_rp2350_adalogger.menu.flash.8388608_7340032.build.fs_end=276815872
adafruit_feather_rp2350_adalogger.menu.arch.arm=ARM
adafruit_feather_rp2350_adalogger.menu.arch.arm.build.chip=rp2350
adafruit_feather_rp2350_adalogger.menu.arch.arm.build.toolchain=arm-none-eabi
adafruit_feather_rp2350_adalogger.menu.arch.arm.build.toolchainpkg=pqt-gcc
adafruit_feather_rp2350_adalogger.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
adafruit_feather_rp2350_adalogger.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
adafruit_feather_rp2350_adalogger.menu.arch.arm.build.mcu=cortex-m33
adafruit_feather_rp2350_adalogger.menu.arch.riscv=RISC-V
adafruit_feather_rp2350_adalogger.menu.arch.riscv.build.chip=rp2350-riscv
adafruit_feather_rp2350_adalogger.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
adafruit_feather_rp2350_adalogger.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
adafruit_feather_rp2350_adalogger.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
adafruit_feather_rp2350_adalogger.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
adafruit_feather_rp2350_adalogger.menu.arch.riscv.build.mcu=rv32imac
adafruit_feather_rp2350_adalogger.menu.freq.150=150 MHz
adafruit_feather_rp2350_adalogger.menu.freq.150.build.f_cpu=150000000L
adafruit_feather_rp2350_adalogger.menu.freq.50=50 MHz
adafruit_feather_rp2350_adalogger.menu.freq.50.build.f_cpu=50000000L
adafruit_feather_rp2350_adalogger.menu.freq.100=100 MHz
adafruit_feather_rp2350_adalogger.menu.freq.100.build.f_cpu=100000000L
adafruit_feather_rp2350_adalogger.menu.freq.120=120 MHz
adafruit_feather_rp2350_adalogger.menu.freq.120.build.f_cpu=120000000L
adafruit_feather_rp2350_adalogger.menu.freq.125=125 MHz
adafruit_feather_rp2350_adalogger.menu.freq.125.build.f_cpu=125000000L
adafruit_feather_rp2350_adalogger.menu.freq.128=128 MHz
adafruit_feather_rp2350_adalogger.menu.freq.128.build.f_cpu=128000000L
adafruit_feather_rp2350_adalogger.menu.freq.133=133 MHz
adafruit_feather_rp2350_adalogger.menu.freq.133.build.f_cpu=133000000L
adafruit_feather_rp2350_adalogger.menu.freq.176=176 MHz (Overclock)
adafruit_feather_rp2350_adalogger.menu.freq.176.build.f_cpu=176000000L
adafruit_feather_rp2350_adalogger.menu.freq.200=200 MHz (Overclock)
adafruit_feather_rp2350_adalogger.menu.freq.200.build.f_cpu=200000000L
adafruit_feather_rp2350_adalogger.menu.freq.225=225 MHz (Overclock)
adafruit_feather_rp2350_adalogger.menu.freq.225.build.f_cpu=225000000L
adafruit_feather_rp2350_adalogger.menu.freq.240=240 MHz (Overclock)
adafruit_feather_rp2350_adalogger.menu.freq.240.build.f_cpu=240000000L
adafruit_feather_rp2350_adalogger.menu.freq.250=250 MHz (Overclock)
adafruit_feather_rp2350_adalogger.menu.freq.250.build.f_cpu=250000000L
adafruit_feather_rp2350_adalogger.menu.freq.276=276 MHz (Overclock)
adafruit_feather_rp2350_adalogger.menu.freq.276.build.f_cpu=276000000L
adafruit_feather_rp2350_adalogger.menu.freq.300=300 MHz (Overclock)
adafruit_feather_rp2350_adalogger.menu.freq.300.build.f_cpu=300000000L
adafruit_feather_rp2350_adalogger.menu.opt.Small=Small (-Os) (standard)
adafruit_feather_rp2350_adalogger.menu.opt.Small.build.flags.optimize=-Os
adafruit_feather_rp2350_adalogger.menu.opt.Optimize=Optimize (-O)
adafruit_feather_rp2350_adalogger.menu.opt.Optimize.build.flags.optimize=-O
adafruit_feather_rp2350_adalogger.menu.opt.Optimize2=Optimize More (-O2)
adafruit_feather_rp2350_adalogger.menu.opt.Optimize2.build.flags.optimize=-O2
adafruit_feather_rp2350_adalogger.menu.opt.Optimize3=Optimize Even More (-O3)
adafruit_feather_rp2350_adalogger.menu.opt.Optimize3.build.flags.optimize=-O3
adafruit_feather_rp2350_adalogger.menu.opt.Fast=Fast (-Ofast) (maybe slower)
adafruit_feather_rp2350_adalogger.menu.opt.Fast.build.flags.optimize=-Ofast
adafruit_feather_rp2350_adalogger.menu.opt.Debug=Debug (-Og)
adafruit_feather_rp2350_adalogger.menu.opt.Debug.build.flags.optimize=-Og
adafruit_feather_rp2350_adalogger.menu.opt.Disabled=Disabled (-O0)
adafruit_feather_rp2350_adalogger.menu.opt.Disabled.build.flags.optimize=-O0
adafruit_feather_rp2350_adalogger.menu.profile.Disabled=Disabled
adafruit_feather_rp2350_adalogger.menu.profile.Disabled.build.flags.profile=
adafruit_feather_rp2350_adalogger.menu.profile.Enabled=Enabled
adafruit_feather_rp2350_adalogger.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
adafruit_feather_rp2350_adalogger.menu.rtti.Disabled=Disabled
adafruit_feather_rp2350_adalogger.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
adafruit_feather_rp2350_adalogger.menu.rtti.Enabled=Enabled
adafruit_feather_rp2350_adalogger.menu.rtti.Enabled.build.flags.rtti=
adafruit_feather_rp2350_adalogger.menu.stackprotect.Disabled=Disabled
adafruit_feather_rp2350_adalogger.menu.stackprotect.Disabled.build.flags.stackprotect=
adafruit_feather_rp2350_adalogger.menu.stackprotect.Enabled=Enabled
adafruit_feather_rp2350_adalogger.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
adafruit_feather_rp2350_adalogger.menu.exceptions.Disabled=Disabled
adafruit_feather_rp2350_adalogger.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
adafruit_feather_rp2350_adalogger.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
adafruit_feather_rp2350_adalogger.menu.exceptions.Enabled=Enabled
adafruit_feather_rp2350_adalogger.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
adafruit_feather_rp2350_adalogger.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
adafruit_feather_rp2350_adalogger.menu.dbgport.Disabled=Disabled
adafruit_feather_rp2350_adalogger.menu.dbgport.Disabled.build.debug_port=
adafruit_feather_rp2350_adalogger.menu.dbgport.Serial=Serial
adafruit_feather_rp2350_adalogger.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_feather_rp2350_adalogger.menu.dbgport.Serial1=Serial1
adafruit_feather_rp2350_adalogger.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_feather_rp2350_adalogger.menu.dbgport.Serial2=Serial2
adafruit_feather_rp2350_adalogger.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_feather_rp2350_adalogger.menu.dbgport.SerialSemi=SerialSemi
adafruit_feather_rp2350_adalogger.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
adafruit_feather_rp2350_adalogger.menu.dbglvl.None=None
adafruit_feather_rp2350_adalogger.menu.dbglvl.None.build.debug_level=
adafruit_feather_rp2350_adalogger.menu.dbglvl.Core=Core
adafruit_feather_rp2350_adalogger.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_feather_rp2350_adalogger.menu.dbglvl.SPI=SPI
adafruit_feather_rp2350_adalogger.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_feather_rp2350_adalogger.menu.dbglvl.Wire=Wire
adafruit_feather_rp2350_adalogger.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_feather_rp2350_adalogger.menu.dbglvl.Bluetooth=Bluetooth
adafruit_feather_rp2350_adalogger.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
adafruit_feather_rp2350_adalogger.menu.dbglvl.All=All
adafruit_feather_rp2350_adalogger.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
adafruit_feather_rp2350_adalogger.menu.dbglvl.NDEBUG=NDEBUG
adafruit_feather_rp2350_adalogger.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_feather_rp2350_adalogger.menu.usbstack.picosdk=Pico SDK
adafruit_feather_rp2350_adalogger.menu.usbstack.picosdk.build.usbstack_flags=
adafruit_feather_rp2350_adalogger.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_feather_rp2350_adalogger.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_feather_rp2350_adalogger.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
adafruit_feather_rp2350_adalogger.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_feather_rp2350_adalogger.menu.usbstack.nousb=No USB
adafruit_feather_rp2350_adalogger.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
adafruit_feather_rp2350_adalogger.menu.ipbtstack.ipv4only=IPv4 Only
adafruit_feather_rp2350_adalogger.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
adafruit_feather_rp2350_adalogger.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
