earlephilhower/arduino-pico/boards.txt
adafruit_feather_rp2350_hstx.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
adafruit_feather_rp2350_hstx.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
adafruit_feather_rp2350_hstx.menu.dbgport.Disabled=Disabled
adafruit_feather_rp2350_hstx.menu.dbgport.Disabled.build.debug_port=
adafruit_feather_rp2350_hstx.menu.dbgport.Serial=Serial
adafruit_feather_rp2350_hstx.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_feather_rp2350_hstx.menu.dbgport.Serial1=Serial1
adafruit_feather_rp2350_hstx.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_feather_rp2350_hstx.menu.dbgport.Serial2=Serial2
adafruit_feather_rp2350_hstx.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_feather_rp2350_hstx.menu.dbgport.SerialSemi=SerialSemi
adafruit_feather_rp2350_hstx.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
adafruit_feather_rp2350_hstx.menu.dbglvl.None=None
adafruit_feather_rp2350_hstx.menu.dbglvl.None.build.debug_level=
adafruit_feather_rp2350_hstx.menu.dbglvl.Core=Core
adafruit_feather_rp2350_hstx.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_feather_rp2350_hstx.menu.dbglvl.SPI=SPI
adafruit_feather_rp2350_hstx.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_feather_rp2350_hstx.menu.dbglvl.Wire=Wire
adafruit_feather_rp2350_hstx.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_feather_rp2350_hstx.menu.dbglvl.Bluetooth=Bluetooth
adafruit_feather_rp2350_hstx.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
adafruit_feather_rp2350_hstx.menu.dbglvl.All=All
adafruit_feather_rp2350_hstx.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
adafruit_feather_rp2350_hstx.menu.dbglvl.NDEBUG=NDEBUG
adafruit_feather_rp2350_hstx.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_feather_rp2350_hstx.menu.usbstack.picosdk=Pico SDK
adafruit_feather_rp2350_hstx.menu.usbstack.picosdk.build.usbstack_flags=
adafruit_feather_rp2350_hstx.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_feather_rp2350_hstx.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_feather_rp2350_hstx.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
adafruit_feather_rp2350_hstx.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_feather_rp2350_hstx.menu.usbstack.nousb=No USB
adafruit_feather_rp2350_hstx.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4only=IPv4 Only
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
adafruit_feather_rp2350_hstx.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_feather_rp2350_hstx.menu.uploadmethod.default=Default (UF2)
adafruit_feather_rp2350_hstx.menu.uploadmethod.default.build.ram_length=512k
adafruit_feather_rp2350_hstx.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_feather_rp2350_hstx.menu.uploadmethod.default.upload.maximum_data_size=524288
adafruit_feather_rp2350_hstx.menu.uploadmethod.default.upload.tool=uf2conv
adafruit_feather_rp2350_hstx.menu.uploadmethod.default.upload.tool.default=uf2conv
adafruit_feather_rp2350_hstx.menu.uploadmethod.default.upload.tool.network=uf2conv-network
adafruit_feather_rp2350_hstx.menu.uploadmethod.picotool=Picotool
adafruit_feather_rp2350_hstx.menu.uploadmethod.picotool.build.ram_length=512k
adafruit_feather_rp2350_hstx.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
adafruit_feather_rp2350_hstx.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
adafruit_feather_rp2350_hstx.menu.uploadmethod.picotool.upload.maximum_data_size=524288
adafruit_feather_rp2350_hstx.menu.uploadmethod.picotool.upload.tool=picotool
adafruit_feather_rp2350_hstx.menu.uploadmethod.picotool.upload.tool.default=picotool
adafruit_feather_rp2350_hstx.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
adafruit_feather_rp2350_hstx.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
adafruit_feather_rp2350_hstx.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_feather_rp2350_hstx.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
adafruit_feather_rp2350_hstx.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
adafruit_feather_rp2350_hstx.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

