earlephilhower/arduino-pico/boards.txt
adafruit_floppsy.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
adafruit_floppsy.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_floppsy.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
adafruit_floppsy.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
adafruit_floppsy.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_floppsy.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
adafruit_floppsy.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
adafruit_floppsy.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_floppsy.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
adafruit_floppsy.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
adafruit_floppsy.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_floppsy.menu.boot2.boot2_w25q080_2_padded_checksum=W25Q080 QSPI /2
adafruit_floppsy.menu.boot2.boot2_w25q080_2_padded_checksum.build.boot2=boot2_w25q080_2_padded_checksum
adafruit_floppsy.menu.boot2.boot2_w25q080_4_padded_checksum=W25Q080 QSPI /4
adafruit_floppsy.menu.boot2.boot2_w25q080_4_padded_checksum.build.boot2=boot2_w25q080_4_padded_checksum
adafruit_floppsy.menu.uploadmethod.default=Default (UF2)
adafruit_floppsy.menu.uploadmethod.default.build.ram_length=256k
adafruit_floppsy.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_floppsy.menu.uploadmethod.default.upload.maximum_data_size=262144
adafruit_floppsy.menu.uploadmethod.default.upload.tool=uf2conv
adafruit_floppsy.menu.uploadmethod.default.upload.tool.default=uf2conv
adafruit_floppsy.menu.uploadmethod.default.upload.tool.network=uf2conv-network
adafruit_floppsy.menu.uploadmethod.picotool=Picotool
adafruit_floppsy.menu.uploadmethod.picotool.build.ram_length=256k
adafruit_floppsy.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
adafruit_floppsy.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
adafruit_floppsy.menu.uploadmethod.picotool.upload.maximum_data_size=262144
adafruit_floppsy.menu.uploadmethod.picotool.upload.tool=picotool
adafruit_floppsy.menu.uploadmethod.picotool.upload.tool.default=picotool
adafruit_floppsy.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
adafruit_floppsy.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
adafruit_floppsy.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_floppsy.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
adafruit_floppsy.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
adafruit_floppsy.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Adafruit Metro RP2350
# -----------------------------------
adafruit_metro_rp2350.name=Adafruit Metro RP2350
adafruit_metro_rp2350.vid.0=0x239a
adafruit_metro_rp2350.pid.0=0x814d
adafruit_metro_rp2350.vid.1=0x239a
adafruit_metro_rp2350.pid.1=0xc14d
adafruit_metro_rp2350.upload_port.0.vid=0x239a
adafruit_metro_rp2350.upload_port.0.pid=0x814d
adafruit_metro_rp2350.upload_port.1.vid=0x239a
adafruit_metro_rp2350.upload_port.1.pid=0xc14d
adafruit_metro_rp2350.build.usbvid=-DUSBD_VID=0x239a
adafruit_metro_rp2350.build.usbpid=-DUSBD_PID=0x814d
adafruit_metro_rp2350.build.usbpwr=-DUSBD_MAX_POWER_MA=250
adafruit_metro_rp2350.build.board=ADAFRUIT_METRO_RP2350
adafruit_metro_rp2350.build.variant=adafruit_metro_rp2350
adafruit_metro_rp2350.upload.maximum_size=16777216
adafruit_metro_rp2350.upload.wait_for_upload_port=true
adafruit_metro_rp2350.upload.erase_cmd=
adafruit_metro_rp2350.serial.disableDTR=false
adafruit_metro_rp2350.serial.disableRTS=false
adafruit_metro_rp2350.build.f_cpu=125000000
adafruit_metro_rp2350.build.led=
adafruit_metro_rp2350.build.core=rp2040
adafruit_metro_rp2350.build.ldscript=memmap_default.ld
adafruit_metro_rp2350.build.boot2=none
adafruit_metro_rp2350.build.usb_manufacturer="Adafruit"
adafruit_metro_rp2350.build.usb_product="Metro RP2350"
adafruit_metro_rp2350.build.psram_length=0x000000
adafruit_metro_rp2350.menu.flash.16777216_0=16MB (no FS)
adafruit_metro_rp2350.menu.flash.16777216_0.upload.maximum_size=16769024
adafruit_metro_rp2350.menu.flash.16777216_0.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_0.build.flash_length=16769024
adafruit_metro_rp2350.menu.flash.16777216_0.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_0.build.fs_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_0.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
adafruit_metro_rp2350.menu.flash.16777216_65536.upload.maximum_size=16703488
adafruit_metro_rp2350.menu.flash.16777216_65536.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_65536.build.flash_length=16703488
adafruit_metro_rp2350.menu.flash.16777216_65536.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_65536.build.fs_start=285138944
adafruit_metro_rp2350.menu.flash.16777216_65536.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
adafruit_metro_rp2350.menu.flash.16777216_131072.upload.maximum_size=16637952
adafruit_metro_rp2350.menu.flash.16777216_131072.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_131072.build.flash_length=16637952
adafruit_metro_rp2350.menu.flash.16777216_131072.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_131072.build.fs_start=285073408
adafruit_metro_rp2350.menu.flash.16777216_131072.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
adafruit_metro_rp2350.menu.flash.16777216_262144.upload.maximum_size=16506880
adafruit_metro_rp2350.menu.flash.16777216_262144.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_262144.build.flash_length=16506880
adafruit_metro_rp2350.menu.flash.16777216_262144.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_262144.build.fs_start=284942336
adafruit_metro_rp2350.menu.flash.16777216_262144.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
adafruit_metro_rp2350.menu.flash.16777216_524288.upload.maximum_size=16244736
adafruit_metro_rp2350.menu.flash.16777216_524288.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_524288.build.flash_length=16244736
adafruit_metro_rp2350.menu.flash.16777216_524288.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_524288.build.fs_start=284680192
adafruit_metro_rp2350.menu.flash.16777216_524288.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
adafruit_metro_rp2350.menu.flash.16777216_1048576.upload.maximum_size=15720448
adafruit_metro_rp2350.menu.flash.16777216_1048576.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_1048576.build.flash_length=15720448
adafruit_metro_rp2350.menu.flash.16777216_1048576.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_1048576.build.fs_start=284155904
adafruit_metro_rp2350.menu.flash.16777216_1048576.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
adafruit_metro_rp2350.menu.flash.16777216_2097152.upload.maximum_size=14671872
adafruit_metro_rp2350.menu.flash.16777216_2097152.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_2097152.build.flash_length=14671872
adafruit_metro_rp2350.menu.flash.16777216_2097152.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_2097152.build.fs_start=283107328
adafruit_metro_rp2350.menu.flash.16777216_2097152.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
adafruit_metro_rp2350.menu.flash.16777216_3145728.upload.maximum_size=13623296
adafruit_metro_rp2350.menu.flash.16777216_3145728.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_3145728.build.flash_length=13623296
adafruit_metro_rp2350.menu.flash.16777216_3145728.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_3145728.build.fs_start=282058752
adafruit_metro_rp2350.menu.flash.16777216_3145728.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
adafruit_metro_rp2350.menu.flash.16777216_4194304.upload.maximum_size=12574720
adafruit_metro_rp2350.menu.flash.16777216_4194304.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_4194304.build.flash_length=12574720
adafruit_metro_rp2350.menu.flash.16777216_4194304.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_4194304.build.fs_start=281010176
adafruit_metro_rp2350.menu.flash.16777216_4194304.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
adafruit_metro_rp2350.menu.flash.16777216_5242880.upload.maximum_size=11526144
adafruit_metro_rp2350.menu.flash.16777216_5242880.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_5242880.build.flash_length=11526144
adafruit_metro_rp2350.menu.flash.16777216_5242880.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_5242880.build.fs_start=279961600
adafruit_metro_rp2350.menu.flash.16777216_5242880.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
adafruit_metro_rp2350.menu.flash.16777216_6291456.upload.maximum_size=10477568
adafruit_metro_rp2350.menu.flash.16777216_6291456.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_6291456.build.flash_length=10477568
adafruit_metro_rp2350.menu.flash.16777216_6291456.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_6291456.build.fs_start=278913024
adafruit_metro_rp2350.menu.flash.16777216_6291456.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
adafruit_metro_rp2350.menu.flash.16777216_7340032.upload.maximum_size=9428992
adafruit_metro_rp2350.menu.flash.16777216_7340032.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_7340032.build.flash_length=9428992
adafruit_metro_rp2350.menu.flash.16777216_7340032.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_7340032.build.fs_start=277864448
adafruit_metro_rp2350.menu.flash.16777216_7340032.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
adafruit_metro_rp2350.menu.flash.16777216_8388608.upload.maximum_size=8380416
adafruit_metro_rp2350.menu.flash.16777216_8388608.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_8388608.build.flash_length=8380416
adafruit_metro_rp2350.menu.flash.16777216_8388608.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_8388608.build.fs_start=276815872
adafruit_metro_rp2350.menu.flash.16777216_8388608.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
adafruit_metro_rp2350.menu.flash.16777216_9437184.upload.maximum_size=7331840
adafruit_metro_rp2350.menu.flash.16777216_9437184.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_9437184.build.flash_length=7331840
adafruit_metro_rp2350.menu.flash.16777216_9437184.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_9437184.build.fs_start=275767296
adafruit_metro_rp2350.menu.flash.16777216_9437184.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
adafruit_metro_rp2350.menu.flash.16777216_10485760.upload.maximum_size=6283264
adafruit_metro_rp2350.menu.flash.16777216_10485760.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_10485760.build.flash_length=6283264
adafruit_metro_rp2350.menu.flash.16777216_10485760.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_10485760.build.fs_start=274718720
adafruit_metro_rp2350.menu.flash.16777216_10485760.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
adafruit_metro_rp2350.menu.flash.16777216_11534336.upload.maximum_size=5234688
adafruit_metro_rp2350.menu.flash.16777216_11534336.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_11534336.build.flash_length=5234688
adafruit_metro_rp2350.menu.flash.16777216_11534336.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_11534336.build.fs_start=273670144
adafruit_metro_rp2350.menu.flash.16777216_11534336.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
adafruit_metro_rp2350.menu.flash.16777216_12582912.upload.maximum_size=4186112
adafruit_metro_rp2350.menu.flash.16777216_12582912.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_12582912.build.flash_length=4186112
adafruit_metro_rp2350.menu.flash.16777216_12582912.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_12582912.build.fs_start=272621568
adafruit_metro_rp2350.menu.flash.16777216_12582912.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
adafruit_metro_rp2350.menu.flash.16777216_13631488.upload.maximum_size=3137536
adafruit_metro_rp2350.menu.flash.16777216_13631488.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_13631488.build.flash_length=3137536
adafruit_metro_rp2350.menu.flash.16777216_13631488.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_13631488.build.fs_start=271572992
adafruit_metro_rp2350.menu.flash.16777216_13631488.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
adafruit_metro_rp2350.menu.flash.16777216_14680064.upload.maximum_size=2088960
adafruit_metro_rp2350.menu.flash.16777216_14680064.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_14680064.build.flash_length=2088960
adafruit_metro_rp2350.menu.flash.16777216_14680064.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_14680064.build.fs_start=270524416
adafruit_metro_rp2350.menu.flash.16777216_14680064.build.fs_end=285204480
adafruit_metro_rp2350.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
adafruit_metro_rp2350.menu.flash.16777216_15728640.upload.maximum_size=1040384
adafruit_metro_rp2350.menu.flash.16777216_15728640.build.flash_total=16777216
adafruit_metro_rp2350.menu.flash.16777216_15728640.build.flash_length=1040384
adafruit_metro_rp2350.menu.flash.16777216_15728640.build.eeprom_start=285204480
adafruit_metro_rp2350.menu.flash.16777216_15728640.build.fs_start=269475840
adafruit_metro_rp2350.menu.flash.16777216_15728640.build.fs_end=285204480
adafruit_metro_rp2350.menu.arch.arm=ARM
adafruit_metro_rp2350.menu.arch.arm.build.chip=rp2350
adafruit_metro_rp2350.menu.arch.arm.build.toolchain=arm-none-eabi
adafruit_metro_rp2350.menu.arch.arm.build.toolchainpkg=pqt-gcc
adafruit_metro_rp2350.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
adafruit_metro_rp2350.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
adafruit_metro_rp2350.menu.arch.arm.build.mcu=cortex-m33
adafruit_metro_rp2350.menu.arch.riscv=RISC-V
adafruit_metro_rp2350.menu.arch.riscv.build.chip=rp2350-riscv
adafruit_metro_rp2350.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
adafruit_metro_rp2350.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
adafruit_metro_rp2350.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
adafruit_metro_rp2350.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
adafruit_metro_rp2350.menu.arch.riscv.build.mcu=rv32imac
adafruit_metro_rp2350.menu.freq.150=150 MHz
adafruit_metro_rp2350.menu.freq.150.build.f_cpu=150000000L
adafruit_metro_rp2350.menu.freq.50=50 MHz
adafruit_metro_rp2350.menu.freq.50.build.f_cpu=50000000L
adafruit_metro_rp2350.menu.freq.100=100 MHz
adafruit_metro_rp2350.menu.freq.100.build.f_cpu=100000000L
adafruit_metro_rp2350.menu.freq.120=120 MHz
adafruit_metro_rp2350.menu.freq.120.build.f_cpu=120000000L
adafruit_metro_rp2350.menu.freq.125=125 MHz
adafruit_metro_rp2350.menu.freq.125.build.f_cpu=125000000L
adafruit_metro_rp2350.menu.freq.128=128 MHz
adafruit_metro_rp2350.menu.freq.128.build.f_cpu=128000000L
adafruit_metro_rp2350.menu.freq.133=133 MHz
adafruit_metro_rp2350.menu.freq.133.build.f_cpu=133000000L
adafruit_metro_rp2350.menu.freq.176=176 MHz (Overclock)
adafruit_metro_rp2350.menu.freq.176.build.f_cpu=176000000L
adafruit_metro_rp2350.menu.freq.200=200 MHz (Overclock)
adafruit_metro_rp2350.menu.freq.200.build.f_cpu=200000000L
adafruit_metro_rp2350.menu.freq.225=225 MHz (Overclock)
adafruit_metro_rp2350.menu.freq.225.build.f_cpu=225000000L
adafruit_metro_rp2350.menu.freq.240=240 MHz (Overclock)
adafruit_metro_rp2350.menu.freq.240.build.f_cpu=240000000L
adafruit_metro_rp2350.menu.freq.250=250 MHz (Overclock)
adafruit_metro_rp2350.menu.freq.250.build.f_cpu=250000000L
adafruit_metro_rp2350.menu.freq.276=276 MHz (Overclock)
adafruit_metro_rp2350.menu.freq.276.build.f_cpu=276000000L
adafruit_metro_rp2350.menu.freq.300=300 MHz (Overclock)
adafruit_metro_rp2350.menu.freq.300.build.f_cpu=300000000L
adafruit_metro_rp2350.menu.psram.0mb=0MByte PSRAM
adafruit_metro_rp2350.menu.psram.0mb.build.psram_length=0x000000
adafruit_metro_rp2350.menu.psram.2mb=2MByte PSRAM
adafruit_metro_rp2350.menu.psram.2mb.build.psram_length=0x200000
adafruit_metro_rp2350.menu.psram.4mb=4MByte PSRAM
adafruit_metro_rp2350.menu.psram.4mb.build.psram_length=0x400000
adafruit_metro_rp2350.menu.psram.8mb=8MByte PSRAM
