earlephilhower/arduino-pico/boards.txt
adafruit_metro_rp2350.menu.psram.8mb.build.psram_length=0x800000
adafruit_metro_rp2350.menu.opt.Small=Small (-Os) (standard)
adafruit_metro_rp2350.menu.opt.Small.build.flags.optimize=-Os
adafruit_metro_rp2350.menu.opt.Optimize=Optimize (-O)
adafruit_metro_rp2350.menu.opt.Optimize.build.flags.optimize=-O
adafruit_metro_rp2350.menu.opt.Optimize2=Optimize More (-O2)
adafruit_metro_rp2350.menu.opt.Optimize2.build.flags.optimize=-O2
adafruit_metro_rp2350.menu.opt.Optimize3=Optimize Even More (-O3)
adafruit_metro_rp2350.menu.opt.Optimize3.build.flags.optimize=-O3
adafruit_metro_rp2350.menu.opt.Fast=Fast (-Ofast) (maybe slower)
adafruit_metro_rp2350.menu.opt.Fast.build.flags.optimize=-Ofast
adafruit_metro_rp2350.menu.opt.Debug=Debug (-Og)
adafruit_metro_rp2350.menu.opt.Debug.build.flags.optimize=-Og
adafruit_metro_rp2350.menu.opt.Disabled=Disabled (-O0)
adafruit_metro_rp2350.menu.opt.Disabled.build.flags.optimize=-O0
adafruit_metro_rp2350.menu.profile.Disabled=Disabled
adafruit_metro_rp2350.menu.profile.Disabled.build.flags.profile=
adafruit_metro_rp2350.menu.profile.Enabled=Enabled
adafruit_metro_rp2350.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
adafruit_metro_rp2350.menu.rtti.Disabled=Disabled
adafruit_metro_rp2350.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
adafruit_metro_rp2350.menu.rtti.Enabled=Enabled
adafruit_metro_rp2350.menu.rtti.Enabled.build.flags.rtti=
adafruit_metro_rp2350.menu.stackprotect.Disabled=Disabled
adafruit_metro_rp2350.menu.stackprotect.Disabled.build.flags.stackprotect=
adafruit_metro_rp2350.menu.stackprotect.Enabled=Enabled
adafruit_metro_rp2350.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
adafruit_metro_rp2350.menu.exceptions.Disabled=Disabled
adafruit_metro_rp2350.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
adafruit_metro_rp2350.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
adafruit_metro_rp2350.menu.exceptions.Enabled=Enabled
adafruit_metro_rp2350.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
adafruit_metro_rp2350.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
adafruit_metro_rp2350.menu.dbgport.Disabled=Disabled
adafruit_metro_rp2350.menu.dbgport.Disabled.build.debug_port=
adafruit_metro_rp2350.menu.dbgport.Serial=Serial
adafruit_metro_rp2350.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_metro_rp2350.menu.dbgport.Serial1=Serial1
adafruit_metro_rp2350.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_metro_rp2350.menu.dbgport.Serial2=Serial2
adafruit_metro_rp2350.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_metro_rp2350.menu.dbgport.SerialSemi=SerialSemi
adafruit_metro_rp2350.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
adafruit_metro_rp2350.menu.dbglvl.None=None
adafruit_metro_rp2350.menu.dbglvl.None.build.debug_level=
adafruit_metro_rp2350.menu.dbglvl.Core=Core
adafruit_metro_rp2350.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_metro_rp2350.menu.dbglvl.SPI=SPI
adafruit_metro_rp2350.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_metro_rp2350.menu.dbglvl.Wire=Wire
adafruit_metro_rp2350.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_metro_rp2350.menu.dbglvl.Bluetooth=Bluetooth
adafruit_metro_rp2350.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
adafruit_metro_rp2350.menu.dbglvl.All=All
adafruit_metro_rp2350.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
adafruit_metro_rp2350.menu.dbglvl.NDEBUG=NDEBUG
adafruit_metro_rp2350.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_metro_rp2350.menu.usbstack.picosdk=Pico SDK
adafruit_metro_rp2350.menu.usbstack.picosdk.build.usbstack_flags=
adafruit_metro_rp2350.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_metro_rp2350.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_metro_rp2350.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
adafruit_metro_rp2350.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_metro_rp2350.menu.usbstack.nousb=No USB
adafruit_metro_rp2350.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
adafruit_metro_rp2350.menu.ipbtstack.ipv4only=IPv4 Only
adafruit_metro_rp2350.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
adafruit_metro_rp2350.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
adafruit_metro_rp2350.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_metro_rp2350.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
adafruit_metro_rp2350.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_metro_rp2350.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
adafruit_metro_rp2350.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
adafruit_metro_rp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_metro_rp2350.menu.uploadmethod.default=Default (UF2)
adafruit_metro_rp2350.menu.uploadmethod.default.build.ram_length=512k
adafruit_metro_rp2350.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_metro_rp2350.menu.uploadmethod.default.upload.maximum_data_size=524288
adafruit_metro_rp2350.menu.uploadmethod.default.upload.tool=uf2conv
adafruit_metro_rp2350.menu.uploadmethod.default.upload.tool.default=uf2conv
adafruit_metro_rp2350.menu.uploadmethod.default.upload.tool.network=uf2conv-network
adafruit_metro_rp2350.menu.uploadmethod.picotool=Picotool
adafruit_metro_rp2350.menu.uploadmethod.picotool.build.ram_length=512k
adafruit_metro_rp2350.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
adafruit_metro_rp2350.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
adafruit_metro_rp2350.menu.uploadmethod.picotool.upload.maximum_data_size=524288
adafruit_metro_rp2350.menu.uploadmethod.picotool.upload.tool=picotool
adafruit_metro_rp2350.menu.uploadmethod.picotool.upload.tool.default=picotool
adafruit_metro_rp2350.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
adafruit_metro_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
adafruit_metro_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_metro_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
adafruit_metro_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
adafruit_metro_rp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

