earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Adafruit Fruit Jam RP2350
# -----------------------------------
adafruit_fruitjam.name=Adafruit Fruit Jam RP2350
adafruit_fruitjam.vid.0=0x239a
adafruit_fruitjam.pid.0=0x816b
adafruit_fruitjam.vid.1=0x239a
adafruit_fruitjam.pid.1=0xc16b
adafruit_fruitjam.upload_port.0.vid=0x239a
adafruit_fruitjam.upload_port.0.pid=0x816b
adafruit_fruitjam.upload_port.1.vid=0x239a
adafruit_fruitjam.upload_port.1.pid=0xc16b
adafruit_fruitjam.build.usbvid=-DUSBD_VID=0x239a
adafruit_fruitjam.build.usbpid=-DUSBD_PID=0x816b
adafruit_fruitjam.build.usbpwr=-DUSBD_MAX_POWER_MA=250
adafruit_fruitjam.build.board=ADAFRUIT_FRUITJAM_RP2350
adafruit_fruitjam.build.variant=adafruit_fruitjam
adafruit_fruitjam.upload.maximum_size=16777216
adafruit_fruitjam.upload.wait_for_upload_port=true
adafruit_fruitjam.upload.erase_cmd=
adafruit_fruitjam.serial.disableDTR=false
adafruit_fruitjam.serial.disableRTS=false
adafruit_fruitjam.build.f_cpu=125000000
adafruit_fruitjam.build.led=
adafruit_fruitjam.build.core=rp2040
adafruit_fruitjam.build.ldscript=memmap_default.ld
adafruit_fruitjam.build.boot2=none
adafruit_fruitjam.build.usb_manufacturer="Adafruit"
adafruit_fruitjam.build.usb_product="Fruit Jam RP2350"
adafruit_fruitjam.build.psram_length=0x800000
adafruit_fruitjam.menu.flash.16777216_0=16MB (no FS)
adafruit_fruitjam.menu.flash.16777216_0.upload.maximum_size=16769024
adafruit_fruitjam.menu.flash.16777216_0.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_0.build.flash_length=16769024
adafruit_fruitjam.menu.flash.16777216_0.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_0.build.fs_start=285204480
adafruit_fruitjam.menu.flash.16777216_0.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
adafruit_fruitjam.menu.flash.16777216_65536.upload.maximum_size=16703488
adafruit_fruitjam.menu.flash.16777216_65536.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_65536.build.flash_length=16703488
adafruit_fruitjam.menu.flash.16777216_65536.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_65536.build.fs_start=285138944
adafruit_fruitjam.menu.flash.16777216_65536.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
adafruit_fruitjam.menu.flash.16777216_131072.upload.maximum_size=16637952
adafruit_fruitjam.menu.flash.16777216_131072.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_131072.build.flash_length=16637952
adafruit_fruitjam.menu.flash.16777216_131072.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_131072.build.fs_start=285073408
adafruit_fruitjam.menu.flash.16777216_131072.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
adafruit_fruitjam.menu.flash.16777216_262144.upload.maximum_size=16506880
adafruit_fruitjam.menu.flash.16777216_262144.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_262144.build.flash_length=16506880
adafruit_fruitjam.menu.flash.16777216_262144.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_262144.build.fs_start=284942336
adafruit_fruitjam.menu.flash.16777216_262144.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
adafruit_fruitjam.menu.flash.16777216_524288.upload.maximum_size=16244736
adafruit_fruitjam.menu.flash.16777216_524288.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_524288.build.flash_length=16244736
adafruit_fruitjam.menu.flash.16777216_524288.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_524288.build.fs_start=284680192
adafruit_fruitjam.menu.flash.16777216_524288.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
adafruit_fruitjam.menu.flash.16777216_1048576.upload.maximum_size=15720448
adafruit_fruitjam.menu.flash.16777216_1048576.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_1048576.build.flash_length=15720448
adafruit_fruitjam.menu.flash.16777216_1048576.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_1048576.build.fs_start=284155904
adafruit_fruitjam.menu.flash.16777216_1048576.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
adafruit_fruitjam.menu.flash.16777216_2097152.upload.maximum_size=14671872
adafruit_fruitjam.menu.flash.16777216_2097152.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_2097152.build.flash_length=14671872
adafruit_fruitjam.menu.flash.16777216_2097152.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_2097152.build.fs_start=283107328
adafruit_fruitjam.menu.flash.16777216_2097152.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
adafruit_fruitjam.menu.flash.16777216_3145728.upload.maximum_size=13623296
adafruit_fruitjam.menu.flash.16777216_3145728.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_3145728.build.flash_length=13623296
adafruit_fruitjam.menu.flash.16777216_3145728.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_3145728.build.fs_start=282058752
adafruit_fruitjam.menu.flash.16777216_3145728.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
adafruit_fruitjam.menu.flash.16777216_4194304.upload.maximum_size=12574720
adafruit_fruitjam.menu.flash.16777216_4194304.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_4194304.build.flash_length=12574720
adafruit_fruitjam.menu.flash.16777216_4194304.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_4194304.build.fs_start=281010176
adafruit_fruitjam.menu.flash.16777216_4194304.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
adafruit_fruitjam.menu.flash.16777216_5242880.upload.maximum_size=11526144
adafruit_fruitjam.menu.flash.16777216_5242880.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_5242880.build.flash_length=11526144
adafruit_fruitjam.menu.flash.16777216_5242880.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_5242880.build.fs_start=279961600
adafruit_fruitjam.menu.flash.16777216_5242880.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
adafruit_fruitjam.menu.flash.16777216_6291456.upload.maximum_size=10477568
adafruit_fruitjam.menu.flash.16777216_6291456.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_6291456.build.flash_length=10477568
adafruit_fruitjam.menu.flash.16777216_6291456.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_6291456.build.fs_start=278913024
adafruit_fruitjam.menu.flash.16777216_6291456.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
adafruit_fruitjam.menu.flash.16777216_7340032.upload.maximum_size=9428992
adafruit_fruitjam.menu.flash.16777216_7340032.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_7340032.build.flash_length=9428992
adafruit_fruitjam.menu.flash.16777216_7340032.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_7340032.build.fs_start=277864448
adafruit_fruitjam.menu.flash.16777216_7340032.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
adafruit_fruitjam.menu.flash.16777216_8388608.upload.maximum_size=8380416
adafruit_fruitjam.menu.flash.16777216_8388608.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_8388608.build.flash_length=8380416
adafruit_fruitjam.menu.flash.16777216_8388608.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_8388608.build.fs_start=276815872
adafruit_fruitjam.menu.flash.16777216_8388608.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
adafruit_fruitjam.menu.flash.16777216_9437184.upload.maximum_size=7331840
adafruit_fruitjam.menu.flash.16777216_9437184.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_9437184.build.flash_length=7331840
adafruit_fruitjam.menu.flash.16777216_9437184.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_9437184.build.fs_start=275767296
adafruit_fruitjam.menu.flash.16777216_9437184.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
adafruit_fruitjam.menu.flash.16777216_10485760.upload.maximum_size=6283264
adafruit_fruitjam.menu.flash.16777216_10485760.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_10485760.build.flash_length=6283264
adafruit_fruitjam.menu.flash.16777216_10485760.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_10485760.build.fs_start=274718720
adafruit_fruitjam.menu.flash.16777216_10485760.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
adafruit_fruitjam.menu.flash.16777216_11534336.upload.maximum_size=5234688
adafruit_fruitjam.menu.flash.16777216_11534336.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_11534336.build.flash_length=5234688
adafruit_fruitjam.menu.flash.16777216_11534336.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_11534336.build.fs_start=273670144
adafruit_fruitjam.menu.flash.16777216_11534336.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
adafruit_fruitjam.menu.flash.16777216_12582912.upload.maximum_size=4186112
adafruit_fruitjam.menu.flash.16777216_12582912.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_12582912.build.flash_length=4186112
adafruit_fruitjam.menu.flash.16777216_12582912.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_12582912.build.fs_start=272621568
adafruit_fruitjam.menu.flash.16777216_12582912.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
adafruit_fruitjam.menu.flash.16777216_13631488.upload.maximum_size=3137536
adafruit_fruitjam.menu.flash.16777216_13631488.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_13631488.build.flash_length=3137536
adafruit_fruitjam.menu.flash.16777216_13631488.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_13631488.build.fs_start=271572992
adafruit_fruitjam.menu.flash.16777216_13631488.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
adafruit_fruitjam.menu.flash.16777216_14680064.upload.maximum_size=2088960
adafruit_fruitjam.menu.flash.16777216_14680064.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_14680064.build.flash_length=2088960
adafruit_fruitjam.menu.flash.16777216_14680064.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_14680064.build.fs_start=270524416
adafruit_fruitjam.menu.flash.16777216_14680064.build.fs_end=285204480
adafruit_fruitjam.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
adafruit_fruitjam.menu.flash.16777216_15728640.upload.maximum_size=1040384
adafruit_fruitjam.menu.flash.16777216_15728640.build.flash_total=16777216
adafruit_fruitjam.menu.flash.16777216_15728640.build.flash_length=1040384
adafruit_fruitjam.menu.flash.16777216_15728640.build.eeprom_start=285204480
adafruit_fruitjam.menu.flash.16777216_15728640.build.fs_start=269475840
adafruit_fruitjam.menu.flash.16777216_15728640.build.fs_end=285204480
adafruit_fruitjam.menu.arch.arm=ARM
adafruit_fruitjam.menu.arch.arm.build.chip=rp2350
adafruit_fruitjam.menu.arch.arm.build.toolchain=arm-none-eabi
adafruit_fruitjam.menu.arch.arm.build.toolchainpkg=pqt-gcc
adafruit_fruitjam.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
adafruit_fruitjam.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
adafruit_fruitjam.menu.arch.arm.build.mcu=cortex-m33
adafruit_fruitjam.menu.arch.riscv=RISC-V
adafruit_fruitjam.menu.arch.riscv.build.chip=rp2350-riscv
adafruit_fruitjam.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
adafruit_fruitjam.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
adafruit_fruitjam.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
adafruit_fruitjam.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
adafruit_fruitjam.menu.arch.riscv.build.mcu=rv32imac
adafruit_fruitjam.menu.freq.150=150 MHz
adafruit_fruitjam.menu.freq.150.build.f_cpu=150000000L
adafruit_fruitjam.menu.freq.50=50 MHz
adafruit_fruitjam.menu.freq.50.build.f_cpu=50000000L
adafruit_fruitjam.menu.freq.100=100 MHz
adafruit_fruitjam.menu.freq.100.build.f_cpu=100000000L
adafruit_fruitjam.menu.freq.120=120 MHz
adafruit_fruitjam.menu.freq.120.build.f_cpu=120000000L
adafruit_fruitjam.menu.freq.125=125 MHz
adafruit_fruitjam.menu.freq.125.build.f_cpu=125000000L
adafruit_fruitjam.menu.freq.128=128 MHz
adafruit_fruitjam.menu.freq.128.build.f_cpu=128000000L
adafruit_fruitjam.menu.freq.133=133 MHz
adafruit_fruitjam.menu.freq.133.build.f_cpu=133000000L
adafruit_fruitjam.menu.freq.176=176 MHz (Overclock)
adafruit_fruitjam.menu.freq.176.build.f_cpu=176000000L
adafruit_fruitjam.menu.freq.200=200 MHz (Overclock)
adafruit_fruitjam.menu.freq.200.build.f_cpu=200000000L
adafruit_fruitjam.menu.freq.225=225 MHz (Overclock)
adafruit_fruitjam.menu.freq.225.build.f_cpu=225000000L
adafruit_fruitjam.menu.freq.240=240 MHz (Overclock)
adafruit_fruitjam.menu.freq.240.build.f_cpu=240000000L
adafruit_fruitjam.menu.freq.250=250 MHz (Overclock)
adafruit_fruitjam.menu.freq.250.build.f_cpu=250000000L
adafruit_fruitjam.menu.freq.276=276 MHz (Overclock)
adafruit_fruitjam.menu.freq.276.build.f_cpu=276000000L
adafruit_fruitjam.menu.freq.300=300 MHz (Overclock)
adafruit_fruitjam.menu.freq.300.build.f_cpu=300000000L
adafruit_fruitjam.menu.opt.Small=Small (-Os) (standard)
adafruit_fruitjam.menu.opt.Small.build.flags.optimize=-Os
adafruit_fruitjam.menu.opt.Optimize=Optimize (-O)
adafruit_fruitjam.menu.opt.Optimize.build.flags.optimize=-O
adafruit_fruitjam.menu.opt.Optimize2=Optimize More (-O2)
adafruit_fruitjam.menu.opt.Optimize2.build.flags.optimize=-O2
adafruit_fruitjam.menu.opt.Optimize3=Optimize Even More (-O3)
adafruit_fruitjam.menu.opt.Optimize3.build.flags.optimize=-O3
adafruit_fruitjam.menu.opt.Fast=Fast (-Ofast) (maybe slower)
adafruit_fruitjam.menu.opt.Fast.build.flags.optimize=-Ofast
adafruit_fruitjam.menu.opt.Debug=Debug (-Og)
adafruit_fruitjam.menu.opt.Debug.build.flags.optimize=-Og
adafruit_fruitjam.menu.opt.Disabled=Disabled (-O0)
adafruit_fruitjam.menu.opt.Disabled.build.flags.optimize=-O0
adafruit_fruitjam.menu.profile.Disabled=Disabled
adafruit_fruitjam.menu.profile.Disabled.build.flags.profile=
adafruit_fruitjam.menu.profile.Enabled=Enabled
adafruit_fruitjam.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
adafruit_fruitjam.menu.rtti.Disabled=Disabled
adafruit_fruitjam.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
adafruit_fruitjam.menu.rtti.Enabled=Enabled
adafruit_fruitjam.menu.rtti.Enabled.build.flags.rtti=
adafruit_fruitjam.menu.stackprotect.Disabled=Disabled
adafruit_fruitjam.menu.stackprotect.Disabled.build.flags.stackprotect=
adafruit_fruitjam.menu.stackprotect.Enabled=Enabled
adafruit_fruitjam.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
adafruit_fruitjam.menu.exceptions.Disabled=Disabled
adafruit_fruitjam.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
adafruit_fruitjam.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
adafruit_fruitjam.menu.exceptions.Enabled=Enabled
adafruit_fruitjam.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
adafruit_fruitjam.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
adafruit_fruitjam.menu.dbgport.Disabled=Disabled
adafruit_fruitjam.menu.dbgport.Disabled.build.debug_port=
adafruit_fruitjam.menu.dbgport.Serial=Serial
adafruit_fruitjam.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_fruitjam.menu.dbgport.Serial1=Serial1
adafruit_fruitjam.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_fruitjam.menu.dbgport.Serial2=Serial2
adafruit_fruitjam.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_fruitjam.menu.dbgport.SerialSemi=SerialSemi
adafruit_fruitjam.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
adafruit_fruitjam.menu.dbglvl.None=None
adafruit_fruitjam.menu.dbglvl.None.build.debug_level=
adafruit_fruitjam.menu.dbglvl.Core=Core
adafruit_fruitjam.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_fruitjam.menu.dbglvl.SPI=SPI
adafruit_fruitjam.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_fruitjam.menu.dbglvl.Wire=Wire
adafruit_fruitjam.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_fruitjam.menu.dbglvl.Bluetooth=Bluetooth
adafruit_fruitjam.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
adafruit_fruitjam.menu.dbglvl.All=All
adafruit_fruitjam.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
adafruit_fruitjam.menu.dbglvl.NDEBUG=NDEBUG
adafruit_fruitjam.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_fruitjam.menu.usbstack.picosdk=Pico SDK
adafruit_fruitjam.menu.usbstack.picosdk.build.usbstack_flags=
adafruit_fruitjam.menu.usbstack.tinyusb=Adafruit TinyUSB
adafruit_fruitjam.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_fruitjam.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
adafruit_fruitjam.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
adafruit_fruitjam.menu.usbstack.nousb=No USB
adafruit_fruitjam.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
