earlephilhower/arduino-pico/boards.txt
adafruit_fruitjam.menu.ipbtstack.ipv4only=IPv4 Only
adafruit_fruitjam.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
adafruit_fruitjam.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
adafruit_fruitjam.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
adafruit_fruitjam.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
adafruit_fruitjam.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
adafruit_fruitjam.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
adafruit_fruitjam.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
adafruit_fruitjam.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
adafruit_fruitjam.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
adafruit_fruitjam.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
adafruit_fruitjam.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
adafruit_fruitjam.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
adafruit_fruitjam.menu.uploadmethod.default=Default (UF2)
adafruit_fruitjam.menu.uploadmethod.default.build.ram_length=512k
adafruit_fruitjam.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_fruitjam.menu.uploadmethod.default.upload.maximum_data_size=524288
adafruit_fruitjam.menu.uploadmethod.default.upload.tool=uf2conv
adafruit_fruitjam.menu.uploadmethod.default.upload.tool.default=uf2conv
adafruit_fruitjam.menu.uploadmethod.default.upload.tool.network=uf2conv-network
adafruit_fruitjam.menu.uploadmethod.picotool=Picotool
adafruit_fruitjam.menu.uploadmethod.picotool.build.ram_length=512k
adafruit_fruitjam.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
adafruit_fruitjam.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
adafruit_fruitjam.menu.uploadmethod.picotool.upload.maximum_data_size=524288
adafruit_fruitjam.menu.uploadmethod.picotool.upload.tool=picotool
adafruit_fruitjam.menu.uploadmethod.picotool.upload.tool.default=picotool
adafruit_fruitjam.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
adafruit_fruitjam.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
adafruit_fruitjam.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
adafruit_fruitjam.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
adafruit_fruitjam.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
adafruit_fruitjam.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Amken BunnyBoard
# -----------------------------------
amken_bunny.name=Amken BunnyBoard
amken_bunny.vid.0=0x2770
amken_bunny.pid.0=0x7303
amken_bunny.upload_port.0.vid=0x2770
amken_bunny.upload_port.0.pid=0x7303
amken_bunny.build.usbvid=-DUSBD_VID=0x2770
amken_bunny.build.usbpid=-DUSBD_PID=0x7303
amken_bunny.build.usbpwr=-DUSBD_MAX_POWER_MA=250
amken_bunny.build.board=AMKEN_BB
amken_bunny.build.mcu=cortex-m0plus
amken_bunny.build.chip=rp2040
amken_bunny.build.toolchain=arm-none-eabi
amken_bunny.build.toolchainpkg=pqt-gcc
amken_bunny.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
amken_bunny.build.uf2family=--family rp2040
amken_bunny.build.variant=amken_bunny
amken_bunny.upload.maximum_size=134217728
amken_bunny.upload.wait_for_upload_port=true
amken_bunny.upload.erase_cmd=
amken_bunny.serial.disableDTR=false
amken_bunny.serial.disableRTS=false
amken_bunny.build.f_cpu=125000000
amken_bunny.build.led=
amken_bunny.build.core=rp2040
amken_bunny.build.ldscript=memmap_default.ld
amken_bunny.build.boot2=boot2_w25q128jvxq_4_padded_checksum
amken_bunny.build.usb_manufacturer="Amken"
amken_bunny.build.usb_product="BunnyBoard"
amken_bunny.build.extra_flags=
amken_bunny.menu.flash.134217728_0=128MB (no FS)
amken_bunny.menu.flash.134217728_0.upload.maximum_size=134213632
amken_bunny.menu.flash.134217728_0.build.flash_total=134217728
amken_bunny.menu.flash.134217728_0.build.flash_length=134213632
amken_bunny.menu.flash.134217728_0.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_0.build.fs_start=402649088
amken_bunny.menu.flash.134217728_0.build.fs_end=402649088
amken_bunny.menu.flash.134217728_65536=128MB (Sketch: 131008KB, FS: 64KB)
amken_bunny.menu.flash.134217728_65536.upload.maximum_size=134148096
amken_bunny.menu.flash.134217728_65536.build.flash_total=134217728
amken_bunny.menu.flash.134217728_65536.build.flash_length=134148096
amken_bunny.menu.flash.134217728_65536.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_65536.build.fs_start=402583552
amken_bunny.menu.flash.134217728_65536.build.fs_end=402649088
amken_bunny.menu.flash.134217728_131072=128MB (Sketch: 130944KB, FS: 128KB)
amken_bunny.menu.flash.134217728_131072.upload.maximum_size=134082560
amken_bunny.menu.flash.134217728_131072.build.flash_total=134217728
amken_bunny.menu.flash.134217728_131072.build.flash_length=134082560
amken_bunny.menu.flash.134217728_131072.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_131072.build.fs_start=402518016
amken_bunny.menu.flash.134217728_131072.build.fs_end=402649088
amken_bunny.menu.flash.134217728_262144=128MB (Sketch: 130816KB, FS: 256KB)
amken_bunny.menu.flash.134217728_262144.upload.maximum_size=133951488
amken_bunny.menu.flash.134217728_262144.build.flash_total=134217728
amken_bunny.menu.flash.134217728_262144.build.flash_length=133951488
amken_bunny.menu.flash.134217728_262144.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_262144.build.fs_start=402386944
amken_bunny.menu.flash.134217728_262144.build.fs_end=402649088
amken_bunny.menu.flash.134217728_524288=128MB (Sketch: 130560KB, FS: 512KB)
amken_bunny.menu.flash.134217728_524288.upload.maximum_size=133689344
amken_bunny.menu.flash.134217728_524288.build.flash_total=134217728
amken_bunny.menu.flash.134217728_524288.build.flash_length=133689344
amken_bunny.menu.flash.134217728_524288.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_524288.build.fs_start=402124800
amken_bunny.menu.flash.134217728_524288.build.fs_end=402649088
amken_bunny.menu.flash.134217728_1048576=128MB (Sketch: 127MB, FS: 1MB)
amken_bunny.menu.flash.134217728_1048576.upload.maximum_size=133165056
amken_bunny.menu.flash.134217728_1048576.build.flash_total=134217728
amken_bunny.menu.flash.134217728_1048576.build.flash_length=133165056
amken_bunny.menu.flash.134217728_1048576.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_1048576.build.fs_start=401600512
amken_bunny.menu.flash.134217728_1048576.build.fs_end=402649088
amken_bunny.menu.flash.134217728_2097152=128MB (Sketch: 126MB, FS: 2MB)
amken_bunny.menu.flash.134217728_2097152.upload.maximum_size=132116480
amken_bunny.menu.flash.134217728_2097152.build.flash_total=134217728
amken_bunny.menu.flash.134217728_2097152.build.flash_length=132116480
amken_bunny.menu.flash.134217728_2097152.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_2097152.build.fs_start=400551936
amken_bunny.menu.flash.134217728_2097152.build.fs_end=402649088
amken_bunny.menu.flash.134217728_3145728=128MB (Sketch: 125MB, FS: 3MB)
amken_bunny.menu.flash.134217728_3145728.upload.maximum_size=131067904
amken_bunny.menu.flash.134217728_3145728.build.flash_total=134217728
amken_bunny.menu.flash.134217728_3145728.build.flash_length=131067904
amken_bunny.menu.flash.134217728_3145728.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_3145728.build.fs_start=399503360
amken_bunny.menu.flash.134217728_3145728.build.fs_end=402649088
amken_bunny.menu.flash.134217728_4194304=128MB (Sketch: 124MB, FS: 4MB)
amken_bunny.menu.flash.134217728_4194304.upload.maximum_size=130019328
amken_bunny.menu.flash.134217728_4194304.build.flash_total=134217728
amken_bunny.menu.flash.134217728_4194304.build.flash_length=130019328
amken_bunny.menu.flash.134217728_4194304.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_4194304.build.fs_start=398454784
amken_bunny.menu.flash.134217728_4194304.build.fs_end=402649088
amken_bunny.menu.flash.134217728_5242880=128MB (Sketch: 123MB, FS: 5MB)
amken_bunny.menu.flash.134217728_5242880.upload.maximum_size=128970752
amken_bunny.menu.flash.134217728_5242880.build.flash_total=134217728
amken_bunny.menu.flash.134217728_5242880.build.flash_length=128970752
amken_bunny.menu.flash.134217728_5242880.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_5242880.build.fs_start=397406208
amken_bunny.menu.flash.134217728_5242880.build.fs_end=402649088
amken_bunny.menu.flash.134217728_6291456=128MB (Sketch: 122MB, FS: 6MB)
amken_bunny.menu.flash.134217728_6291456.upload.maximum_size=127922176
amken_bunny.menu.flash.134217728_6291456.build.flash_total=134217728
amken_bunny.menu.flash.134217728_6291456.build.flash_length=127922176
amken_bunny.menu.flash.134217728_6291456.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_6291456.build.fs_start=396357632
amken_bunny.menu.flash.134217728_6291456.build.fs_end=402649088
amken_bunny.menu.flash.134217728_7340032=128MB (Sketch: 121MB, FS: 7MB)
amken_bunny.menu.flash.134217728_7340032.upload.maximum_size=126873600
amken_bunny.menu.flash.134217728_7340032.build.flash_total=134217728
amken_bunny.menu.flash.134217728_7340032.build.flash_length=126873600
amken_bunny.menu.flash.134217728_7340032.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_7340032.build.fs_start=395309056
amken_bunny.menu.flash.134217728_7340032.build.fs_end=402649088
amken_bunny.menu.flash.134217728_8388608=128MB (Sketch: 120MB, FS: 8MB)
amken_bunny.menu.flash.134217728_8388608.upload.maximum_size=125825024
amken_bunny.menu.flash.134217728_8388608.build.flash_total=134217728
amken_bunny.menu.flash.134217728_8388608.build.flash_length=125825024
amken_bunny.menu.flash.134217728_8388608.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_8388608.build.fs_start=394260480
amken_bunny.menu.flash.134217728_8388608.build.fs_end=402649088
amken_bunny.menu.flash.134217728_9437184=128MB (Sketch: 119MB, FS: 9MB)
amken_bunny.menu.flash.134217728_9437184.upload.maximum_size=124776448
amken_bunny.menu.flash.134217728_9437184.build.flash_total=134217728
amken_bunny.menu.flash.134217728_9437184.build.flash_length=124776448
amken_bunny.menu.flash.134217728_9437184.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_9437184.build.fs_start=393211904
amken_bunny.menu.flash.134217728_9437184.build.fs_end=402649088
amken_bunny.menu.flash.134217728_10485760=128MB (Sketch: 118MB, FS: 10MB)
amken_bunny.menu.flash.134217728_10485760.upload.maximum_size=123727872
amken_bunny.menu.flash.134217728_10485760.build.flash_total=134217728
amken_bunny.menu.flash.134217728_10485760.build.flash_length=123727872
amken_bunny.menu.flash.134217728_10485760.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_10485760.build.fs_start=392163328
amken_bunny.menu.flash.134217728_10485760.build.fs_end=402649088
amken_bunny.menu.flash.134217728_11534336=128MB (Sketch: 117MB, FS: 11MB)
amken_bunny.menu.flash.134217728_11534336.upload.maximum_size=122679296
amken_bunny.menu.flash.134217728_11534336.build.flash_total=134217728
amken_bunny.menu.flash.134217728_11534336.build.flash_length=122679296
amken_bunny.menu.flash.134217728_11534336.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_11534336.build.fs_start=391114752
amken_bunny.menu.flash.134217728_11534336.build.fs_end=402649088
amken_bunny.menu.flash.134217728_12582912=128MB (Sketch: 116MB, FS: 12MB)
amken_bunny.menu.flash.134217728_12582912.upload.maximum_size=121630720
amken_bunny.menu.flash.134217728_12582912.build.flash_total=134217728
amken_bunny.menu.flash.134217728_12582912.build.flash_length=121630720
amken_bunny.menu.flash.134217728_12582912.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_12582912.build.fs_start=390066176
amken_bunny.menu.flash.134217728_12582912.build.fs_end=402649088
amken_bunny.menu.flash.134217728_13631488=128MB (Sketch: 115MB, FS: 13MB)
amken_bunny.menu.flash.134217728_13631488.upload.maximum_size=120582144
amken_bunny.menu.flash.134217728_13631488.build.flash_total=134217728
amken_bunny.menu.flash.134217728_13631488.build.flash_length=120582144
amken_bunny.menu.flash.134217728_13631488.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_13631488.build.fs_start=389017600
amken_bunny.menu.flash.134217728_13631488.build.fs_end=402649088
amken_bunny.menu.flash.134217728_14680064=128MB (Sketch: 114MB, FS: 14MB)
amken_bunny.menu.flash.134217728_14680064.upload.maximum_size=119533568
amken_bunny.menu.flash.134217728_14680064.build.flash_total=134217728
amken_bunny.menu.flash.134217728_14680064.build.flash_length=119533568
amken_bunny.menu.flash.134217728_14680064.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_14680064.build.fs_start=387969024
amken_bunny.menu.flash.134217728_14680064.build.fs_end=402649088
amken_bunny.menu.flash.134217728_15728640=128MB (Sketch: 113MB, FS: 15MB)
amken_bunny.menu.flash.134217728_15728640.upload.maximum_size=118484992
amken_bunny.menu.flash.134217728_15728640.build.flash_total=134217728
amken_bunny.menu.flash.134217728_15728640.build.flash_length=118484992
amken_bunny.menu.flash.134217728_15728640.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_15728640.build.fs_start=386920448
amken_bunny.menu.flash.134217728_15728640.build.fs_end=402649088
amken_bunny.menu.flash.134217728_16777216=128MB (Sketch: 112MB, FS: 16MB)
amken_bunny.menu.flash.134217728_16777216.upload.maximum_size=117436416
amken_bunny.menu.flash.134217728_16777216.build.flash_total=134217728
amken_bunny.menu.flash.134217728_16777216.build.flash_length=117436416
amken_bunny.menu.flash.134217728_16777216.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_16777216.build.fs_start=385871872
amken_bunny.menu.flash.134217728_16777216.build.fs_end=402649088
amken_bunny.menu.flash.134217728_17825792=128MB (Sketch: 111MB, FS: 17MB)
amken_bunny.menu.flash.134217728_17825792.upload.maximum_size=116387840
amken_bunny.menu.flash.134217728_17825792.build.flash_total=134217728
amken_bunny.menu.flash.134217728_17825792.build.flash_length=116387840
amken_bunny.menu.flash.134217728_17825792.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_17825792.build.fs_start=384823296
amken_bunny.menu.flash.134217728_17825792.build.fs_end=402649088
amken_bunny.menu.flash.134217728_18874368=128MB (Sketch: 110MB, FS: 18MB)
amken_bunny.menu.flash.134217728_18874368.upload.maximum_size=115339264
amken_bunny.menu.flash.134217728_18874368.build.flash_total=134217728
amken_bunny.menu.flash.134217728_18874368.build.flash_length=115339264
amken_bunny.menu.flash.134217728_18874368.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_18874368.build.fs_start=383774720
amken_bunny.menu.flash.134217728_18874368.build.fs_end=402649088
amken_bunny.menu.flash.134217728_19922944=128MB (Sketch: 109MB, FS: 19MB)
amken_bunny.menu.flash.134217728_19922944.upload.maximum_size=114290688
amken_bunny.menu.flash.134217728_19922944.build.flash_total=134217728
amken_bunny.menu.flash.134217728_19922944.build.flash_length=114290688
amken_bunny.menu.flash.134217728_19922944.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_19922944.build.fs_start=382726144
amken_bunny.menu.flash.134217728_19922944.build.fs_end=402649088
amken_bunny.menu.flash.134217728_20971520=128MB (Sketch: 108MB, FS: 20MB)
amken_bunny.menu.flash.134217728_20971520.upload.maximum_size=113242112
amken_bunny.menu.flash.134217728_20971520.build.flash_total=134217728
amken_bunny.menu.flash.134217728_20971520.build.flash_length=113242112
amken_bunny.menu.flash.134217728_20971520.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_20971520.build.fs_start=381677568
amken_bunny.menu.flash.134217728_20971520.build.fs_end=402649088
amken_bunny.menu.flash.134217728_22020096=128MB (Sketch: 107MB, FS: 21MB)
amken_bunny.menu.flash.134217728_22020096.upload.maximum_size=112193536
amken_bunny.menu.flash.134217728_22020096.build.flash_total=134217728
amken_bunny.menu.flash.134217728_22020096.build.flash_length=112193536
amken_bunny.menu.flash.134217728_22020096.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_22020096.build.fs_start=380628992
amken_bunny.menu.flash.134217728_22020096.build.fs_end=402649088
amken_bunny.menu.flash.134217728_23068672=128MB (Sketch: 106MB, FS: 22MB)
amken_bunny.menu.flash.134217728_23068672.upload.maximum_size=111144960
amken_bunny.menu.flash.134217728_23068672.build.flash_total=134217728
amken_bunny.menu.flash.134217728_23068672.build.flash_length=111144960
amken_bunny.menu.flash.134217728_23068672.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_23068672.build.fs_start=379580416
amken_bunny.menu.flash.134217728_23068672.build.fs_end=402649088
amken_bunny.menu.flash.134217728_24117248=128MB (Sketch: 105MB, FS: 23MB)
