earlephilhower/arduino-pico/boards.txt
amken_bunny.menu.flash.134217728_24117248.upload.maximum_size=110096384
amken_bunny.menu.flash.134217728_24117248.build.flash_total=134217728
amken_bunny.menu.flash.134217728_24117248.build.flash_length=110096384
amken_bunny.menu.flash.134217728_24117248.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_24117248.build.fs_start=378531840
amken_bunny.menu.flash.134217728_24117248.build.fs_end=402649088
amken_bunny.menu.flash.134217728_25165824=128MB (Sketch: 104MB, FS: 24MB)
amken_bunny.menu.flash.134217728_25165824.upload.maximum_size=109047808
amken_bunny.menu.flash.134217728_25165824.build.flash_total=134217728
amken_bunny.menu.flash.134217728_25165824.build.flash_length=109047808
amken_bunny.menu.flash.134217728_25165824.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_25165824.build.fs_start=377483264
amken_bunny.menu.flash.134217728_25165824.build.fs_end=402649088
amken_bunny.menu.flash.134217728_26214400=128MB (Sketch: 103MB, FS: 25MB)
amken_bunny.menu.flash.134217728_26214400.upload.maximum_size=107999232
amken_bunny.menu.flash.134217728_26214400.build.flash_total=134217728
amken_bunny.menu.flash.134217728_26214400.build.flash_length=107999232
amken_bunny.menu.flash.134217728_26214400.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_26214400.build.fs_start=376434688
amken_bunny.menu.flash.134217728_26214400.build.fs_end=402649088
amken_bunny.menu.flash.134217728_27262976=128MB (Sketch: 102MB, FS: 26MB)
amken_bunny.menu.flash.134217728_27262976.upload.maximum_size=106950656
amken_bunny.menu.flash.134217728_27262976.build.flash_total=134217728
amken_bunny.menu.flash.134217728_27262976.build.flash_length=106950656
amken_bunny.menu.flash.134217728_27262976.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_27262976.build.fs_start=375386112
amken_bunny.menu.flash.134217728_27262976.build.fs_end=402649088
amken_bunny.menu.flash.134217728_28311552=128MB (Sketch: 101MB, FS: 27MB)
amken_bunny.menu.flash.134217728_28311552.upload.maximum_size=105902080
amken_bunny.menu.flash.134217728_28311552.build.flash_total=134217728
amken_bunny.menu.flash.134217728_28311552.build.flash_length=105902080
amken_bunny.menu.flash.134217728_28311552.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_28311552.build.fs_start=374337536
amken_bunny.menu.flash.134217728_28311552.build.fs_end=402649088
amken_bunny.menu.flash.134217728_29360128=128MB (Sketch: 100MB, FS: 28MB)
amken_bunny.menu.flash.134217728_29360128.upload.maximum_size=104853504
amken_bunny.menu.flash.134217728_29360128.build.flash_total=134217728
amken_bunny.menu.flash.134217728_29360128.build.flash_length=104853504
amken_bunny.menu.flash.134217728_29360128.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_29360128.build.fs_start=373288960
amken_bunny.menu.flash.134217728_29360128.build.fs_end=402649088
amken_bunny.menu.flash.134217728_30408704=128MB (Sketch: 99MB, FS: 29MB)
amken_bunny.menu.flash.134217728_30408704.upload.maximum_size=103804928
amken_bunny.menu.flash.134217728_30408704.build.flash_total=134217728
amken_bunny.menu.flash.134217728_30408704.build.flash_length=103804928
amken_bunny.menu.flash.134217728_30408704.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_30408704.build.fs_start=372240384
amken_bunny.menu.flash.134217728_30408704.build.fs_end=402649088
amken_bunny.menu.flash.134217728_31457280=128MB (Sketch: 98MB, FS: 30MB)
amken_bunny.menu.flash.134217728_31457280.upload.maximum_size=102756352
amken_bunny.menu.flash.134217728_31457280.build.flash_total=134217728
amken_bunny.menu.flash.134217728_31457280.build.flash_length=102756352
amken_bunny.menu.flash.134217728_31457280.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_31457280.build.fs_start=371191808
amken_bunny.menu.flash.134217728_31457280.build.fs_end=402649088
amken_bunny.menu.flash.134217728_32505856=128MB (Sketch: 97MB, FS: 31MB)
amken_bunny.menu.flash.134217728_32505856.upload.maximum_size=101707776
amken_bunny.menu.flash.134217728_32505856.build.flash_total=134217728
amken_bunny.menu.flash.134217728_32505856.build.flash_length=101707776
amken_bunny.menu.flash.134217728_32505856.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_32505856.build.fs_start=370143232
amken_bunny.menu.flash.134217728_32505856.build.fs_end=402649088
amken_bunny.menu.flash.134217728_33554432=128MB (Sketch: 96MB, FS: 32MB)
amken_bunny.menu.flash.134217728_33554432.upload.maximum_size=100659200
amken_bunny.menu.flash.134217728_33554432.build.flash_total=134217728
amken_bunny.menu.flash.134217728_33554432.build.flash_length=100659200
amken_bunny.menu.flash.134217728_33554432.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_33554432.build.fs_start=369094656
amken_bunny.menu.flash.134217728_33554432.build.fs_end=402649088
amken_bunny.menu.flash.134217728_34603008=128MB (Sketch: 95MB, FS: 33MB)
amken_bunny.menu.flash.134217728_34603008.upload.maximum_size=99610624
amken_bunny.menu.flash.134217728_34603008.build.flash_total=134217728
amken_bunny.menu.flash.134217728_34603008.build.flash_length=99610624
amken_bunny.menu.flash.134217728_34603008.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_34603008.build.fs_start=368046080
amken_bunny.menu.flash.134217728_34603008.build.fs_end=402649088
amken_bunny.menu.flash.134217728_35651584=128MB (Sketch: 94MB, FS: 34MB)
amken_bunny.menu.flash.134217728_35651584.upload.maximum_size=98562048
amken_bunny.menu.flash.134217728_35651584.build.flash_total=134217728
amken_bunny.menu.flash.134217728_35651584.build.flash_length=98562048
amken_bunny.menu.flash.134217728_35651584.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_35651584.build.fs_start=366997504
amken_bunny.menu.flash.134217728_35651584.build.fs_end=402649088
amken_bunny.menu.flash.134217728_36700160=128MB (Sketch: 93MB, FS: 35MB)
amken_bunny.menu.flash.134217728_36700160.upload.maximum_size=97513472
amken_bunny.menu.flash.134217728_36700160.build.flash_total=134217728
amken_bunny.menu.flash.134217728_36700160.build.flash_length=97513472
amken_bunny.menu.flash.134217728_36700160.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_36700160.build.fs_start=365948928
amken_bunny.menu.flash.134217728_36700160.build.fs_end=402649088
amken_bunny.menu.flash.134217728_37748736=128MB (Sketch: 92MB, FS: 36MB)
amken_bunny.menu.flash.134217728_37748736.upload.maximum_size=96464896
amken_bunny.menu.flash.134217728_37748736.build.flash_total=134217728
amken_bunny.menu.flash.134217728_37748736.build.flash_length=96464896
amken_bunny.menu.flash.134217728_37748736.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_37748736.build.fs_start=364900352
amken_bunny.menu.flash.134217728_37748736.build.fs_end=402649088
amken_bunny.menu.flash.134217728_38797312=128MB (Sketch: 91MB, FS: 37MB)
amken_bunny.menu.flash.134217728_38797312.upload.maximum_size=95416320
amken_bunny.menu.flash.134217728_38797312.build.flash_total=134217728
amken_bunny.menu.flash.134217728_38797312.build.flash_length=95416320
amken_bunny.menu.flash.134217728_38797312.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_38797312.build.fs_start=363851776
amken_bunny.menu.flash.134217728_38797312.build.fs_end=402649088
amken_bunny.menu.flash.134217728_39845888=128MB (Sketch: 90MB, FS: 38MB)
amken_bunny.menu.flash.134217728_39845888.upload.maximum_size=94367744
amken_bunny.menu.flash.134217728_39845888.build.flash_total=134217728
amken_bunny.menu.flash.134217728_39845888.build.flash_length=94367744
amken_bunny.menu.flash.134217728_39845888.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_39845888.build.fs_start=362803200
amken_bunny.menu.flash.134217728_39845888.build.fs_end=402649088
amken_bunny.menu.flash.134217728_40894464=128MB (Sketch: 89MB, FS: 39MB)
amken_bunny.menu.flash.134217728_40894464.upload.maximum_size=93319168
amken_bunny.menu.flash.134217728_40894464.build.flash_total=134217728
amken_bunny.menu.flash.134217728_40894464.build.flash_length=93319168
amken_bunny.menu.flash.134217728_40894464.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_40894464.build.fs_start=361754624
amken_bunny.menu.flash.134217728_40894464.build.fs_end=402649088
amken_bunny.menu.flash.134217728_41943040=128MB (Sketch: 88MB, FS: 40MB)
amken_bunny.menu.flash.134217728_41943040.upload.maximum_size=92270592
amken_bunny.menu.flash.134217728_41943040.build.flash_total=134217728
amken_bunny.menu.flash.134217728_41943040.build.flash_length=92270592
amken_bunny.menu.flash.134217728_41943040.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_41943040.build.fs_start=360706048
amken_bunny.menu.flash.134217728_41943040.build.fs_end=402649088
amken_bunny.menu.flash.134217728_42991616=128MB (Sketch: 87MB, FS: 41MB)
amken_bunny.menu.flash.134217728_42991616.upload.maximum_size=91222016
amken_bunny.menu.flash.134217728_42991616.build.flash_total=134217728
amken_bunny.menu.flash.134217728_42991616.build.flash_length=91222016
amken_bunny.menu.flash.134217728_42991616.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_42991616.build.fs_start=359657472
amken_bunny.menu.flash.134217728_42991616.build.fs_end=402649088
amken_bunny.menu.flash.134217728_44040192=128MB (Sketch: 86MB, FS: 42MB)
amken_bunny.menu.flash.134217728_44040192.upload.maximum_size=90173440
amken_bunny.menu.flash.134217728_44040192.build.flash_total=134217728
amken_bunny.menu.flash.134217728_44040192.build.flash_length=90173440
amken_bunny.menu.flash.134217728_44040192.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_44040192.build.fs_start=358608896
amken_bunny.menu.flash.134217728_44040192.build.fs_end=402649088
amken_bunny.menu.flash.134217728_45088768=128MB (Sketch: 85MB, FS: 43MB)
amken_bunny.menu.flash.134217728_45088768.upload.maximum_size=89124864
amken_bunny.menu.flash.134217728_45088768.build.flash_total=134217728
amken_bunny.menu.flash.134217728_45088768.build.flash_length=89124864
amken_bunny.menu.flash.134217728_45088768.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_45088768.build.fs_start=357560320
amken_bunny.menu.flash.134217728_45088768.build.fs_end=402649088
amken_bunny.menu.flash.134217728_46137344=128MB (Sketch: 84MB, FS: 44MB)
amken_bunny.menu.flash.134217728_46137344.upload.maximum_size=88076288
amken_bunny.menu.flash.134217728_46137344.build.flash_total=134217728
amken_bunny.menu.flash.134217728_46137344.build.flash_length=88076288
amken_bunny.menu.flash.134217728_46137344.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_46137344.build.fs_start=356511744
amken_bunny.menu.flash.134217728_46137344.build.fs_end=402649088
amken_bunny.menu.flash.134217728_47185920=128MB (Sketch: 83MB, FS: 45MB)
amken_bunny.menu.flash.134217728_47185920.upload.maximum_size=87027712
amken_bunny.menu.flash.134217728_47185920.build.flash_total=134217728
amken_bunny.menu.flash.134217728_47185920.build.flash_length=87027712
amken_bunny.menu.flash.134217728_47185920.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_47185920.build.fs_start=355463168
amken_bunny.menu.flash.134217728_47185920.build.fs_end=402649088
amken_bunny.menu.flash.134217728_48234496=128MB (Sketch: 82MB, FS: 46MB)
amken_bunny.menu.flash.134217728_48234496.upload.maximum_size=85979136
amken_bunny.menu.flash.134217728_48234496.build.flash_total=134217728
amken_bunny.menu.flash.134217728_48234496.build.flash_length=85979136
amken_bunny.menu.flash.134217728_48234496.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_48234496.build.fs_start=354414592
amken_bunny.menu.flash.134217728_48234496.build.fs_end=402649088
amken_bunny.menu.flash.134217728_49283072=128MB (Sketch: 81MB, FS: 47MB)
amken_bunny.menu.flash.134217728_49283072.upload.maximum_size=84930560
amken_bunny.menu.flash.134217728_49283072.build.flash_total=134217728
amken_bunny.menu.flash.134217728_49283072.build.flash_length=84930560
amken_bunny.menu.flash.134217728_49283072.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_49283072.build.fs_start=353366016
amken_bunny.menu.flash.134217728_49283072.build.fs_end=402649088
amken_bunny.menu.flash.134217728_50331648=128MB (Sketch: 80MB, FS: 48MB)
amken_bunny.menu.flash.134217728_50331648.upload.maximum_size=83881984
amken_bunny.menu.flash.134217728_50331648.build.flash_total=134217728
amken_bunny.menu.flash.134217728_50331648.build.flash_length=83881984
amken_bunny.menu.flash.134217728_50331648.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_50331648.build.fs_start=352317440
amken_bunny.menu.flash.134217728_50331648.build.fs_end=402649088
amken_bunny.menu.flash.134217728_51380224=128MB (Sketch: 79MB, FS: 49MB)
amken_bunny.menu.flash.134217728_51380224.upload.maximum_size=82833408
amken_bunny.menu.flash.134217728_51380224.build.flash_total=134217728
amken_bunny.menu.flash.134217728_51380224.build.flash_length=82833408
amken_bunny.menu.flash.134217728_51380224.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_51380224.build.fs_start=351268864
amken_bunny.menu.flash.134217728_51380224.build.fs_end=402649088
amken_bunny.menu.flash.134217728_52428800=128MB (Sketch: 78MB, FS: 50MB)
amken_bunny.menu.flash.134217728_52428800.upload.maximum_size=81784832
amken_bunny.menu.flash.134217728_52428800.build.flash_total=134217728
amken_bunny.menu.flash.134217728_52428800.build.flash_length=81784832
amken_bunny.menu.flash.134217728_52428800.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_52428800.build.fs_start=350220288
amken_bunny.menu.flash.134217728_52428800.build.fs_end=402649088
amken_bunny.menu.flash.134217728_53477376=128MB (Sketch: 77MB, FS: 51MB)
amken_bunny.menu.flash.134217728_53477376.upload.maximum_size=80736256
amken_bunny.menu.flash.134217728_53477376.build.flash_total=134217728
amken_bunny.menu.flash.134217728_53477376.build.flash_length=80736256
amken_bunny.menu.flash.134217728_53477376.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_53477376.build.fs_start=349171712
amken_bunny.menu.flash.134217728_53477376.build.fs_end=402649088
amken_bunny.menu.flash.134217728_54525952=128MB (Sketch: 76MB, FS: 52MB)
amken_bunny.menu.flash.134217728_54525952.upload.maximum_size=79687680
amken_bunny.menu.flash.134217728_54525952.build.flash_total=134217728
amken_bunny.menu.flash.134217728_54525952.build.flash_length=79687680
amken_bunny.menu.flash.134217728_54525952.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_54525952.build.fs_start=348123136
amken_bunny.menu.flash.134217728_54525952.build.fs_end=402649088
amken_bunny.menu.flash.134217728_55574528=128MB (Sketch: 75MB, FS: 53MB)
amken_bunny.menu.flash.134217728_55574528.upload.maximum_size=78639104
amken_bunny.menu.flash.134217728_55574528.build.flash_total=134217728
amken_bunny.menu.flash.134217728_55574528.build.flash_length=78639104
amken_bunny.menu.flash.134217728_55574528.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_55574528.build.fs_start=347074560
amken_bunny.menu.flash.134217728_55574528.build.fs_end=402649088
amken_bunny.menu.flash.134217728_56623104=128MB (Sketch: 74MB, FS: 54MB)
amken_bunny.menu.flash.134217728_56623104.upload.maximum_size=77590528
amken_bunny.menu.flash.134217728_56623104.build.flash_total=134217728
amken_bunny.menu.flash.134217728_56623104.build.flash_length=77590528
amken_bunny.menu.flash.134217728_56623104.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_56623104.build.fs_start=346025984
amken_bunny.menu.flash.134217728_56623104.build.fs_end=402649088
amken_bunny.menu.flash.134217728_57671680=128MB (Sketch: 73MB, FS: 55MB)
amken_bunny.menu.flash.134217728_57671680.upload.maximum_size=76541952
amken_bunny.menu.flash.134217728_57671680.build.flash_total=134217728
amken_bunny.menu.flash.134217728_57671680.build.flash_length=76541952
amken_bunny.menu.flash.134217728_57671680.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_57671680.build.fs_start=344977408
amken_bunny.menu.flash.134217728_57671680.build.fs_end=402649088
amken_bunny.menu.flash.134217728_58720256=128MB (Sketch: 72MB, FS: 56MB)
amken_bunny.menu.flash.134217728_58720256.upload.maximum_size=75493376
amken_bunny.menu.flash.134217728_58720256.build.flash_total=134217728
amken_bunny.menu.flash.134217728_58720256.build.flash_length=75493376
amken_bunny.menu.flash.134217728_58720256.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_58720256.build.fs_start=343928832
amken_bunny.menu.flash.134217728_58720256.build.fs_end=402649088
amken_bunny.menu.flash.134217728_59768832=128MB (Sketch: 71MB, FS: 57MB)
amken_bunny.menu.flash.134217728_59768832.upload.maximum_size=74444800
amken_bunny.menu.flash.134217728_59768832.build.flash_total=134217728
amken_bunny.menu.flash.134217728_59768832.build.flash_length=74444800
amken_bunny.menu.flash.134217728_59768832.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_59768832.build.fs_start=342880256
amken_bunny.menu.flash.134217728_59768832.build.fs_end=402649088
amken_bunny.menu.flash.134217728_60817408=128MB (Sketch: 70MB, FS: 58MB)
amken_bunny.menu.flash.134217728_60817408.upload.maximum_size=73396224
amken_bunny.menu.flash.134217728_60817408.build.flash_total=134217728
amken_bunny.menu.flash.134217728_60817408.build.flash_length=73396224
amken_bunny.menu.flash.134217728_60817408.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_60817408.build.fs_start=341831680
amken_bunny.menu.flash.134217728_60817408.build.fs_end=402649088
amken_bunny.menu.flash.134217728_61865984=128MB (Sketch: 69MB, FS: 59MB)
amken_bunny.menu.flash.134217728_61865984.upload.maximum_size=72347648
amken_bunny.menu.flash.134217728_61865984.build.flash_total=134217728
amken_bunny.menu.flash.134217728_61865984.build.flash_length=72347648
amken_bunny.menu.flash.134217728_61865984.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_61865984.build.fs_start=340783104
amken_bunny.menu.flash.134217728_61865984.build.fs_end=402649088
