earlephilhower/arduino-pico/boards.txt
amken_bunny.menu.flash.134217728_62914560=128MB (Sketch: 68MB, FS: 60MB)
amken_bunny.menu.flash.134217728_62914560.upload.maximum_size=71299072
amken_bunny.menu.flash.134217728_62914560.build.flash_total=134217728
amken_bunny.menu.flash.134217728_62914560.build.flash_length=71299072
amken_bunny.menu.flash.134217728_62914560.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_62914560.build.fs_start=339734528
amken_bunny.menu.flash.134217728_62914560.build.fs_end=402649088
amken_bunny.menu.flash.134217728_63963136=128MB (Sketch: 67MB, FS: 61MB)
amken_bunny.menu.flash.134217728_63963136.upload.maximum_size=70250496
amken_bunny.menu.flash.134217728_63963136.build.flash_total=134217728
amken_bunny.menu.flash.134217728_63963136.build.flash_length=70250496
amken_bunny.menu.flash.134217728_63963136.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_63963136.build.fs_start=338685952
amken_bunny.menu.flash.134217728_63963136.build.fs_end=402649088
amken_bunny.menu.flash.134217728_65011712=128MB (Sketch: 66MB, FS: 62MB)
amken_bunny.menu.flash.134217728_65011712.upload.maximum_size=69201920
amken_bunny.menu.flash.134217728_65011712.build.flash_total=134217728
amken_bunny.menu.flash.134217728_65011712.build.flash_length=69201920
amken_bunny.menu.flash.134217728_65011712.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_65011712.build.fs_start=337637376
amken_bunny.menu.flash.134217728_65011712.build.fs_end=402649088
amken_bunny.menu.flash.134217728_66060288=128MB (Sketch: 65MB, FS: 63MB)
amken_bunny.menu.flash.134217728_66060288.upload.maximum_size=68153344
amken_bunny.menu.flash.134217728_66060288.build.flash_total=134217728
amken_bunny.menu.flash.134217728_66060288.build.flash_length=68153344
amken_bunny.menu.flash.134217728_66060288.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_66060288.build.fs_start=336588800
amken_bunny.menu.flash.134217728_66060288.build.fs_end=402649088
amken_bunny.menu.flash.134217728_67108864=128MB (Sketch: 64MB, FS: 64MB)
amken_bunny.menu.flash.134217728_67108864.upload.maximum_size=67104768
amken_bunny.menu.flash.134217728_67108864.build.flash_total=134217728
amken_bunny.menu.flash.134217728_67108864.build.flash_length=67104768
amken_bunny.menu.flash.134217728_67108864.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_67108864.build.fs_start=335540224
amken_bunny.menu.flash.134217728_67108864.build.fs_end=402649088
amken_bunny.menu.flash.134217728_68157440=128MB (Sketch: 63MB, FS: 65MB)
amken_bunny.menu.flash.134217728_68157440.upload.maximum_size=66056192
amken_bunny.menu.flash.134217728_68157440.build.flash_total=134217728
amken_bunny.menu.flash.134217728_68157440.build.flash_length=66056192
amken_bunny.menu.flash.134217728_68157440.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_68157440.build.fs_start=334491648
amken_bunny.menu.flash.134217728_68157440.build.fs_end=402649088
amken_bunny.menu.flash.134217728_69206016=128MB (Sketch: 62MB, FS: 66MB)
amken_bunny.menu.flash.134217728_69206016.upload.maximum_size=65007616
amken_bunny.menu.flash.134217728_69206016.build.flash_total=134217728
amken_bunny.menu.flash.134217728_69206016.build.flash_length=65007616
amken_bunny.menu.flash.134217728_69206016.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_69206016.build.fs_start=333443072
amken_bunny.menu.flash.134217728_69206016.build.fs_end=402649088
amken_bunny.menu.flash.134217728_70254592=128MB (Sketch: 61MB, FS: 67MB)
amken_bunny.menu.flash.134217728_70254592.upload.maximum_size=63959040
amken_bunny.menu.flash.134217728_70254592.build.flash_total=134217728
amken_bunny.menu.flash.134217728_70254592.build.flash_length=63959040
amken_bunny.menu.flash.134217728_70254592.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_70254592.build.fs_start=332394496
amken_bunny.menu.flash.134217728_70254592.build.fs_end=402649088
amken_bunny.menu.flash.134217728_71303168=128MB (Sketch: 60MB, FS: 68MB)
amken_bunny.menu.flash.134217728_71303168.upload.maximum_size=62910464
amken_bunny.menu.flash.134217728_71303168.build.flash_total=134217728
amken_bunny.menu.flash.134217728_71303168.build.flash_length=62910464
amken_bunny.menu.flash.134217728_71303168.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_71303168.build.fs_start=331345920
amken_bunny.menu.flash.134217728_71303168.build.fs_end=402649088
amken_bunny.menu.flash.134217728_72351744=128MB (Sketch: 59MB, FS: 69MB)
amken_bunny.menu.flash.134217728_72351744.upload.maximum_size=61861888
amken_bunny.menu.flash.134217728_72351744.build.flash_total=134217728
amken_bunny.menu.flash.134217728_72351744.build.flash_length=61861888
amken_bunny.menu.flash.134217728_72351744.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_72351744.build.fs_start=330297344
amken_bunny.menu.flash.134217728_72351744.build.fs_end=402649088
amken_bunny.menu.flash.134217728_73400320=128MB (Sketch: 58MB, FS: 70MB)
amken_bunny.menu.flash.134217728_73400320.upload.maximum_size=60813312
amken_bunny.menu.flash.134217728_73400320.build.flash_total=134217728
amken_bunny.menu.flash.134217728_73400320.build.flash_length=60813312
amken_bunny.menu.flash.134217728_73400320.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_73400320.build.fs_start=329248768
amken_bunny.menu.flash.134217728_73400320.build.fs_end=402649088
amken_bunny.menu.flash.134217728_74448896=128MB (Sketch: 57MB, FS: 71MB)
amken_bunny.menu.flash.134217728_74448896.upload.maximum_size=59764736
amken_bunny.menu.flash.134217728_74448896.build.flash_total=134217728
amken_bunny.menu.flash.134217728_74448896.build.flash_length=59764736
amken_bunny.menu.flash.134217728_74448896.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_74448896.build.fs_start=328200192
amken_bunny.menu.flash.134217728_74448896.build.fs_end=402649088
amken_bunny.menu.flash.134217728_75497472=128MB (Sketch: 56MB, FS: 72MB)
amken_bunny.menu.flash.134217728_75497472.upload.maximum_size=58716160
amken_bunny.menu.flash.134217728_75497472.build.flash_total=134217728
amken_bunny.menu.flash.134217728_75497472.build.flash_length=58716160
amken_bunny.menu.flash.134217728_75497472.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_75497472.build.fs_start=327151616
amken_bunny.menu.flash.134217728_75497472.build.fs_end=402649088
amken_bunny.menu.flash.134217728_76546048=128MB (Sketch: 55MB, FS: 73MB)
amken_bunny.menu.flash.134217728_76546048.upload.maximum_size=57667584
amken_bunny.menu.flash.134217728_76546048.build.flash_total=134217728
amken_bunny.menu.flash.134217728_76546048.build.flash_length=57667584
amken_bunny.menu.flash.134217728_76546048.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_76546048.build.fs_start=326103040
amken_bunny.menu.flash.134217728_76546048.build.fs_end=402649088
amken_bunny.menu.flash.134217728_77594624=128MB (Sketch: 54MB, FS: 74MB)
amken_bunny.menu.flash.134217728_77594624.upload.maximum_size=56619008
amken_bunny.menu.flash.134217728_77594624.build.flash_total=134217728
amken_bunny.menu.flash.134217728_77594624.build.flash_length=56619008
amken_bunny.menu.flash.134217728_77594624.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_77594624.build.fs_start=325054464
amken_bunny.menu.flash.134217728_77594624.build.fs_end=402649088
amken_bunny.menu.flash.134217728_78643200=128MB (Sketch: 53MB, FS: 75MB)
amken_bunny.menu.flash.134217728_78643200.upload.maximum_size=55570432
amken_bunny.menu.flash.134217728_78643200.build.flash_total=134217728
amken_bunny.menu.flash.134217728_78643200.build.flash_length=55570432
amken_bunny.menu.flash.134217728_78643200.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_78643200.build.fs_start=324005888
amken_bunny.menu.flash.134217728_78643200.build.fs_end=402649088
amken_bunny.menu.flash.134217728_79691776=128MB (Sketch: 52MB, FS: 76MB)
amken_bunny.menu.flash.134217728_79691776.upload.maximum_size=54521856
amken_bunny.menu.flash.134217728_79691776.build.flash_total=134217728
amken_bunny.menu.flash.134217728_79691776.build.flash_length=54521856
amken_bunny.menu.flash.134217728_79691776.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_79691776.build.fs_start=322957312
amken_bunny.menu.flash.134217728_79691776.build.fs_end=402649088
amken_bunny.menu.flash.134217728_80740352=128MB (Sketch: 51MB, FS: 77MB)
amken_bunny.menu.flash.134217728_80740352.upload.maximum_size=53473280
amken_bunny.menu.flash.134217728_80740352.build.flash_total=134217728
amken_bunny.menu.flash.134217728_80740352.build.flash_length=53473280
amken_bunny.menu.flash.134217728_80740352.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_80740352.build.fs_start=321908736
amken_bunny.menu.flash.134217728_80740352.build.fs_end=402649088
amken_bunny.menu.flash.134217728_81788928=128MB (Sketch: 50MB, FS: 78MB)
amken_bunny.menu.flash.134217728_81788928.upload.maximum_size=52424704
amken_bunny.menu.flash.134217728_81788928.build.flash_total=134217728
amken_bunny.menu.flash.134217728_81788928.build.flash_length=52424704
amken_bunny.menu.flash.134217728_81788928.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_81788928.build.fs_start=320860160
amken_bunny.menu.flash.134217728_81788928.build.fs_end=402649088
amken_bunny.menu.flash.134217728_82837504=128MB (Sketch: 49MB, FS: 79MB)
amken_bunny.menu.flash.134217728_82837504.upload.maximum_size=51376128
amken_bunny.menu.flash.134217728_82837504.build.flash_total=134217728
amken_bunny.menu.flash.134217728_82837504.build.flash_length=51376128
amken_bunny.menu.flash.134217728_82837504.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_82837504.build.fs_start=319811584
amken_bunny.menu.flash.134217728_82837504.build.fs_end=402649088
amken_bunny.menu.flash.134217728_83886080=128MB (Sketch: 48MB, FS: 80MB)
amken_bunny.menu.flash.134217728_83886080.upload.maximum_size=50327552
amken_bunny.menu.flash.134217728_83886080.build.flash_total=134217728
amken_bunny.menu.flash.134217728_83886080.build.flash_length=50327552
amken_bunny.menu.flash.134217728_83886080.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_83886080.build.fs_start=318763008
amken_bunny.menu.flash.134217728_83886080.build.fs_end=402649088
amken_bunny.menu.flash.134217728_84934656=128MB (Sketch: 47MB, FS: 81MB)
amken_bunny.menu.flash.134217728_84934656.upload.maximum_size=49278976
amken_bunny.menu.flash.134217728_84934656.build.flash_total=134217728
amken_bunny.menu.flash.134217728_84934656.build.flash_length=49278976
amken_bunny.menu.flash.134217728_84934656.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_84934656.build.fs_start=317714432
amken_bunny.menu.flash.134217728_84934656.build.fs_end=402649088
amken_bunny.menu.flash.134217728_85983232=128MB (Sketch: 46MB, FS: 82MB)
amken_bunny.menu.flash.134217728_85983232.upload.maximum_size=48230400
amken_bunny.menu.flash.134217728_85983232.build.flash_total=134217728
amken_bunny.menu.flash.134217728_85983232.build.flash_length=48230400
amken_bunny.menu.flash.134217728_85983232.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_85983232.build.fs_start=316665856
amken_bunny.menu.flash.134217728_85983232.build.fs_end=402649088
amken_bunny.menu.flash.134217728_87031808=128MB (Sketch: 45MB, FS: 83MB)
amken_bunny.menu.flash.134217728_87031808.upload.maximum_size=47181824
amken_bunny.menu.flash.134217728_87031808.build.flash_total=134217728
amken_bunny.menu.flash.134217728_87031808.build.flash_length=47181824
amken_bunny.menu.flash.134217728_87031808.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_87031808.build.fs_start=315617280
amken_bunny.menu.flash.134217728_87031808.build.fs_end=402649088
amken_bunny.menu.flash.134217728_88080384=128MB (Sketch: 44MB, FS: 84MB)
amken_bunny.menu.flash.134217728_88080384.upload.maximum_size=46133248
amken_bunny.menu.flash.134217728_88080384.build.flash_total=134217728
amken_bunny.menu.flash.134217728_88080384.build.flash_length=46133248
amken_bunny.menu.flash.134217728_88080384.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_88080384.build.fs_start=314568704
amken_bunny.menu.flash.134217728_88080384.build.fs_end=402649088
amken_bunny.menu.flash.134217728_89128960=128MB (Sketch: 43MB, FS: 85MB)
amken_bunny.menu.flash.134217728_89128960.upload.maximum_size=45084672
amken_bunny.menu.flash.134217728_89128960.build.flash_total=134217728
amken_bunny.menu.flash.134217728_89128960.build.flash_length=45084672
amken_bunny.menu.flash.134217728_89128960.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_89128960.build.fs_start=313520128
amken_bunny.menu.flash.134217728_89128960.build.fs_end=402649088
amken_bunny.menu.flash.134217728_90177536=128MB (Sketch: 42MB, FS: 86MB)
amken_bunny.menu.flash.134217728_90177536.upload.maximum_size=44036096
amken_bunny.menu.flash.134217728_90177536.build.flash_total=134217728
amken_bunny.menu.flash.134217728_90177536.build.flash_length=44036096
amken_bunny.menu.flash.134217728_90177536.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_90177536.build.fs_start=312471552
amken_bunny.menu.flash.134217728_90177536.build.fs_end=402649088
amken_bunny.menu.flash.134217728_91226112=128MB (Sketch: 41MB, FS: 87MB)
amken_bunny.menu.flash.134217728_91226112.upload.maximum_size=42987520
amken_bunny.menu.flash.134217728_91226112.build.flash_total=134217728
amken_bunny.menu.flash.134217728_91226112.build.flash_length=42987520
amken_bunny.menu.flash.134217728_91226112.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_91226112.build.fs_start=311422976
amken_bunny.menu.flash.134217728_91226112.build.fs_end=402649088
amken_bunny.menu.flash.134217728_92274688=128MB (Sketch: 40MB, FS: 88MB)
amken_bunny.menu.flash.134217728_92274688.upload.maximum_size=41938944
amken_bunny.menu.flash.134217728_92274688.build.flash_total=134217728
amken_bunny.menu.flash.134217728_92274688.build.flash_length=41938944
amken_bunny.menu.flash.134217728_92274688.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_92274688.build.fs_start=310374400
amken_bunny.menu.flash.134217728_92274688.build.fs_end=402649088
amken_bunny.menu.flash.134217728_93323264=128MB (Sketch: 39MB, FS: 89MB)
amken_bunny.menu.flash.134217728_93323264.upload.maximum_size=40890368
amken_bunny.menu.flash.134217728_93323264.build.flash_total=134217728
amken_bunny.menu.flash.134217728_93323264.build.flash_length=40890368
amken_bunny.menu.flash.134217728_93323264.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_93323264.build.fs_start=309325824
amken_bunny.menu.flash.134217728_93323264.build.fs_end=402649088
amken_bunny.menu.flash.134217728_94371840=128MB (Sketch: 38MB, FS: 90MB)
amken_bunny.menu.flash.134217728_94371840.upload.maximum_size=39841792
amken_bunny.menu.flash.134217728_94371840.build.flash_total=134217728
amken_bunny.menu.flash.134217728_94371840.build.flash_length=39841792
amken_bunny.menu.flash.134217728_94371840.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_94371840.build.fs_start=308277248
amken_bunny.menu.flash.134217728_94371840.build.fs_end=402649088
amken_bunny.menu.flash.134217728_95420416=128MB (Sketch: 37MB, FS: 91MB)
amken_bunny.menu.flash.134217728_95420416.upload.maximum_size=38793216
amken_bunny.menu.flash.134217728_95420416.build.flash_total=134217728
amken_bunny.menu.flash.134217728_95420416.build.flash_length=38793216
amken_bunny.menu.flash.134217728_95420416.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_95420416.build.fs_start=307228672
amken_bunny.menu.flash.134217728_95420416.build.fs_end=402649088
amken_bunny.menu.flash.134217728_96468992=128MB (Sketch: 36MB, FS: 92MB)
amken_bunny.menu.flash.134217728_96468992.upload.maximum_size=37744640
amken_bunny.menu.flash.134217728_96468992.build.flash_total=134217728
amken_bunny.menu.flash.134217728_96468992.build.flash_length=37744640
amken_bunny.menu.flash.134217728_96468992.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_96468992.build.fs_start=306180096
amken_bunny.menu.flash.134217728_96468992.build.fs_end=402649088
amken_bunny.menu.flash.134217728_97517568=128MB (Sketch: 35MB, FS: 93MB)
amken_bunny.menu.flash.134217728_97517568.upload.maximum_size=36696064
amken_bunny.menu.flash.134217728_97517568.build.flash_total=134217728
amken_bunny.menu.flash.134217728_97517568.build.flash_length=36696064
amken_bunny.menu.flash.134217728_97517568.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_97517568.build.fs_start=305131520
amken_bunny.menu.flash.134217728_97517568.build.fs_end=402649088
amken_bunny.menu.flash.134217728_98566144=128MB (Sketch: 34MB, FS: 94MB)
amken_bunny.menu.flash.134217728_98566144.upload.maximum_size=35647488
amken_bunny.menu.flash.134217728_98566144.build.flash_total=134217728
amken_bunny.menu.flash.134217728_98566144.build.flash_length=35647488
amken_bunny.menu.flash.134217728_98566144.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_98566144.build.fs_start=304082944
amken_bunny.menu.flash.134217728_98566144.build.fs_end=402649088
amken_bunny.menu.flash.134217728_99614720=128MB (Sketch: 33MB, FS: 95MB)
amken_bunny.menu.flash.134217728_99614720.upload.maximum_size=34598912
amken_bunny.menu.flash.134217728_99614720.build.flash_total=134217728
amken_bunny.menu.flash.134217728_99614720.build.flash_length=34598912
amken_bunny.menu.flash.134217728_99614720.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_99614720.build.fs_start=303034368
amken_bunny.menu.flash.134217728_99614720.build.fs_end=402649088
amken_bunny.menu.flash.134217728_100663296=128MB (Sketch: 32MB, FS: 96MB)
amken_bunny.menu.flash.134217728_100663296.upload.maximum_size=33550336
amken_bunny.menu.flash.134217728_100663296.build.flash_total=134217728
amken_bunny.menu.flash.134217728_100663296.build.flash_length=33550336
amken_bunny.menu.flash.134217728_100663296.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_100663296.build.fs_start=301985792
