earlephilhower/arduino-pico/boards.txt
amken_bunny.menu.flash.134217728_100663296.build.fs_end=402649088
amken_bunny.menu.flash.134217728_101711872=128MB (Sketch: 31MB, FS: 97MB)
amken_bunny.menu.flash.134217728_101711872.upload.maximum_size=32501760
amken_bunny.menu.flash.134217728_101711872.build.flash_total=134217728
amken_bunny.menu.flash.134217728_101711872.build.flash_length=32501760
amken_bunny.menu.flash.134217728_101711872.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_101711872.build.fs_start=300937216
amken_bunny.menu.flash.134217728_101711872.build.fs_end=402649088
amken_bunny.menu.flash.134217728_102760448=128MB (Sketch: 30MB, FS: 98MB)
amken_bunny.menu.flash.134217728_102760448.upload.maximum_size=31453184
amken_bunny.menu.flash.134217728_102760448.build.flash_total=134217728
amken_bunny.menu.flash.134217728_102760448.build.flash_length=31453184
amken_bunny.menu.flash.134217728_102760448.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_102760448.build.fs_start=299888640
amken_bunny.menu.flash.134217728_102760448.build.fs_end=402649088
amken_bunny.menu.flash.134217728_103809024=128MB (Sketch: 29MB, FS: 99MB)
amken_bunny.menu.flash.134217728_103809024.upload.maximum_size=30404608
amken_bunny.menu.flash.134217728_103809024.build.flash_total=134217728
amken_bunny.menu.flash.134217728_103809024.build.flash_length=30404608
amken_bunny.menu.flash.134217728_103809024.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_103809024.build.fs_start=298840064
amken_bunny.menu.flash.134217728_103809024.build.fs_end=402649088
amken_bunny.menu.flash.134217728_104857600=128MB (Sketch: 28MB, FS: 100MB)
amken_bunny.menu.flash.134217728_104857600.upload.maximum_size=29356032
amken_bunny.menu.flash.134217728_104857600.build.flash_total=134217728
amken_bunny.menu.flash.134217728_104857600.build.flash_length=29356032
amken_bunny.menu.flash.134217728_104857600.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_104857600.build.fs_start=297791488
amken_bunny.menu.flash.134217728_104857600.build.fs_end=402649088
amken_bunny.menu.flash.134217728_105906176=128MB (Sketch: 27MB, FS: 101MB)
amken_bunny.menu.flash.134217728_105906176.upload.maximum_size=28307456
amken_bunny.menu.flash.134217728_105906176.build.flash_total=134217728
amken_bunny.menu.flash.134217728_105906176.build.flash_length=28307456
amken_bunny.menu.flash.134217728_105906176.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_105906176.build.fs_start=296742912
amken_bunny.menu.flash.134217728_105906176.build.fs_end=402649088
amken_bunny.menu.flash.134217728_106954752=128MB (Sketch: 26MB, FS: 102MB)
amken_bunny.menu.flash.134217728_106954752.upload.maximum_size=27258880
amken_bunny.menu.flash.134217728_106954752.build.flash_total=134217728
amken_bunny.menu.flash.134217728_106954752.build.flash_length=27258880
amken_bunny.menu.flash.134217728_106954752.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_106954752.build.fs_start=295694336
amken_bunny.menu.flash.134217728_106954752.build.fs_end=402649088
amken_bunny.menu.flash.134217728_108003328=128MB (Sketch: 25MB, FS: 103MB)
amken_bunny.menu.flash.134217728_108003328.upload.maximum_size=26210304
amken_bunny.menu.flash.134217728_108003328.build.flash_total=134217728
amken_bunny.menu.flash.134217728_108003328.build.flash_length=26210304
amken_bunny.menu.flash.134217728_108003328.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_108003328.build.fs_start=294645760
amken_bunny.menu.flash.134217728_108003328.build.fs_end=402649088
amken_bunny.menu.flash.134217728_109051904=128MB (Sketch: 24MB, FS: 104MB)
amken_bunny.menu.flash.134217728_109051904.upload.maximum_size=25161728
amken_bunny.menu.flash.134217728_109051904.build.flash_total=134217728
amken_bunny.menu.flash.134217728_109051904.build.flash_length=25161728
amken_bunny.menu.flash.134217728_109051904.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_109051904.build.fs_start=293597184
amken_bunny.menu.flash.134217728_109051904.build.fs_end=402649088
amken_bunny.menu.flash.134217728_110100480=128MB (Sketch: 23MB, FS: 105MB)
amken_bunny.menu.flash.134217728_110100480.upload.maximum_size=24113152
amken_bunny.menu.flash.134217728_110100480.build.flash_total=134217728
amken_bunny.menu.flash.134217728_110100480.build.flash_length=24113152
amken_bunny.menu.flash.134217728_110100480.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_110100480.build.fs_start=292548608
amken_bunny.menu.flash.134217728_110100480.build.fs_end=402649088
amken_bunny.menu.flash.134217728_111149056=128MB (Sketch: 22MB, FS: 106MB)
amken_bunny.menu.flash.134217728_111149056.upload.maximum_size=23064576
amken_bunny.menu.flash.134217728_111149056.build.flash_total=134217728
amken_bunny.menu.flash.134217728_111149056.build.flash_length=23064576
amken_bunny.menu.flash.134217728_111149056.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_111149056.build.fs_start=291500032
amken_bunny.menu.flash.134217728_111149056.build.fs_end=402649088
amken_bunny.menu.flash.134217728_112197632=128MB (Sketch: 21MB, FS: 107MB)
amken_bunny.menu.flash.134217728_112197632.upload.maximum_size=22016000
amken_bunny.menu.flash.134217728_112197632.build.flash_total=134217728
amken_bunny.menu.flash.134217728_112197632.build.flash_length=22016000
amken_bunny.menu.flash.134217728_112197632.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_112197632.build.fs_start=290451456
amken_bunny.menu.flash.134217728_112197632.build.fs_end=402649088
amken_bunny.menu.flash.134217728_113246208=128MB (Sketch: 20MB, FS: 108MB)
amken_bunny.menu.flash.134217728_113246208.upload.maximum_size=20967424
amken_bunny.menu.flash.134217728_113246208.build.flash_total=134217728
amken_bunny.menu.flash.134217728_113246208.build.flash_length=20967424
amken_bunny.menu.flash.134217728_113246208.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_113246208.build.fs_start=289402880
amken_bunny.menu.flash.134217728_113246208.build.fs_end=402649088
amken_bunny.menu.flash.134217728_114294784=128MB (Sketch: 19MB, FS: 109MB)
amken_bunny.menu.flash.134217728_114294784.upload.maximum_size=19918848
amken_bunny.menu.flash.134217728_114294784.build.flash_total=134217728
amken_bunny.menu.flash.134217728_114294784.build.flash_length=19918848
amken_bunny.menu.flash.134217728_114294784.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_114294784.build.fs_start=288354304
amken_bunny.menu.flash.134217728_114294784.build.fs_end=402649088
amken_bunny.menu.flash.134217728_115343360=128MB (Sketch: 18MB, FS: 110MB)
amken_bunny.menu.flash.134217728_115343360.upload.maximum_size=18870272
amken_bunny.menu.flash.134217728_115343360.build.flash_total=134217728
amken_bunny.menu.flash.134217728_115343360.build.flash_length=18870272
amken_bunny.menu.flash.134217728_115343360.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_115343360.build.fs_start=287305728
amken_bunny.menu.flash.134217728_115343360.build.fs_end=402649088
amken_bunny.menu.flash.134217728_116391936=128MB (Sketch: 17MB, FS: 111MB)
amken_bunny.menu.flash.134217728_116391936.upload.maximum_size=17821696
amken_bunny.menu.flash.134217728_116391936.build.flash_total=134217728
amken_bunny.menu.flash.134217728_116391936.build.flash_length=17821696
amken_bunny.menu.flash.134217728_116391936.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_116391936.build.fs_start=286257152
amken_bunny.menu.flash.134217728_116391936.build.fs_end=402649088
amken_bunny.menu.flash.134217728_117440512=128MB (Sketch: 16MB, FS: 112MB)
amken_bunny.menu.flash.134217728_117440512.upload.maximum_size=16773120
amken_bunny.menu.flash.134217728_117440512.build.flash_total=134217728
amken_bunny.menu.flash.134217728_117440512.build.flash_length=16773120
amken_bunny.menu.flash.134217728_117440512.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_117440512.build.fs_start=285208576
amken_bunny.menu.flash.134217728_117440512.build.fs_end=402649088
amken_bunny.menu.flash.134217728_118489088=128MB (Sketch: 15MB, FS: 113MB)
amken_bunny.menu.flash.134217728_118489088.upload.maximum_size=15724544
amken_bunny.menu.flash.134217728_118489088.build.flash_total=134217728
amken_bunny.menu.flash.134217728_118489088.build.flash_length=15724544
amken_bunny.menu.flash.134217728_118489088.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_118489088.build.fs_start=284160000
amken_bunny.menu.flash.134217728_118489088.build.fs_end=402649088
amken_bunny.menu.flash.134217728_119537664=128MB (Sketch: 14MB, FS: 114MB)
amken_bunny.menu.flash.134217728_119537664.upload.maximum_size=14675968
amken_bunny.menu.flash.134217728_119537664.build.flash_total=134217728
amken_bunny.menu.flash.134217728_119537664.build.flash_length=14675968
amken_bunny.menu.flash.134217728_119537664.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_119537664.build.fs_start=283111424
amken_bunny.menu.flash.134217728_119537664.build.fs_end=402649088
amken_bunny.menu.flash.134217728_120586240=128MB (Sketch: 13MB, FS: 115MB)
amken_bunny.menu.flash.134217728_120586240.upload.maximum_size=13627392
amken_bunny.menu.flash.134217728_120586240.build.flash_total=134217728
amken_bunny.menu.flash.134217728_120586240.build.flash_length=13627392
amken_bunny.menu.flash.134217728_120586240.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_120586240.build.fs_start=282062848
amken_bunny.menu.flash.134217728_120586240.build.fs_end=402649088
amken_bunny.menu.flash.134217728_121634816=128MB (Sketch: 12MB, FS: 116MB)
amken_bunny.menu.flash.134217728_121634816.upload.maximum_size=12578816
amken_bunny.menu.flash.134217728_121634816.build.flash_total=134217728
amken_bunny.menu.flash.134217728_121634816.build.flash_length=12578816
amken_bunny.menu.flash.134217728_121634816.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_121634816.build.fs_start=281014272
amken_bunny.menu.flash.134217728_121634816.build.fs_end=402649088
amken_bunny.menu.flash.134217728_122683392=128MB (Sketch: 11MB, FS: 117MB)
amken_bunny.menu.flash.134217728_122683392.upload.maximum_size=11530240
amken_bunny.menu.flash.134217728_122683392.build.flash_total=134217728
amken_bunny.menu.flash.134217728_122683392.build.flash_length=11530240
amken_bunny.menu.flash.134217728_122683392.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_122683392.build.fs_start=279965696
amken_bunny.menu.flash.134217728_122683392.build.fs_end=402649088
amken_bunny.menu.flash.134217728_123731968=128MB (Sketch: 10MB, FS: 118MB)
amken_bunny.menu.flash.134217728_123731968.upload.maximum_size=10481664
amken_bunny.menu.flash.134217728_123731968.build.flash_total=134217728
amken_bunny.menu.flash.134217728_123731968.build.flash_length=10481664
amken_bunny.menu.flash.134217728_123731968.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_123731968.build.fs_start=278917120
amken_bunny.menu.flash.134217728_123731968.build.fs_end=402649088
amken_bunny.menu.flash.134217728_124780544=128MB (Sketch: 9MB, FS: 119MB)
amken_bunny.menu.flash.134217728_124780544.upload.maximum_size=9433088
amken_bunny.menu.flash.134217728_124780544.build.flash_total=134217728
amken_bunny.menu.flash.134217728_124780544.build.flash_length=9433088
amken_bunny.menu.flash.134217728_124780544.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_124780544.build.fs_start=277868544
amken_bunny.menu.flash.134217728_124780544.build.fs_end=402649088
amken_bunny.menu.flash.134217728_125829120=128MB (Sketch: 8MB, FS: 120MB)
amken_bunny.menu.flash.134217728_125829120.upload.maximum_size=8384512
amken_bunny.menu.flash.134217728_125829120.build.flash_total=134217728
amken_bunny.menu.flash.134217728_125829120.build.flash_length=8384512
amken_bunny.menu.flash.134217728_125829120.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_125829120.build.fs_start=276819968
amken_bunny.menu.flash.134217728_125829120.build.fs_end=402649088
amken_bunny.menu.flash.134217728_126877696=128MB (Sketch: 7MB, FS: 121MB)
amken_bunny.menu.flash.134217728_126877696.upload.maximum_size=7335936
amken_bunny.menu.flash.134217728_126877696.build.flash_total=134217728
amken_bunny.menu.flash.134217728_126877696.build.flash_length=7335936
amken_bunny.menu.flash.134217728_126877696.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_126877696.build.fs_start=275771392
amken_bunny.menu.flash.134217728_126877696.build.fs_end=402649088
amken_bunny.menu.flash.134217728_127926272=128MB (Sketch: 6MB, FS: 122MB)
amken_bunny.menu.flash.134217728_127926272.upload.maximum_size=6287360
amken_bunny.menu.flash.134217728_127926272.build.flash_total=134217728
amken_bunny.menu.flash.134217728_127926272.build.flash_length=6287360
amken_bunny.menu.flash.134217728_127926272.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_127926272.build.fs_start=274722816
amken_bunny.menu.flash.134217728_127926272.build.fs_end=402649088
amken_bunny.menu.flash.134217728_128974848=128MB (Sketch: 5MB, FS: 123MB)
amken_bunny.menu.flash.134217728_128974848.upload.maximum_size=5238784
amken_bunny.menu.flash.134217728_128974848.build.flash_total=134217728
amken_bunny.menu.flash.134217728_128974848.build.flash_length=5238784
amken_bunny.menu.flash.134217728_128974848.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_128974848.build.fs_start=273674240
amken_bunny.menu.flash.134217728_128974848.build.fs_end=402649088
amken_bunny.menu.flash.134217728_130023424=128MB (Sketch: 4MB, FS: 124MB)
amken_bunny.menu.flash.134217728_130023424.upload.maximum_size=4190208
amken_bunny.menu.flash.134217728_130023424.build.flash_total=134217728
amken_bunny.menu.flash.134217728_130023424.build.flash_length=4190208
amken_bunny.menu.flash.134217728_130023424.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_130023424.build.fs_start=272625664
amken_bunny.menu.flash.134217728_130023424.build.fs_end=402649088
amken_bunny.menu.flash.134217728_131072000=128MB (Sketch: 3MB, FS: 125MB)
amken_bunny.menu.flash.134217728_131072000.upload.maximum_size=3141632
amken_bunny.menu.flash.134217728_131072000.build.flash_total=134217728
amken_bunny.menu.flash.134217728_131072000.build.flash_length=3141632
amken_bunny.menu.flash.134217728_131072000.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_131072000.build.fs_start=271577088
amken_bunny.menu.flash.134217728_131072000.build.fs_end=402649088
amken_bunny.menu.flash.134217728_132120576=128MB (Sketch: 2MB, FS: 126MB)
amken_bunny.menu.flash.134217728_132120576.upload.maximum_size=2093056
amken_bunny.menu.flash.134217728_132120576.build.flash_total=134217728
amken_bunny.menu.flash.134217728_132120576.build.flash_length=2093056
amken_bunny.menu.flash.134217728_132120576.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_132120576.build.fs_start=270528512
amken_bunny.menu.flash.134217728_132120576.build.fs_end=402649088
amken_bunny.menu.flash.134217728_133169152=128MB (Sketch: 1MB, FS: 127MB)
amken_bunny.menu.flash.134217728_133169152.upload.maximum_size=1044480
amken_bunny.menu.flash.134217728_133169152.build.flash_total=134217728
amken_bunny.menu.flash.134217728_133169152.build.flash_length=1044480
amken_bunny.menu.flash.134217728_133169152.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_133169152.build.fs_start=269479936
amken_bunny.menu.flash.134217728_133169152.build.fs_end=402649088
amken_bunny.menu.freq.200=200 MHz
amken_bunny.menu.freq.200.build.f_cpu=200000000L
amken_bunny.menu.freq.50=50 MHz
amken_bunny.menu.freq.50.build.f_cpu=50000000L
amken_bunny.menu.freq.100=100 MHz
amken_bunny.menu.freq.100.build.f_cpu=100000000L
amken_bunny.menu.freq.120=120 MHz
amken_bunny.menu.freq.120.build.f_cpu=120000000L
amken_bunny.menu.freq.125=125 MHz
amken_bunny.menu.freq.125.build.f_cpu=125000000L
amken_bunny.menu.freq.128=128 MHz
amken_bunny.menu.freq.128.build.f_cpu=128000000L
amken_bunny.menu.freq.133=133 MHz
amken_bunny.menu.freq.133.build.f_cpu=133000000L
amken_bunny.menu.freq.150=150 MHz
amken_bunny.menu.freq.150.build.f_cpu=150000000L
amken_bunny.menu.freq.176=176 MHz
amken_bunny.menu.freq.176.build.f_cpu=176000000L
amken_bunny.menu.freq.225=225 MHz (Overclock)
amken_bunny.menu.freq.225.build.f_cpu=225000000L
amken_bunny.menu.freq.240=240 MHz (Overclock)
amken_bunny.menu.freq.240.build.f_cpu=240000000L
amken_bunny.menu.freq.250=250 MHz (Overclock)
amken_bunny.menu.freq.250.build.f_cpu=250000000L
amken_bunny.menu.freq.276=276 MHz (Overclock)
amken_bunny.menu.freq.276.build.f_cpu=276000000L
amken_bunny.menu.freq.300=300 MHz (Overclock)
amken_bunny.menu.freq.300.build.f_cpu=300000000L
amken_bunny.menu.opt.Small=Small (-Os) (standard)
amken_bunny.menu.opt.Small.build.flags.optimize=-Os
amken_bunny.menu.opt.Optimize=Optimize (-O)
amken_bunny.menu.opt.Optimize.build.flags.optimize=-O
amken_bunny.menu.opt.Optimize2=Optimize More (-O2)
amken_bunny.menu.opt.Optimize2.build.flags.optimize=-O2
amken_bunny.menu.opt.Optimize3=Optimize Even More (-O3)
amken_bunny.menu.opt.Optimize3.build.flags.optimize=-O3
amken_bunny.menu.opt.Fast=Fast (-Ofast) (maybe slower)
amken_bunny.menu.opt.Fast.build.flags.optimize=-Ofast
amken_bunny.menu.opt.Debug=Debug (-Og)
amken_bunny.menu.opt.Debug.build.flags.optimize=-Og
amken_bunny.menu.opt.Disabled=Disabled (-O0)
amken_bunny.menu.opt.Disabled.build.flags.optimize=-O0
amken_bunny.menu.profile.Disabled=Disabled
amken_bunny.menu.profile.Disabled.build.flags.profile=
amken_bunny.menu.profile.Enabled=Enabled
amken_bunny.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
amken_bunny.menu.rtti.Disabled=Disabled
amken_bunny.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
amken_bunny.menu.rtti.Enabled=Enabled
amken_bunny.menu.rtti.Enabled.build.flags.rtti=
amken_bunny.menu.stackprotect.Disabled=Disabled
amken_bunny.menu.stackprotect.Disabled.build.flags.stackprotect=
amken_bunny.menu.stackprotect.Enabled=Enabled
amken_bunny.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
amken_bunny.menu.exceptions.Disabled=Disabled
