earlephilhower/arduino-pico/boards.txt
amken_bunny.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
amken_bunny.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
amken_bunny.menu.exceptions.Enabled=Enabled
amken_bunny.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
amken_bunny.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
amken_bunny.menu.dbgport.Disabled=Disabled
amken_bunny.menu.dbgport.Disabled.build.debug_port=
amken_bunny.menu.dbgport.Serial=Serial
amken_bunny.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
amken_bunny.menu.dbgport.Serial1=Serial1
amken_bunny.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
amken_bunny.menu.dbgport.Serial2=Serial2
amken_bunny.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
amken_bunny.menu.dbgport.SerialSemi=SerialSemi
amken_bunny.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
amken_bunny.menu.dbglvl.None=None
amken_bunny.menu.dbglvl.None.build.debug_level=
amken_bunny.menu.dbglvl.Core=Core
amken_bunny.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
amken_bunny.menu.dbglvl.SPI=SPI
amken_bunny.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
amken_bunny.menu.dbglvl.Wire=Wire
amken_bunny.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
amken_bunny.menu.dbglvl.Bluetooth=Bluetooth
amken_bunny.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
amken_bunny.menu.dbglvl.All=All
amken_bunny.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
amken_bunny.menu.dbglvl.NDEBUG=NDEBUG
amken_bunny.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
amken_bunny.menu.usbstack.picosdk=Pico SDK
amken_bunny.menu.usbstack.picosdk.build.usbstack_flags=
amken_bunny.menu.usbstack.tinyusb=Adafruit TinyUSB
amken_bunny.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_bunny.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
amken_bunny.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_bunny.menu.usbstack.nousb=No USB
amken_bunny.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
amken_bunny.menu.ipbtstack.ipv4only=IPv4 Only
amken_bunny.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
amken_bunny.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
amken_bunny.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
amken_bunny.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
amken_bunny.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
amken_bunny.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
amken_bunny.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
amken_bunny.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_bunny.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
amken_bunny.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
amken_bunny.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_bunny.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
amken_bunny.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
amken_bunny.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
amken_bunny.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
amken_bunny.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
amken_bunny.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
amken_bunny.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
amken_bunny.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
amken_bunny.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.uploadmethod.default=Default (UF2)
amken_bunny.menu.uploadmethod.default.build.ram_length=256k
amken_bunny.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
amken_bunny.menu.uploadmethod.default.upload.maximum_data_size=262144
amken_bunny.menu.uploadmethod.default.upload.tool=uf2conv
amken_bunny.menu.uploadmethod.default.upload.tool.default=uf2conv
amken_bunny.menu.uploadmethod.default.upload.tool.network=uf2conv-network
amken_bunny.menu.uploadmethod.picotool=Picotool
amken_bunny.menu.uploadmethod.picotool.build.ram_length=256k
amken_bunny.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
amken_bunny.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
amken_bunny.menu.uploadmethod.picotool.upload.maximum_data_size=262144
amken_bunny.menu.uploadmethod.picotool.upload.tool=picotool
amken_bunny.menu.uploadmethod.picotool.upload.tool.default=picotool
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Amken Revelop
# -----------------------------------
amken_revelop.name=Amken Revelop
amken_revelop.vid.0=0x2770
amken_revelop.pid.0=0x7304
amken_revelop.upload_port.0.vid=0x2770
amken_revelop.upload_port.0.pid=0x7304
amken_revelop.build.usbvid=-DUSBD_VID=0x2770
amken_revelop.build.usbpid=-DUSBD_PID=0x7304
amken_revelop.build.usbpwr=-DUSBD_MAX_POWER_MA=250
amken_revelop.build.board=AMKEN_REVELOP
amken_revelop.build.mcu=cortex-m0plus
amken_revelop.build.chip=rp2040
amken_revelop.build.toolchain=arm-none-eabi
amken_revelop.build.toolchainpkg=pqt-gcc
amken_revelop.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
amken_revelop.build.uf2family=--family rp2040
amken_revelop.build.variant=amken_revelop
amken_revelop.upload.maximum_size=33554432
amken_revelop.upload.wait_for_upload_port=true
amken_revelop.upload.erase_cmd=
amken_revelop.serial.disableDTR=false
amken_revelop.serial.disableRTS=false
amken_revelop.build.f_cpu=125000000
amken_revelop.build.led=
amken_revelop.build.core=rp2040
amken_revelop.build.ldscript=memmap_default.ld
amken_revelop.build.boot2=boot2_W25Q32JVxQ_4_padded_checksum
amken_revelop.build.usb_manufacturer="Amken"
amken_revelop.build.usb_product="Revelop"
amken_revelop.build.extra_flags=
amken_revelop.menu.flash.33554432_0=32MB (no FS)
amken_revelop.menu.flash.33554432_0.upload.maximum_size=33550336
amken_revelop.menu.flash.33554432_0.build.flash_total=33554432
amken_revelop.menu.flash.33554432_0.build.flash_length=33550336
amken_revelop.menu.flash.33554432_0.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_0.build.fs_start=301985792
amken_revelop.menu.flash.33554432_0.build.fs_end=301985792
amken_revelop.menu.flash.33554432_65536=32MB (Sketch: 32704KB, FS: 64KB)
amken_revelop.menu.flash.33554432_65536.upload.maximum_size=33484800
amken_revelop.menu.flash.33554432_65536.build.flash_total=33554432
amken_revelop.menu.flash.33554432_65536.build.flash_length=33484800
amken_revelop.menu.flash.33554432_65536.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_65536.build.fs_start=301920256
amken_revelop.menu.flash.33554432_65536.build.fs_end=301985792
amken_revelop.menu.flash.33554432_131072=32MB (Sketch: 32640KB, FS: 128KB)
amken_revelop.menu.flash.33554432_131072.upload.maximum_size=33419264
amken_revelop.menu.flash.33554432_131072.build.flash_total=33554432
amken_revelop.menu.flash.33554432_131072.build.flash_length=33419264
amken_revelop.menu.flash.33554432_131072.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_131072.build.fs_start=301854720
amken_revelop.menu.flash.33554432_131072.build.fs_end=301985792
amken_revelop.menu.flash.33554432_262144=32MB (Sketch: 32512KB, FS: 256KB)
amken_revelop.menu.flash.33554432_262144.upload.maximum_size=33288192
amken_revelop.menu.flash.33554432_262144.build.flash_total=33554432
amken_revelop.menu.flash.33554432_262144.build.flash_length=33288192
amken_revelop.menu.flash.33554432_262144.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_262144.build.fs_start=301723648
amken_revelop.menu.flash.33554432_262144.build.fs_end=301985792
amken_revelop.menu.flash.33554432_524288=32MB (Sketch: 32256KB, FS: 512KB)
amken_revelop.menu.flash.33554432_524288.upload.maximum_size=33026048
amken_revelop.menu.flash.33554432_524288.build.flash_total=33554432
amken_revelop.menu.flash.33554432_524288.build.flash_length=33026048
amken_revelop.menu.flash.33554432_524288.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_524288.build.fs_start=301461504
amken_revelop.menu.flash.33554432_524288.build.fs_end=301985792
amken_revelop.menu.flash.33554432_1048576=32MB (Sketch: 31MB, FS: 1MB)
amken_revelop.menu.flash.33554432_1048576.upload.maximum_size=32501760
amken_revelop.menu.flash.33554432_1048576.build.flash_total=33554432
amken_revelop.menu.flash.33554432_1048576.build.flash_length=32501760
amken_revelop.menu.flash.33554432_1048576.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_1048576.build.fs_start=300937216
amken_revelop.menu.flash.33554432_1048576.build.fs_end=301985792
amken_revelop.menu.flash.33554432_2097152=32MB (Sketch: 30MB, FS: 2MB)
amken_revelop.menu.flash.33554432_2097152.upload.maximum_size=31453184
amken_revelop.menu.flash.33554432_2097152.build.flash_total=33554432
amken_revelop.menu.flash.33554432_2097152.build.flash_length=31453184
amken_revelop.menu.flash.33554432_2097152.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_2097152.build.fs_start=299888640
amken_revelop.menu.flash.33554432_2097152.build.fs_end=301985792
amken_revelop.menu.flash.33554432_3145728=32MB (Sketch: 29MB, FS: 3MB)
amken_revelop.menu.flash.33554432_3145728.upload.maximum_size=30404608
amken_revelop.menu.flash.33554432_3145728.build.flash_total=33554432
amken_revelop.menu.flash.33554432_3145728.build.flash_length=30404608
amken_revelop.menu.flash.33554432_3145728.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_3145728.build.fs_start=298840064
amken_revelop.menu.flash.33554432_3145728.build.fs_end=301985792
amken_revelop.menu.flash.33554432_4194304=32MB (Sketch: 28MB, FS: 4MB)
amken_revelop.menu.flash.33554432_4194304.upload.maximum_size=29356032
amken_revelop.menu.flash.33554432_4194304.build.flash_total=33554432
amken_revelop.menu.flash.33554432_4194304.build.flash_length=29356032
amken_revelop.menu.flash.33554432_4194304.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_4194304.build.fs_start=297791488
amken_revelop.menu.flash.33554432_4194304.build.fs_end=301985792
amken_revelop.menu.flash.33554432_5242880=32MB (Sketch: 27MB, FS: 5MB)
amken_revelop.menu.flash.33554432_5242880.upload.maximum_size=28307456
amken_revelop.menu.flash.33554432_5242880.build.flash_total=33554432
amken_revelop.menu.flash.33554432_5242880.build.flash_length=28307456
amken_revelop.menu.flash.33554432_5242880.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_5242880.build.fs_start=296742912
amken_revelop.menu.flash.33554432_5242880.build.fs_end=301985792
amken_revelop.menu.flash.33554432_6291456=32MB (Sketch: 26MB, FS: 6MB)
amken_revelop.menu.flash.33554432_6291456.upload.maximum_size=27258880
amken_revelop.menu.flash.33554432_6291456.build.flash_total=33554432
amken_revelop.menu.flash.33554432_6291456.build.flash_length=27258880
amken_revelop.menu.flash.33554432_6291456.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_6291456.build.fs_start=295694336
amken_revelop.menu.flash.33554432_6291456.build.fs_end=301985792
amken_revelop.menu.flash.33554432_7340032=32MB (Sketch: 25MB, FS: 7MB)
amken_revelop.menu.flash.33554432_7340032.upload.maximum_size=26210304
amken_revelop.menu.flash.33554432_7340032.build.flash_total=33554432
amken_revelop.menu.flash.33554432_7340032.build.flash_length=26210304
amken_revelop.menu.flash.33554432_7340032.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_7340032.build.fs_start=294645760
amken_revelop.menu.flash.33554432_7340032.build.fs_end=301985792
amken_revelop.menu.flash.33554432_8388608=32MB (Sketch: 24MB, FS: 8MB)
amken_revelop.menu.flash.33554432_8388608.upload.maximum_size=25161728
amken_revelop.menu.flash.33554432_8388608.build.flash_total=33554432
amken_revelop.menu.flash.33554432_8388608.build.flash_length=25161728
amken_revelop.menu.flash.33554432_8388608.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_8388608.build.fs_start=293597184
amken_revelop.menu.flash.33554432_8388608.build.fs_end=301985792
amken_revelop.menu.flash.33554432_9437184=32MB (Sketch: 23MB, FS: 9MB)
amken_revelop.menu.flash.33554432_9437184.upload.maximum_size=24113152
amken_revelop.menu.flash.33554432_9437184.build.flash_total=33554432
amken_revelop.menu.flash.33554432_9437184.build.flash_length=24113152
amken_revelop.menu.flash.33554432_9437184.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_9437184.build.fs_start=292548608
amken_revelop.menu.flash.33554432_9437184.build.fs_end=301985792
amken_revelop.menu.flash.33554432_10485760=32MB (Sketch: 22MB, FS: 10MB)
amken_revelop.menu.flash.33554432_10485760.upload.maximum_size=23064576
amken_revelop.menu.flash.33554432_10485760.build.flash_total=33554432
amken_revelop.menu.flash.33554432_10485760.build.flash_length=23064576
amken_revelop.menu.flash.33554432_10485760.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_10485760.build.fs_start=291500032
amken_revelop.menu.flash.33554432_10485760.build.fs_end=301985792
amken_revelop.menu.flash.33554432_11534336=32MB (Sketch: 21MB, FS: 11MB)
amken_revelop.menu.flash.33554432_11534336.upload.maximum_size=22016000
amken_revelop.menu.flash.33554432_11534336.build.flash_total=33554432
amken_revelop.menu.flash.33554432_11534336.build.flash_length=22016000
amken_revelop.menu.flash.33554432_11534336.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_11534336.build.fs_start=290451456
amken_revelop.menu.flash.33554432_11534336.build.fs_end=301985792
amken_revelop.menu.flash.33554432_12582912=32MB (Sketch: 20MB, FS: 12MB)
amken_revelop.menu.flash.33554432_12582912.upload.maximum_size=20967424
amken_revelop.menu.flash.33554432_12582912.build.flash_total=33554432
amken_revelop.menu.flash.33554432_12582912.build.flash_length=20967424
amken_revelop.menu.flash.33554432_12582912.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_12582912.build.fs_start=289402880
amken_revelop.menu.flash.33554432_12582912.build.fs_end=301985792
amken_revelop.menu.flash.33554432_13631488=32MB (Sketch: 19MB, FS: 13MB)
amken_revelop.menu.flash.33554432_13631488.upload.maximum_size=19918848
amken_revelop.menu.flash.33554432_13631488.build.flash_total=33554432
amken_revelop.menu.flash.33554432_13631488.build.flash_length=19918848
amken_revelop.menu.flash.33554432_13631488.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_13631488.build.fs_start=288354304
amken_revelop.menu.flash.33554432_13631488.build.fs_end=301985792
amken_revelop.menu.flash.33554432_14680064=32MB (Sketch: 18MB, FS: 14MB)
amken_revelop.menu.flash.33554432_14680064.upload.maximum_size=18870272
amken_revelop.menu.flash.33554432_14680064.build.flash_total=33554432
amken_revelop.menu.flash.33554432_14680064.build.flash_length=18870272
amken_revelop.menu.flash.33554432_14680064.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_14680064.build.fs_start=287305728
amken_revelop.menu.flash.33554432_14680064.build.fs_end=301985792
amken_revelop.menu.flash.33554432_15728640=32MB (Sketch: 17MB, FS: 15MB)
amken_revelop.menu.flash.33554432_15728640.upload.maximum_size=17821696
amken_revelop.menu.flash.33554432_15728640.build.flash_total=33554432
amken_revelop.menu.flash.33554432_15728640.build.flash_length=17821696
amken_revelop.menu.flash.33554432_15728640.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_15728640.build.fs_start=286257152
amken_revelop.menu.flash.33554432_15728640.build.fs_end=301985792
amken_revelop.menu.flash.33554432_16777216=32MB (Sketch: 16MB, FS: 16MB)
amken_revelop.menu.flash.33554432_16777216.upload.maximum_size=16773120
amken_revelop.menu.flash.33554432_16777216.build.flash_total=33554432
amken_revelop.menu.flash.33554432_16777216.build.flash_length=16773120
amken_revelop.menu.flash.33554432_16777216.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_16777216.build.fs_start=285208576
amken_revelop.menu.flash.33554432_16777216.build.fs_end=301985792
amken_revelop.menu.flash.33554432_17825792=32MB (Sketch: 15MB, FS: 17MB)
amken_revelop.menu.flash.33554432_17825792.upload.maximum_size=15724544
amken_revelop.menu.flash.33554432_17825792.build.flash_total=33554432
amken_revelop.menu.flash.33554432_17825792.build.flash_length=15724544
amken_revelop.menu.flash.33554432_17825792.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_17825792.build.fs_start=284160000
amken_revelop.menu.flash.33554432_17825792.build.fs_end=301985792
amken_revelop.menu.flash.33554432_18874368=32MB (Sketch: 14MB, FS: 18MB)
amken_revelop.menu.flash.33554432_18874368.upload.maximum_size=14675968
amken_revelop.menu.flash.33554432_18874368.build.flash_total=33554432
amken_revelop.menu.flash.33554432_18874368.build.flash_length=14675968
amken_revelop.menu.flash.33554432_18874368.build.eeprom_start=301985792
