earlephilhower/arduino-pico/boards.txt
amken_revelop.menu.flash.33554432_18874368.build.fs_start=283111424
amken_revelop.menu.flash.33554432_18874368.build.fs_end=301985792
amken_revelop.menu.flash.33554432_19922944=32MB (Sketch: 13MB, FS: 19MB)
amken_revelop.menu.flash.33554432_19922944.upload.maximum_size=13627392
amken_revelop.menu.flash.33554432_19922944.build.flash_total=33554432
amken_revelop.menu.flash.33554432_19922944.build.flash_length=13627392
amken_revelop.menu.flash.33554432_19922944.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_19922944.build.fs_start=282062848
amken_revelop.menu.flash.33554432_19922944.build.fs_end=301985792
amken_revelop.menu.flash.33554432_20971520=32MB (Sketch: 12MB, FS: 20MB)
amken_revelop.menu.flash.33554432_20971520.upload.maximum_size=12578816
amken_revelop.menu.flash.33554432_20971520.build.flash_total=33554432
amken_revelop.menu.flash.33554432_20971520.build.flash_length=12578816
amken_revelop.menu.flash.33554432_20971520.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_20971520.build.fs_start=281014272
amken_revelop.menu.flash.33554432_20971520.build.fs_end=301985792
amken_revelop.menu.flash.33554432_22020096=32MB (Sketch: 11MB, FS: 21MB)
amken_revelop.menu.flash.33554432_22020096.upload.maximum_size=11530240
amken_revelop.menu.flash.33554432_22020096.build.flash_total=33554432
amken_revelop.menu.flash.33554432_22020096.build.flash_length=11530240
amken_revelop.menu.flash.33554432_22020096.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_22020096.build.fs_start=279965696
amken_revelop.menu.flash.33554432_22020096.build.fs_end=301985792
amken_revelop.menu.flash.33554432_23068672=32MB (Sketch: 10MB, FS: 22MB)
amken_revelop.menu.flash.33554432_23068672.upload.maximum_size=10481664
amken_revelop.menu.flash.33554432_23068672.build.flash_total=33554432
amken_revelop.menu.flash.33554432_23068672.build.flash_length=10481664
amken_revelop.menu.flash.33554432_23068672.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_23068672.build.fs_start=278917120
amken_revelop.menu.flash.33554432_23068672.build.fs_end=301985792
amken_revelop.menu.flash.33554432_24117248=32MB (Sketch: 9MB, FS: 23MB)
amken_revelop.menu.flash.33554432_24117248.upload.maximum_size=9433088
amken_revelop.menu.flash.33554432_24117248.build.flash_total=33554432
amken_revelop.menu.flash.33554432_24117248.build.flash_length=9433088
amken_revelop.menu.flash.33554432_24117248.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_24117248.build.fs_start=277868544
amken_revelop.menu.flash.33554432_24117248.build.fs_end=301985792
amken_revelop.menu.flash.33554432_25165824=32MB (Sketch: 8MB, FS: 24MB)
amken_revelop.menu.flash.33554432_25165824.upload.maximum_size=8384512
amken_revelop.menu.flash.33554432_25165824.build.flash_total=33554432
amken_revelop.menu.flash.33554432_25165824.build.flash_length=8384512
amken_revelop.menu.flash.33554432_25165824.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_25165824.build.fs_start=276819968
amken_revelop.menu.flash.33554432_25165824.build.fs_end=301985792
amken_revelop.menu.flash.33554432_26214400=32MB (Sketch: 7MB, FS: 25MB)
amken_revelop.menu.flash.33554432_26214400.upload.maximum_size=7335936
amken_revelop.menu.flash.33554432_26214400.build.flash_total=33554432
amken_revelop.menu.flash.33554432_26214400.build.flash_length=7335936
amken_revelop.menu.flash.33554432_26214400.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_26214400.build.fs_start=275771392
amken_revelop.menu.flash.33554432_26214400.build.fs_end=301985792
amken_revelop.menu.flash.33554432_27262976=32MB (Sketch: 6MB, FS: 26MB)
amken_revelop.menu.flash.33554432_27262976.upload.maximum_size=6287360
amken_revelop.menu.flash.33554432_27262976.build.flash_total=33554432
amken_revelop.menu.flash.33554432_27262976.build.flash_length=6287360
amken_revelop.menu.flash.33554432_27262976.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_27262976.build.fs_start=274722816
amken_revelop.menu.flash.33554432_27262976.build.fs_end=301985792
amken_revelop.menu.flash.33554432_28311552=32MB (Sketch: 5MB, FS: 27MB)
amken_revelop.menu.flash.33554432_28311552.upload.maximum_size=5238784
amken_revelop.menu.flash.33554432_28311552.build.flash_total=33554432
amken_revelop.menu.flash.33554432_28311552.build.flash_length=5238784
amken_revelop.menu.flash.33554432_28311552.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_28311552.build.fs_start=273674240
amken_revelop.menu.flash.33554432_28311552.build.fs_end=301985792
amken_revelop.menu.flash.33554432_29360128=32MB (Sketch: 4MB, FS: 28MB)
amken_revelop.menu.flash.33554432_29360128.upload.maximum_size=4190208
amken_revelop.menu.flash.33554432_29360128.build.flash_total=33554432
amken_revelop.menu.flash.33554432_29360128.build.flash_length=4190208
amken_revelop.menu.flash.33554432_29360128.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_29360128.build.fs_start=272625664
amken_revelop.menu.flash.33554432_29360128.build.fs_end=301985792
amken_revelop.menu.flash.33554432_30408704=32MB (Sketch: 3MB, FS: 29MB)
amken_revelop.menu.flash.33554432_30408704.upload.maximum_size=3141632
amken_revelop.menu.flash.33554432_30408704.build.flash_total=33554432
amken_revelop.menu.flash.33554432_30408704.build.flash_length=3141632
amken_revelop.menu.flash.33554432_30408704.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_30408704.build.fs_start=271577088
amken_revelop.menu.flash.33554432_30408704.build.fs_end=301985792
amken_revelop.menu.flash.33554432_31457280=32MB (Sketch: 2MB, FS: 30MB)
amken_revelop.menu.flash.33554432_31457280.upload.maximum_size=2093056
amken_revelop.menu.flash.33554432_31457280.build.flash_total=33554432
amken_revelop.menu.flash.33554432_31457280.build.flash_length=2093056
amken_revelop.menu.flash.33554432_31457280.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_31457280.build.fs_start=270528512
amken_revelop.menu.flash.33554432_31457280.build.fs_end=301985792
amken_revelop.menu.flash.33554432_32505856=32MB (Sketch: 1MB, FS: 31MB)
amken_revelop.menu.flash.33554432_32505856.upload.maximum_size=1044480
amken_revelop.menu.flash.33554432_32505856.build.flash_total=33554432
amken_revelop.menu.flash.33554432_32505856.build.flash_length=1044480
amken_revelop.menu.flash.33554432_32505856.build.eeprom_start=301985792
amken_revelop.menu.flash.33554432_32505856.build.fs_start=269479936
amken_revelop.menu.flash.33554432_32505856.build.fs_end=301985792
amken_revelop.menu.freq.200=200 MHz
amken_revelop.menu.freq.200.build.f_cpu=200000000L
amken_revelop.menu.freq.50=50 MHz
amken_revelop.menu.freq.50.build.f_cpu=50000000L
amken_revelop.menu.freq.100=100 MHz
amken_revelop.menu.freq.100.build.f_cpu=100000000L
amken_revelop.menu.freq.120=120 MHz
amken_revelop.menu.freq.120.build.f_cpu=120000000L
amken_revelop.menu.freq.125=125 MHz
amken_revelop.menu.freq.125.build.f_cpu=125000000L
amken_revelop.menu.freq.128=128 MHz
amken_revelop.menu.freq.128.build.f_cpu=128000000L
amken_revelop.menu.freq.133=133 MHz
amken_revelop.menu.freq.133.build.f_cpu=133000000L
amken_revelop.menu.freq.150=150 MHz
amken_revelop.menu.freq.150.build.f_cpu=150000000L
amken_revelop.menu.freq.176=176 MHz
amken_revelop.menu.freq.176.build.f_cpu=176000000L
amken_revelop.menu.freq.225=225 MHz (Overclock)
amken_revelop.menu.freq.225.build.f_cpu=225000000L
amken_revelop.menu.freq.240=240 MHz (Overclock)
amken_revelop.menu.freq.240.build.f_cpu=240000000L
amken_revelop.menu.freq.250=250 MHz (Overclock)
amken_revelop.menu.freq.250.build.f_cpu=250000000L
amken_revelop.menu.freq.276=276 MHz (Overclock)
amken_revelop.menu.freq.276.build.f_cpu=276000000L
amken_revelop.menu.freq.300=300 MHz (Overclock)
amken_revelop.menu.freq.300.build.f_cpu=300000000L
amken_revelop.menu.opt.Small=Small (-Os) (standard)
amken_revelop.menu.opt.Small.build.flags.optimize=-Os
amken_revelop.menu.opt.Optimize=Optimize (-O)
amken_revelop.menu.opt.Optimize.build.flags.optimize=-O
amken_revelop.menu.opt.Optimize2=Optimize More (-O2)
amken_revelop.menu.opt.Optimize2.build.flags.optimize=-O2
amken_revelop.menu.opt.Optimize3=Optimize Even More (-O3)
amken_revelop.menu.opt.Optimize3.build.flags.optimize=-O3
amken_revelop.menu.opt.Fast=Fast (-Ofast) (maybe slower)
amken_revelop.menu.opt.Fast.build.flags.optimize=-Ofast
amken_revelop.menu.opt.Debug=Debug (-Og)
amken_revelop.menu.opt.Debug.build.flags.optimize=-Og
amken_revelop.menu.opt.Disabled=Disabled (-O0)
amken_revelop.menu.opt.Disabled.build.flags.optimize=-O0
amken_revelop.menu.profile.Disabled=Disabled
amken_revelop.menu.profile.Disabled.build.flags.profile=
amken_revelop.menu.profile.Enabled=Enabled
amken_revelop.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
amken_revelop.menu.rtti.Disabled=Disabled
amken_revelop.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
amken_revelop.menu.rtti.Enabled=Enabled
amken_revelop.menu.rtti.Enabled.build.flags.rtti=
amken_revelop.menu.stackprotect.Disabled=Disabled
amken_revelop.menu.stackprotect.Disabled.build.flags.stackprotect=
amken_revelop.menu.stackprotect.Enabled=Enabled
amken_revelop.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
amken_revelop.menu.exceptions.Disabled=Disabled
amken_revelop.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
amken_revelop.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
amken_revelop.menu.exceptions.Enabled=Enabled
amken_revelop.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
amken_revelop.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
amken_revelop.menu.dbgport.Disabled=Disabled
amken_revelop.menu.dbgport.Disabled.build.debug_port=
amken_revelop.menu.dbgport.Serial=Serial
amken_revelop.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
amken_revelop.menu.dbgport.Serial1=Serial1
amken_revelop.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
amken_revelop.menu.dbgport.Serial2=Serial2
amken_revelop.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
amken_revelop.menu.dbgport.SerialSemi=SerialSemi
amken_revelop.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
amken_revelop.menu.dbglvl.None=None
amken_revelop.menu.dbglvl.None.build.debug_level=
amken_revelop.menu.dbglvl.Core=Core
amken_revelop.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
amken_revelop.menu.dbglvl.SPI=SPI
amken_revelop.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
amken_revelop.menu.dbglvl.Wire=Wire
amken_revelop.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
amken_revelop.menu.dbglvl.Bluetooth=Bluetooth
amken_revelop.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
amken_revelop.menu.dbglvl.All=All
amken_revelop.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
amken_revelop.menu.dbglvl.NDEBUG=NDEBUG
amken_revelop.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
amken_revelop.menu.usbstack.picosdk=Pico SDK
amken_revelop.menu.usbstack.picosdk.build.usbstack_flags=
amken_revelop.menu.usbstack.tinyusb=Adafruit TinyUSB
amken_revelop.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_revelop.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
amken_revelop.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_revelop.menu.usbstack.nousb=No USB
amken_revelop.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
amken_revelop.menu.ipbtstack.ipv4only=IPv4 Only
amken_revelop.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
amken_revelop.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
amken_revelop.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
amken_revelop.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
amken_revelop.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
amken_revelop.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
amken_revelop.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
amken_revelop.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_revelop.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
amken_revelop.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
amken_revelop.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_revelop.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
amken_revelop.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
amken_revelop.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_revelop.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
amken_revelop.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
amken_revelop.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_revelop.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
amken_revelop.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
amken_revelop.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_revelop.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
amken_revelop.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
amken_revelop.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_revelop.menu.uploadmethod.default=Default (UF2)
amken_revelop.menu.uploadmethod.default.build.ram_length=256k
amken_revelop.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
amken_revelop.menu.uploadmethod.default.upload.maximum_data_size=262144
amken_revelop.menu.uploadmethod.default.upload.tool=uf2conv
amken_revelop.menu.uploadmethod.default.upload.tool.default=uf2conv
amken_revelop.menu.uploadmethod.default.upload.tool.network=uf2conv-network
amken_revelop.menu.uploadmethod.picotool=Picotool
amken_revelop.menu.uploadmethod.picotool.build.ram_length=256k
amken_revelop.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
amken_revelop.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
amken_revelop.menu.uploadmethod.picotool.upload.maximum_data_size=262144
amken_revelop.menu.uploadmethod.picotool.upload.tool=picotool
amken_revelop.menu.uploadmethod.picotool.upload.tool.default=picotool
amken_revelop.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
amken_revelop.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
amken_revelop.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
amken_revelop.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
amken_revelop.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
amken_revelop.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

