earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Amken Revelop Plus
# -----------------------------------
amken_revelop_plus.name=Amken Revelop Plus
amken_revelop_plus.vid.0=0x2770
amken_revelop_plus.pid.0=0x7305
amken_revelop_plus.upload_port.0.vid=0x2770
amken_revelop_plus.upload_port.0.pid=0x7305
amken_revelop_plus.build.usbvid=-DUSBD_VID=0x2770
amken_revelop_plus.build.usbpid=-DUSBD_PID=0x7305
amken_revelop_plus.build.usbpwr=-DUSBD_MAX_POWER_MA=250
amken_revelop_plus.build.board=AMKEN_REVELOP_PLUS
amken_revelop_plus.build.mcu=cortex-m0plus
amken_revelop_plus.build.chip=rp2040
amken_revelop_plus.build.toolchain=arm-none-eabi
amken_revelop_plus.build.toolchainpkg=pqt-gcc
amken_revelop_plus.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
amken_revelop_plus.build.uf2family=--family rp2040
amken_revelop_plus.build.variant=amken_revelop_plus
amken_revelop_plus.upload.maximum_size=33554432
amken_revelop_plus.upload.wait_for_upload_port=true
amken_revelop_plus.upload.erase_cmd=
amken_revelop_plus.serial.disableDTR=false
amken_revelop_plus.serial.disableRTS=false
amken_revelop_plus.build.f_cpu=125000000
amken_revelop_plus.build.led=
amken_revelop_plus.build.core=rp2040
amken_revelop_plus.build.ldscript=memmap_default.ld
amken_revelop_plus.build.boot2=boot2_W25Q32JVxQ_4_padded_checksum
amken_revelop_plus.build.usb_manufacturer="Amken"
amken_revelop_plus.build.usb_product="Revelop Plus"
amken_revelop_plus.build.extra_flags=
amken_revelop_plus.menu.flash.33554432_0=32MB (no FS)
amken_revelop_plus.menu.flash.33554432_0.upload.maximum_size=33550336
amken_revelop_plus.menu.flash.33554432_0.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_0.build.flash_length=33550336
amken_revelop_plus.menu.flash.33554432_0.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_0.build.fs_start=301985792
amken_revelop_plus.menu.flash.33554432_0.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_65536=32MB (Sketch: 32704KB, FS: 64KB)
amken_revelop_plus.menu.flash.33554432_65536.upload.maximum_size=33484800
amken_revelop_plus.menu.flash.33554432_65536.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_65536.build.flash_length=33484800
amken_revelop_plus.menu.flash.33554432_65536.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_65536.build.fs_start=301920256
amken_revelop_plus.menu.flash.33554432_65536.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_131072=32MB (Sketch: 32640KB, FS: 128KB)
amken_revelop_plus.menu.flash.33554432_131072.upload.maximum_size=33419264
amken_revelop_plus.menu.flash.33554432_131072.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_131072.build.flash_length=33419264
amken_revelop_plus.menu.flash.33554432_131072.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_131072.build.fs_start=301854720
amken_revelop_plus.menu.flash.33554432_131072.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_262144=32MB (Sketch: 32512KB, FS: 256KB)
amken_revelop_plus.menu.flash.33554432_262144.upload.maximum_size=33288192
amken_revelop_plus.menu.flash.33554432_262144.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_262144.build.flash_length=33288192
amken_revelop_plus.menu.flash.33554432_262144.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_262144.build.fs_start=301723648
amken_revelop_plus.menu.flash.33554432_262144.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_524288=32MB (Sketch: 32256KB, FS: 512KB)
amken_revelop_plus.menu.flash.33554432_524288.upload.maximum_size=33026048
amken_revelop_plus.menu.flash.33554432_524288.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_524288.build.flash_length=33026048
amken_revelop_plus.menu.flash.33554432_524288.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_524288.build.fs_start=301461504
amken_revelop_plus.menu.flash.33554432_524288.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_1048576=32MB (Sketch: 31MB, FS: 1MB)
amken_revelop_plus.menu.flash.33554432_1048576.upload.maximum_size=32501760
amken_revelop_plus.menu.flash.33554432_1048576.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_1048576.build.flash_length=32501760
amken_revelop_plus.menu.flash.33554432_1048576.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_1048576.build.fs_start=300937216
amken_revelop_plus.menu.flash.33554432_1048576.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_2097152=32MB (Sketch: 30MB, FS: 2MB)
amken_revelop_plus.menu.flash.33554432_2097152.upload.maximum_size=31453184
amken_revelop_plus.menu.flash.33554432_2097152.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_2097152.build.flash_length=31453184
amken_revelop_plus.menu.flash.33554432_2097152.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_2097152.build.fs_start=299888640
amken_revelop_plus.menu.flash.33554432_2097152.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_3145728=32MB (Sketch: 29MB, FS: 3MB)
amken_revelop_plus.menu.flash.33554432_3145728.upload.maximum_size=30404608
amken_revelop_plus.menu.flash.33554432_3145728.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_3145728.build.flash_length=30404608
amken_revelop_plus.menu.flash.33554432_3145728.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_3145728.build.fs_start=298840064
amken_revelop_plus.menu.flash.33554432_3145728.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_4194304=32MB (Sketch: 28MB, FS: 4MB)
amken_revelop_plus.menu.flash.33554432_4194304.upload.maximum_size=29356032
amken_revelop_plus.menu.flash.33554432_4194304.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_4194304.build.flash_length=29356032
amken_revelop_plus.menu.flash.33554432_4194304.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_4194304.build.fs_start=297791488
amken_revelop_plus.menu.flash.33554432_4194304.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_5242880=32MB (Sketch: 27MB, FS: 5MB)
amken_revelop_plus.menu.flash.33554432_5242880.upload.maximum_size=28307456
amken_revelop_plus.menu.flash.33554432_5242880.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_5242880.build.flash_length=28307456
amken_revelop_plus.menu.flash.33554432_5242880.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_5242880.build.fs_start=296742912
amken_revelop_plus.menu.flash.33554432_5242880.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_6291456=32MB (Sketch: 26MB, FS: 6MB)
amken_revelop_plus.menu.flash.33554432_6291456.upload.maximum_size=27258880
amken_revelop_plus.menu.flash.33554432_6291456.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_6291456.build.flash_length=27258880
amken_revelop_plus.menu.flash.33554432_6291456.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_6291456.build.fs_start=295694336
amken_revelop_plus.menu.flash.33554432_6291456.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_7340032=32MB (Sketch: 25MB, FS: 7MB)
amken_revelop_plus.menu.flash.33554432_7340032.upload.maximum_size=26210304
amken_revelop_plus.menu.flash.33554432_7340032.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_7340032.build.flash_length=26210304
amken_revelop_plus.menu.flash.33554432_7340032.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_7340032.build.fs_start=294645760
amken_revelop_plus.menu.flash.33554432_7340032.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_8388608=32MB (Sketch: 24MB, FS: 8MB)
amken_revelop_plus.menu.flash.33554432_8388608.upload.maximum_size=25161728
amken_revelop_plus.menu.flash.33554432_8388608.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_8388608.build.flash_length=25161728
amken_revelop_plus.menu.flash.33554432_8388608.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_8388608.build.fs_start=293597184
amken_revelop_plus.menu.flash.33554432_8388608.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_9437184=32MB (Sketch: 23MB, FS: 9MB)
amken_revelop_plus.menu.flash.33554432_9437184.upload.maximum_size=24113152
amken_revelop_plus.menu.flash.33554432_9437184.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_9437184.build.flash_length=24113152
amken_revelop_plus.menu.flash.33554432_9437184.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_9437184.build.fs_start=292548608
amken_revelop_plus.menu.flash.33554432_9437184.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_10485760=32MB (Sketch: 22MB, FS: 10MB)
amken_revelop_plus.menu.flash.33554432_10485760.upload.maximum_size=23064576
amken_revelop_plus.menu.flash.33554432_10485760.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_10485760.build.flash_length=23064576
amken_revelop_plus.menu.flash.33554432_10485760.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_10485760.build.fs_start=291500032
amken_revelop_plus.menu.flash.33554432_10485760.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_11534336=32MB (Sketch: 21MB, FS: 11MB)
amken_revelop_plus.menu.flash.33554432_11534336.upload.maximum_size=22016000
amken_revelop_plus.menu.flash.33554432_11534336.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_11534336.build.flash_length=22016000
amken_revelop_plus.menu.flash.33554432_11534336.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_11534336.build.fs_start=290451456
amken_revelop_plus.menu.flash.33554432_11534336.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_12582912=32MB (Sketch: 20MB, FS: 12MB)
amken_revelop_plus.menu.flash.33554432_12582912.upload.maximum_size=20967424
amken_revelop_plus.menu.flash.33554432_12582912.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_12582912.build.flash_length=20967424
amken_revelop_plus.menu.flash.33554432_12582912.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_12582912.build.fs_start=289402880
amken_revelop_plus.menu.flash.33554432_12582912.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_13631488=32MB (Sketch: 19MB, FS: 13MB)
amken_revelop_plus.menu.flash.33554432_13631488.upload.maximum_size=19918848
amken_revelop_plus.menu.flash.33554432_13631488.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_13631488.build.flash_length=19918848
amken_revelop_plus.menu.flash.33554432_13631488.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_13631488.build.fs_start=288354304
amken_revelop_plus.menu.flash.33554432_13631488.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_14680064=32MB (Sketch: 18MB, FS: 14MB)
amken_revelop_plus.menu.flash.33554432_14680064.upload.maximum_size=18870272
amken_revelop_plus.menu.flash.33554432_14680064.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_14680064.build.flash_length=18870272
amken_revelop_plus.menu.flash.33554432_14680064.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_14680064.build.fs_start=287305728
amken_revelop_plus.menu.flash.33554432_14680064.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_15728640=32MB (Sketch: 17MB, FS: 15MB)
amken_revelop_plus.menu.flash.33554432_15728640.upload.maximum_size=17821696
amken_revelop_plus.menu.flash.33554432_15728640.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_15728640.build.flash_length=17821696
amken_revelop_plus.menu.flash.33554432_15728640.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_15728640.build.fs_start=286257152
amken_revelop_plus.menu.flash.33554432_15728640.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_16777216=32MB (Sketch: 16MB, FS: 16MB)
amken_revelop_plus.menu.flash.33554432_16777216.upload.maximum_size=16773120
amken_revelop_plus.menu.flash.33554432_16777216.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_16777216.build.flash_length=16773120
amken_revelop_plus.menu.flash.33554432_16777216.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_16777216.build.fs_start=285208576
amken_revelop_plus.menu.flash.33554432_16777216.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_17825792=32MB (Sketch: 15MB, FS: 17MB)
amken_revelop_plus.menu.flash.33554432_17825792.upload.maximum_size=15724544
amken_revelop_plus.menu.flash.33554432_17825792.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_17825792.build.flash_length=15724544
amken_revelop_plus.menu.flash.33554432_17825792.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_17825792.build.fs_start=284160000
amken_revelop_plus.menu.flash.33554432_17825792.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_18874368=32MB (Sketch: 14MB, FS: 18MB)
amken_revelop_plus.menu.flash.33554432_18874368.upload.maximum_size=14675968
amken_revelop_plus.menu.flash.33554432_18874368.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_18874368.build.flash_length=14675968
amken_revelop_plus.menu.flash.33554432_18874368.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_18874368.build.fs_start=283111424
amken_revelop_plus.menu.flash.33554432_18874368.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_19922944=32MB (Sketch: 13MB, FS: 19MB)
amken_revelop_plus.menu.flash.33554432_19922944.upload.maximum_size=13627392
amken_revelop_plus.menu.flash.33554432_19922944.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_19922944.build.flash_length=13627392
amken_revelop_plus.menu.flash.33554432_19922944.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_19922944.build.fs_start=282062848
amken_revelop_plus.menu.flash.33554432_19922944.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_20971520=32MB (Sketch: 12MB, FS: 20MB)
amken_revelop_plus.menu.flash.33554432_20971520.upload.maximum_size=12578816
amken_revelop_plus.menu.flash.33554432_20971520.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_20971520.build.flash_length=12578816
amken_revelop_plus.menu.flash.33554432_20971520.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_20971520.build.fs_start=281014272
amken_revelop_plus.menu.flash.33554432_20971520.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_22020096=32MB (Sketch: 11MB, FS: 21MB)
amken_revelop_plus.menu.flash.33554432_22020096.upload.maximum_size=11530240
amken_revelop_plus.menu.flash.33554432_22020096.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_22020096.build.flash_length=11530240
amken_revelop_plus.menu.flash.33554432_22020096.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_22020096.build.fs_start=279965696
amken_revelop_plus.menu.flash.33554432_22020096.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_23068672=32MB (Sketch: 10MB, FS: 22MB)
amken_revelop_plus.menu.flash.33554432_23068672.upload.maximum_size=10481664
amken_revelop_plus.menu.flash.33554432_23068672.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_23068672.build.flash_length=10481664
amken_revelop_plus.menu.flash.33554432_23068672.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_23068672.build.fs_start=278917120
amken_revelop_plus.menu.flash.33554432_23068672.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_24117248=32MB (Sketch: 9MB, FS: 23MB)
amken_revelop_plus.menu.flash.33554432_24117248.upload.maximum_size=9433088
amken_revelop_plus.menu.flash.33554432_24117248.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_24117248.build.flash_length=9433088
amken_revelop_plus.menu.flash.33554432_24117248.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_24117248.build.fs_start=277868544
amken_revelop_plus.menu.flash.33554432_24117248.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_25165824=32MB (Sketch: 8MB, FS: 24MB)
amken_revelop_plus.menu.flash.33554432_25165824.upload.maximum_size=8384512
amken_revelop_plus.menu.flash.33554432_25165824.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_25165824.build.flash_length=8384512
amken_revelop_plus.menu.flash.33554432_25165824.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_25165824.build.fs_start=276819968
amken_revelop_plus.menu.flash.33554432_25165824.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_26214400=32MB (Sketch: 7MB, FS: 25MB)
amken_revelop_plus.menu.flash.33554432_26214400.upload.maximum_size=7335936
amken_revelop_plus.menu.flash.33554432_26214400.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_26214400.build.flash_length=7335936
amken_revelop_plus.menu.flash.33554432_26214400.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_26214400.build.fs_start=275771392
amken_revelop_plus.menu.flash.33554432_26214400.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_27262976=32MB (Sketch: 6MB, FS: 26MB)
amken_revelop_plus.menu.flash.33554432_27262976.upload.maximum_size=6287360
amken_revelop_plus.menu.flash.33554432_27262976.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_27262976.build.flash_length=6287360
amken_revelop_plus.menu.flash.33554432_27262976.build.eeprom_start=301985792
amken_revelop_plus.menu.flash.33554432_27262976.build.fs_start=274722816
amken_revelop_plus.menu.flash.33554432_27262976.build.fs_end=301985792
amken_revelop_plus.menu.flash.33554432_28311552=32MB (Sketch: 5MB, FS: 27MB)
amken_revelop_plus.menu.flash.33554432_28311552.upload.maximum_size=5238784
amken_revelop_plus.menu.flash.33554432_28311552.build.flash_total=33554432
amken_revelop_plus.menu.flash.33554432_28311552.build.flash_length=5238784
amken_revelop_plus.menu.flash.33554432_28311552.build.eeprom_start=301985792
