earlephilhower/arduino-pico/boards.txt
amken_revelop_es.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_revelop_es.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
amken_revelop_es.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
amken_revelop_es.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_revelop_es.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
amken_revelop_es.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
amken_revelop_es.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_revelop_es.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
amken_revelop_es.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
amken_revelop_es.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_revelop_es.menu.uploadmethod.default=Default (UF2)
amken_revelop_es.menu.uploadmethod.default.build.ram_length=256k
amken_revelop_es.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
amken_revelop_es.menu.uploadmethod.default.upload.maximum_data_size=262144
amken_revelop_es.menu.uploadmethod.default.upload.tool=uf2conv
amken_revelop_es.menu.uploadmethod.default.upload.tool.default=uf2conv
amken_revelop_es.menu.uploadmethod.default.upload.tool.network=uf2conv-network
amken_revelop_es.menu.uploadmethod.picotool=Picotool
amken_revelop_es.menu.uploadmethod.picotool.build.ram_length=256k
amken_revelop_es.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
amken_revelop_es.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
amken_revelop_es.menu.uploadmethod.picotool.upload.maximum_data_size=262144
amken_revelop_es.menu.uploadmethod.picotool.upload.tool=picotool
amken_revelop_es.menu.uploadmethod.picotool.upload.tool.default=picotool
amken_revelop_es.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
amken_revelop_es.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
amken_revelop_es.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
amken_revelop_es.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
amken_revelop_es.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
amken_revelop_es.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Architeuthis Flux Jumperless
# -----------------------------------
jumperless_v1.name=Architeuthis Flux Jumperless
jumperless_v1.vid.0=0x1d50
jumperless_v1.pid.0=0xacab
jumperless_v1.vid.1=0x1d50
jumperless_v1.pid.1=0xadab
jumperless_v1.vid.2=0x1d50
jumperless_v1.pid.2=0xecab
jumperless_v1.vid.3=0x1d50
jumperless_v1.pid.3=0xedab
jumperless_v1.upload_port.0.vid=0x1d50
jumperless_v1.upload_port.0.pid=0xacab
jumperless_v1.upload_port.1.vid=0x1d50
jumperless_v1.upload_port.1.pid=0xadab
jumperless_v1.upload_port.2.vid=0x1d50
jumperless_v1.upload_port.2.pid=0xecab
jumperless_v1.upload_port.3.vid=0x1d50
jumperless_v1.upload_port.3.pid=0xedab
jumperless_v1.build.usbvid=-DUSBD_VID=0x1d50
jumperless_v1.build.usbpid=-DUSBD_PID=0xacab
jumperless_v1.build.usbpwr=-DUSBD_MAX_POWER_MA=500
jumperless_v1.build.board=JUMPERLESS
jumperless_v1.build.mcu=cortex-m0plus
jumperless_v1.build.chip=rp2040
jumperless_v1.build.toolchain=arm-none-eabi
jumperless_v1.build.toolchainpkg=pqt-gcc
jumperless_v1.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
jumperless_v1.build.uf2family=--family rp2040
jumperless_v1.build.variant=jumperless_v1
jumperless_v1.upload.maximum_size=16777216
jumperless_v1.upload.wait_for_upload_port=true
jumperless_v1.upload.erase_cmd=
jumperless_v1.serial.disableDTR=false
jumperless_v1.serial.disableRTS=false
jumperless_v1.build.f_cpu=125000000
jumperless_v1.build.led=
jumperless_v1.build.core=rp2040
jumperless_v1.build.ldscript=memmap_default.ld
jumperless_v1.build.boot2=boot2_w25q128jvxq_4_padded_checksum
jumperless_v1.build.usb_manufacturer="Architeuthis Flux"
jumperless_v1.build.usb_product="Jumperless"
jumperless_v1.build.extra_flags=
jumperless_v1.menu.flash.16777216_0=16MB (no FS)
jumperless_v1.menu.flash.16777216_0.upload.maximum_size=16773120
jumperless_v1.menu.flash.16777216_0.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_0.build.flash_length=16773120
jumperless_v1.menu.flash.16777216_0.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_0.build.fs_start=285208576
jumperless_v1.menu.flash.16777216_0.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
jumperless_v1.menu.flash.16777216_65536.upload.maximum_size=16707584
jumperless_v1.menu.flash.16777216_65536.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_65536.build.flash_length=16707584
jumperless_v1.menu.flash.16777216_65536.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_65536.build.fs_start=285143040
jumperless_v1.menu.flash.16777216_65536.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
jumperless_v1.menu.flash.16777216_131072.upload.maximum_size=16642048
jumperless_v1.menu.flash.16777216_131072.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_131072.build.flash_length=16642048
jumperless_v1.menu.flash.16777216_131072.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_131072.build.fs_start=285077504
jumperless_v1.menu.flash.16777216_131072.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
jumperless_v1.menu.flash.16777216_262144.upload.maximum_size=16510976
jumperless_v1.menu.flash.16777216_262144.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_262144.build.flash_length=16510976
jumperless_v1.menu.flash.16777216_262144.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_262144.build.fs_start=284946432
jumperless_v1.menu.flash.16777216_262144.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
jumperless_v1.menu.flash.16777216_524288.upload.maximum_size=16248832
jumperless_v1.menu.flash.16777216_524288.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_524288.build.flash_length=16248832
jumperless_v1.menu.flash.16777216_524288.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_524288.build.fs_start=284684288
jumperless_v1.menu.flash.16777216_524288.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
jumperless_v1.menu.flash.16777216_1048576.upload.maximum_size=15724544
jumperless_v1.menu.flash.16777216_1048576.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_1048576.build.flash_length=15724544
jumperless_v1.menu.flash.16777216_1048576.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_1048576.build.fs_start=284160000
jumperless_v1.menu.flash.16777216_1048576.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
jumperless_v1.menu.flash.16777216_2097152.upload.maximum_size=14675968
jumperless_v1.menu.flash.16777216_2097152.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_2097152.build.flash_length=14675968
jumperless_v1.menu.flash.16777216_2097152.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_2097152.build.fs_start=283111424
jumperless_v1.menu.flash.16777216_2097152.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
jumperless_v1.menu.flash.16777216_3145728.upload.maximum_size=13627392
jumperless_v1.menu.flash.16777216_3145728.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_3145728.build.flash_length=13627392
jumperless_v1.menu.flash.16777216_3145728.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_3145728.build.fs_start=282062848
jumperless_v1.menu.flash.16777216_3145728.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
jumperless_v1.menu.flash.16777216_4194304.upload.maximum_size=12578816
jumperless_v1.menu.flash.16777216_4194304.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_4194304.build.flash_length=12578816
jumperless_v1.menu.flash.16777216_4194304.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_4194304.build.fs_start=281014272
jumperless_v1.menu.flash.16777216_4194304.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
jumperless_v1.menu.flash.16777216_5242880.upload.maximum_size=11530240
jumperless_v1.menu.flash.16777216_5242880.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_5242880.build.flash_length=11530240
jumperless_v1.menu.flash.16777216_5242880.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_5242880.build.fs_start=279965696
jumperless_v1.menu.flash.16777216_5242880.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
jumperless_v1.menu.flash.16777216_6291456.upload.maximum_size=10481664
jumperless_v1.menu.flash.16777216_6291456.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_6291456.build.flash_length=10481664
jumperless_v1.menu.flash.16777216_6291456.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_6291456.build.fs_start=278917120
jumperless_v1.menu.flash.16777216_6291456.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
jumperless_v1.menu.flash.16777216_7340032.upload.maximum_size=9433088
jumperless_v1.menu.flash.16777216_7340032.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_7340032.build.flash_length=9433088
jumperless_v1.menu.flash.16777216_7340032.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_7340032.build.fs_start=277868544
jumperless_v1.menu.flash.16777216_7340032.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
jumperless_v1.menu.flash.16777216_8388608.upload.maximum_size=8384512
jumperless_v1.menu.flash.16777216_8388608.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_8388608.build.flash_length=8384512
jumperless_v1.menu.flash.16777216_8388608.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_8388608.build.fs_start=276819968
jumperless_v1.menu.flash.16777216_8388608.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
jumperless_v1.menu.flash.16777216_9437184.upload.maximum_size=7335936
jumperless_v1.menu.flash.16777216_9437184.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_9437184.build.flash_length=7335936
jumperless_v1.menu.flash.16777216_9437184.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_9437184.build.fs_start=275771392
jumperless_v1.menu.flash.16777216_9437184.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
jumperless_v1.menu.flash.16777216_10485760.upload.maximum_size=6287360
jumperless_v1.menu.flash.16777216_10485760.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_10485760.build.flash_length=6287360
jumperless_v1.menu.flash.16777216_10485760.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_10485760.build.fs_start=274722816
jumperless_v1.menu.flash.16777216_10485760.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
jumperless_v1.menu.flash.16777216_11534336.upload.maximum_size=5238784
jumperless_v1.menu.flash.16777216_11534336.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_11534336.build.flash_length=5238784
jumperless_v1.menu.flash.16777216_11534336.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_11534336.build.fs_start=273674240
jumperless_v1.menu.flash.16777216_11534336.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
jumperless_v1.menu.flash.16777216_12582912.upload.maximum_size=4190208
jumperless_v1.menu.flash.16777216_12582912.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_12582912.build.flash_length=4190208
jumperless_v1.menu.flash.16777216_12582912.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_12582912.build.fs_start=272625664
jumperless_v1.menu.flash.16777216_12582912.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
jumperless_v1.menu.flash.16777216_13631488.upload.maximum_size=3141632
jumperless_v1.menu.flash.16777216_13631488.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_13631488.build.flash_length=3141632
jumperless_v1.menu.flash.16777216_13631488.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_13631488.build.fs_start=271577088
jumperless_v1.menu.flash.16777216_13631488.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
jumperless_v1.menu.flash.16777216_14680064.upload.maximum_size=2093056
jumperless_v1.menu.flash.16777216_14680064.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_14680064.build.flash_length=2093056
jumperless_v1.menu.flash.16777216_14680064.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_14680064.build.fs_start=270528512
jumperless_v1.menu.flash.16777216_14680064.build.fs_end=285208576
jumperless_v1.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
jumperless_v1.menu.flash.16777216_15728640.upload.maximum_size=1044480
jumperless_v1.menu.flash.16777216_15728640.build.flash_total=16777216
jumperless_v1.menu.flash.16777216_15728640.build.flash_length=1044480
jumperless_v1.menu.flash.16777216_15728640.build.eeprom_start=285208576
jumperless_v1.menu.flash.16777216_15728640.build.fs_start=269479936
jumperless_v1.menu.flash.16777216_15728640.build.fs_end=285208576
jumperless_v1.menu.freq.200=200 MHz
jumperless_v1.menu.freq.200.build.f_cpu=200000000L
jumperless_v1.menu.freq.50=50 MHz
jumperless_v1.menu.freq.50.build.f_cpu=50000000L
jumperless_v1.menu.freq.100=100 MHz
jumperless_v1.menu.freq.100.build.f_cpu=100000000L
jumperless_v1.menu.freq.120=120 MHz
jumperless_v1.menu.freq.120.build.f_cpu=120000000L
jumperless_v1.menu.freq.125=125 MHz
jumperless_v1.menu.freq.125.build.f_cpu=125000000L
jumperless_v1.menu.freq.128=128 MHz
jumperless_v1.menu.freq.128.build.f_cpu=128000000L
jumperless_v1.menu.freq.133=133 MHz
jumperless_v1.menu.freq.133.build.f_cpu=133000000L
jumperless_v1.menu.freq.150=150 MHz
jumperless_v1.menu.freq.150.build.f_cpu=150000000L
jumperless_v1.menu.freq.176=176 MHz
jumperless_v1.menu.freq.176.build.f_cpu=176000000L
jumperless_v1.menu.freq.225=225 MHz (Overclock)
jumperless_v1.menu.freq.225.build.f_cpu=225000000L
jumperless_v1.menu.freq.240=240 MHz (Overclock)
jumperless_v1.menu.freq.240.build.f_cpu=240000000L
jumperless_v1.menu.freq.250=250 MHz (Overclock)
jumperless_v1.menu.freq.250.build.f_cpu=250000000L
jumperless_v1.menu.freq.276=276 MHz (Overclock)
jumperless_v1.menu.freq.276.build.f_cpu=276000000L
jumperless_v1.menu.freq.300=300 MHz (Overclock)
jumperless_v1.menu.freq.300.build.f_cpu=300000000L
jumperless_v1.menu.opt.Small=Small (-Os) (standard)
jumperless_v1.menu.opt.Small.build.flags.optimize=-Os
jumperless_v1.menu.opt.Optimize=Optimize (-O)
jumperless_v1.menu.opt.Optimize.build.flags.optimize=-O
jumperless_v1.menu.opt.Optimize2=Optimize More (-O2)
jumperless_v1.menu.opt.Optimize2.build.flags.optimize=-O2
jumperless_v1.menu.opt.Optimize3=Optimize Even More (-O3)
jumperless_v1.menu.opt.Optimize3.build.flags.optimize=-O3
jumperless_v1.menu.opt.Fast=Fast (-Ofast) (maybe slower)
jumperless_v1.menu.opt.Fast.build.flags.optimize=-Ofast
jumperless_v1.menu.opt.Debug=Debug (-Og)
jumperless_v1.menu.opt.Debug.build.flags.optimize=-Og
jumperless_v1.menu.opt.Disabled=Disabled (-O0)
jumperless_v1.menu.opt.Disabled.build.flags.optimize=-O0
jumperless_v1.menu.profile.Disabled=Disabled
jumperless_v1.menu.profile.Disabled.build.flags.profile=
jumperless_v1.menu.profile.Enabled=Enabled
jumperless_v1.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
jumperless_v1.menu.rtti.Disabled=Disabled
jumperless_v1.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
jumperless_v1.menu.rtti.Enabled=Enabled
jumperless_v1.menu.rtti.Enabled.build.flags.rtti=
jumperless_v1.menu.stackprotect.Disabled=Disabled
jumperless_v1.menu.stackprotect.Disabled.build.flags.stackprotect=
jumperless_v1.menu.stackprotect.Enabled=Enabled
jumperless_v1.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
jumperless_v1.menu.exceptions.Disabled=Disabled
jumperless_v1.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
jumperless_v1.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
jumperless_v1.menu.exceptions.Enabled=Enabled
jumperless_v1.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
jumperless_v1.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
jumperless_v1.menu.dbgport.Disabled=Disabled
jumperless_v1.menu.dbgport.Disabled.build.debug_port=
jumperless_v1.menu.dbgport.Serial=Serial
jumperless_v1.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
jumperless_v1.menu.dbgport.Serial1=Serial1
jumperless_v1.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
jumperless_v1.menu.dbgport.Serial2=Serial2
jumperless_v1.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
jumperless_v1.menu.dbgport.SerialSemi=SerialSemi
jumperless_v1.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
jumperless_v1.menu.dbglvl.None=None
jumperless_v1.menu.dbglvl.None.build.debug_level=
jumperless_v1.menu.dbglvl.Core=Core
jumperless_v1.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
jumperless_v1.menu.dbglvl.SPI=SPI
jumperless_v1.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
jumperless_v1.menu.dbglvl.Wire=Wire
jumperless_v1.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
jumperless_v1.menu.dbglvl.Bluetooth=Bluetooth
