earlephilhower/arduino-pico/boards.txt
jumperless_v1.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
jumperless_v1.menu.dbglvl.All=All
jumperless_v1.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
jumperless_v1.menu.dbglvl.NDEBUG=NDEBUG
jumperless_v1.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
jumperless_v1.menu.usbstack.picosdk=Pico SDK
jumperless_v1.menu.usbstack.picosdk.build.usbstack_flags=
jumperless_v1.menu.usbstack.tinyusb=Adafruit TinyUSB
jumperless_v1.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
jumperless_v1.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
jumperless_v1.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
jumperless_v1.menu.usbstack.nousb=No USB
jumperless_v1.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
jumperless_v1.menu.ipbtstack.ipv4only=IPv4 Only
jumperless_v1.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
jumperless_v1.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
jumperless_v1.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
jumperless_v1.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
jumperless_v1.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
jumperless_v1.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
jumperless_v1.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
jumperless_v1.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
jumperless_v1.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
jumperless_v1.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
jumperless_v1.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
jumperless_v1.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
jumperless_v1.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
jumperless_v1.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
jumperless_v1.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
jumperless_v1.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
jumperless_v1.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
jumperless_v1.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
jumperless_v1.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
jumperless_v1.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
jumperless_v1.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
jumperless_v1.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
jumperless_v1.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
jumperless_v1.menu.uploadmethod.default=Default (UF2)
jumperless_v1.menu.uploadmethod.default.build.ram_length=256k
jumperless_v1.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
jumperless_v1.menu.uploadmethod.default.upload.maximum_data_size=262144
jumperless_v1.menu.uploadmethod.default.upload.tool=uf2conv
jumperless_v1.menu.uploadmethod.default.upload.tool.default=uf2conv
jumperless_v1.menu.uploadmethod.default.upload.tool.network=uf2conv-network
jumperless_v1.menu.uploadmethod.picotool=Picotool
jumperless_v1.menu.uploadmethod.picotool.build.ram_length=256k
jumperless_v1.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
jumperless_v1.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
jumperless_v1.menu.uploadmethod.picotool.upload.maximum_data_size=262144
jumperless_v1.menu.uploadmethod.picotool.upload.tool=picotool
jumperless_v1.menu.uploadmethod.picotool.upload.tool.default=picotool
jumperless_v1.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
jumperless_v1.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
jumperless_v1.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
jumperless_v1.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
jumperless_v1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
jumperless_v1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Architeuthis Flux Jumperless V5
# -----------------------------------
jumperless_v5.name=Architeuthis Flux Jumperless V5
jumperless_v5.vid.0=0x1d50
jumperless_v5.pid.0=0xacab
jumperless_v5.vid.1=0x1d50
jumperless_v5.pid.1=0xadab
jumperless_v5.vid.2=0x1d50
jumperless_v5.pid.2=0xecab
jumperless_v5.vid.3=0x1d50
jumperless_v5.pid.3=0xedab
jumperless_v5.upload_port.0.vid=0x1d50
jumperless_v5.upload_port.0.pid=0xacab
jumperless_v5.upload_port.1.vid=0x1d50
jumperless_v5.upload_port.1.pid=0xadab
jumperless_v5.upload_port.2.vid=0x1d50
jumperless_v5.upload_port.2.pid=0xecab
jumperless_v5.upload_port.3.vid=0x1d50
jumperless_v5.upload_port.3.pid=0xedab
jumperless_v5.build.usbvid=-DUSBD_VID=0x1d50
jumperless_v5.build.usbpid=-DUSBD_PID=0xacab
jumperless_v5.build.usbpwr=-DUSBD_MAX_POWER_MA=500
jumperless_v5.build.board=JUMPERLESS_V5
jumperless_v5.build.variant=jumperless_v5
jumperless_v5.upload.maximum_size=16777216
jumperless_v5.upload.wait_for_upload_port=true
jumperless_v5.upload.erase_cmd=
jumperless_v5.serial.disableDTR=false
jumperless_v5.serial.disableRTS=false
jumperless_v5.build.f_cpu=125000000
jumperless_v5.build.led=
jumperless_v5.build.core=rp2040
jumperless_v5.build.ldscript=memmap_default.ld
jumperless_v5.build.boot2=none
jumperless_v5.build.usb_manufacturer="Architeuthis Flux"
jumperless_v5.build.usb_product="Jumperless V5"
jumperless_v5.build.psram_length=0x000000
jumperless_v5.build.extra_flags=
jumperless_v5.menu.flash.16777216_0=16MB (no FS)
jumperless_v5.menu.flash.16777216_0.upload.maximum_size=16769024
jumperless_v5.menu.flash.16777216_0.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_0.build.flash_length=16769024
jumperless_v5.menu.flash.16777216_0.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_0.build.fs_start=285204480
jumperless_v5.menu.flash.16777216_0.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
jumperless_v5.menu.flash.16777216_65536.upload.maximum_size=16703488
jumperless_v5.menu.flash.16777216_65536.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_65536.build.flash_length=16703488
jumperless_v5.menu.flash.16777216_65536.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_65536.build.fs_start=285138944
jumperless_v5.menu.flash.16777216_65536.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
jumperless_v5.menu.flash.16777216_131072.upload.maximum_size=16637952
jumperless_v5.menu.flash.16777216_131072.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_131072.build.flash_length=16637952
jumperless_v5.menu.flash.16777216_131072.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_131072.build.fs_start=285073408
jumperless_v5.menu.flash.16777216_131072.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
jumperless_v5.menu.flash.16777216_262144.upload.maximum_size=16506880
jumperless_v5.menu.flash.16777216_262144.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_262144.build.flash_length=16506880
jumperless_v5.menu.flash.16777216_262144.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_262144.build.fs_start=284942336
jumperless_v5.menu.flash.16777216_262144.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
jumperless_v5.menu.flash.16777216_524288.upload.maximum_size=16244736
jumperless_v5.menu.flash.16777216_524288.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_524288.build.flash_length=16244736
jumperless_v5.menu.flash.16777216_524288.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_524288.build.fs_start=284680192
jumperless_v5.menu.flash.16777216_524288.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
jumperless_v5.menu.flash.16777216_1048576.upload.maximum_size=15720448
jumperless_v5.menu.flash.16777216_1048576.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_1048576.build.flash_length=15720448
jumperless_v5.menu.flash.16777216_1048576.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_1048576.build.fs_start=284155904
jumperless_v5.menu.flash.16777216_1048576.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
jumperless_v5.menu.flash.16777216_2097152.upload.maximum_size=14671872
jumperless_v5.menu.flash.16777216_2097152.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_2097152.build.flash_length=14671872
jumperless_v5.menu.flash.16777216_2097152.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_2097152.build.fs_start=283107328
jumperless_v5.menu.flash.16777216_2097152.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
jumperless_v5.menu.flash.16777216_3145728.upload.maximum_size=13623296
jumperless_v5.menu.flash.16777216_3145728.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_3145728.build.flash_length=13623296
jumperless_v5.menu.flash.16777216_3145728.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_3145728.build.fs_start=282058752
jumperless_v5.menu.flash.16777216_3145728.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
jumperless_v5.menu.flash.16777216_4194304.upload.maximum_size=12574720
jumperless_v5.menu.flash.16777216_4194304.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_4194304.build.flash_length=12574720
jumperless_v5.menu.flash.16777216_4194304.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_4194304.build.fs_start=281010176
jumperless_v5.menu.flash.16777216_4194304.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
jumperless_v5.menu.flash.16777216_5242880.upload.maximum_size=11526144
jumperless_v5.menu.flash.16777216_5242880.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_5242880.build.flash_length=11526144
jumperless_v5.menu.flash.16777216_5242880.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_5242880.build.fs_start=279961600
jumperless_v5.menu.flash.16777216_5242880.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
jumperless_v5.menu.flash.16777216_6291456.upload.maximum_size=10477568
jumperless_v5.menu.flash.16777216_6291456.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_6291456.build.flash_length=10477568
jumperless_v5.menu.flash.16777216_6291456.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_6291456.build.fs_start=278913024
jumperless_v5.menu.flash.16777216_6291456.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
jumperless_v5.menu.flash.16777216_7340032.upload.maximum_size=9428992
jumperless_v5.menu.flash.16777216_7340032.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_7340032.build.flash_length=9428992
jumperless_v5.menu.flash.16777216_7340032.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_7340032.build.fs_start=277864448
jumperless_v5.menu.flash.16777216_7340032.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
jumperless_v5.menu.flash.16777216_8388608.upload.maximum_size=8380416
jumperless_v5.menu.flash.16777216_8388608.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_8388608.build.flash_length=8380416
jumperless_v5.menu.flash.16777216_8388608.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_8388608.build.fs_start=276815872
jumperless_v5.menu.flash.16777216_8388608.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
jumperless_v5.menu.flash.16777216_9437184.upload.maximum_size=7331840
jumperless_v5.menu.flash.16777216_9437184.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_9437184.build.flash_length=7331840
jumperless_v5.menu.flash.16777216_9437184.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_9437184.build.fs_start=275767296
jumperless_v5.menu.flash.16777216_9437184.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
jumperless_v5.menu.flash.16777216_10485760.upload.maximum_size=6283264
jumperless_v5.menu.flash.16777216_10485760.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_10485760.build.flash_length=6283264
jumperless_v5.menu.flash.16777216_10485760.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_10485760.build.fs_start=274718720
jumperless_v5.menu.flash.16777216_10485760.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
jumperless_v5.menu.flash.16777216_11534336.upload.maximum_size=5234688
jumperless_v5.menu.flash.16777216_11534336.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_11534336.build.flash_length=5234688
jumperless_v5.menu.flash.16777216_11534336.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_11534336.build.fs_start=273670144
jumperless_v5.menu.flash.16777216_11534336.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
jumperless_v5.menu.flash.16777216_12582912.upload.maximum_size=4186112
jumperless_v5.menu.flash.16777216_12582912.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_12582912.build.flash_length=4186112
jumperless_v5.menu.flash.16777216_12582912.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_12582912.build.fs_start=272621568
jumperless_v5.menu.flash.16777216_12582912.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
jumperless_v5.menu.flash.16777216_13631488.upload.maximum_size=3137536
jumperless_v5.menu.flash.16777216_13631488.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_13631488.build.flash_length=3137536
jumperless_v5.menu.flash.16777216_13631488.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_13631488.build.fs_start=271572992
jumperless_v5.menu.flash.16777216_13631488.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
jumperless_v5.menu.flash.16777216_14680064.upload.maximum_size=2088960
jumperless_v5.menu.flash.16777216_14680064.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_14680064.build.flash_length=2088960
jumperless_v5.menu.flash.16777216_14680064.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_14680064.build.fs_start=270524416
jumperless_v5.menu.flash.16777216_14680064.build.fs_end=285204480
jumperless_v5.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
jumperless_v5.menu.flash.16777216_15728640.upload.maximum_size=1040384
jumperless_v5.menu.flash.16777216_15728640.build.flash_total=16777216
jumperless_v5.menu.flash.16777216_15728640.build.flash_length=1040384
jumperless_v5.menu.flash.16777216_15728640.build.eeprom_start=285204480
jumperless_v5.menu.flash.16777216_15728640.build.fs_start=269475840
jumperless_v5.menu.flash.16777216_15728640.build.fs_end=285204480
jumperless_v5.menu.arch.arm=ARM
jumperless_v5.menu.arch.arm.build.chip=rp2350
jumperless_v5.menu.arch.arm.build.toolchain=arm-none-eabi
jumperless_v5.menu.arch.arm.build.toolchainpkg=pqt-gcc
jumperless_v5.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
jumperless_v5.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
jumperless_v5.menu.arch.arm.build.mcu=cortex-m33
jumperless_v5.menu.arch.riscv=RISC-V
jumperless_v5.menu.arch.riscv.build.chip=rp2350-riscv
jumperless_v5.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
jumperless_v5.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
jumperless_v5.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
jumperless_v5.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
jumperless_v5.menu.arch.riscv.build.mcu=rv32imac
jumperless_v5.menu.freq.150=150 MHz
jumperless_v5.menu.freq.150.build.f_cpu=150000000L
jumperless_v5.menu.freq.50=50 MHz
jumperless_v5.menu.freq.50.build.f_cpu=50000000L
jumperless_v5.menu.freq.100=100 MHz
jumperless_v5.menu.freq.100.build.f_cpu=100000000L
jumperless_v5.menu.freq.120=120 MHz
jumperless_v5.menu.freq.120.build.f_cpu=120000000L
jumperless_v5.menu.freq.125=125 MHz
jumperless_v5.menu.freq.125.build.f_cpu=125000000L
jumperless_v5.menu.freq.128=128 MHz
jumperless_v5.menu.freq.128.build.f_cpu=128000000L
jumperless_v5.menu.freq.133=133 MHz
jumperless_v5.menu.freq.133.build.f_cpu=133000000L
jumperless_v5.menu.freq.176=176 MHz (Overclock)
jumperless_v5.menu.freq.176.build.f_cpu=176000000L
jumperless_v5.menu.freq.200=200 MHz (Overclock)
jumperless_v5.menu.freq.200.build.f_cpu=200000000L
jumperless_v5.menu.freq.225=225 MHz (Overclock)
jumperless_v5.menu.freq.225.build.f_cpu=225000000L
jumperless_v5.menu.freq.240=240 MHz (Overclock)
jumperless_v5.menu.freq.240.build.f_cpu=240000000L
jumperless_v5.menu.freq.250=250 MHz (Overclock)
jumperless_v5.menu.freq.250.build.f_cpu=250000000L
jumperless_v5.menu.freq.276=276 MHz (Overclock)
jumperless_v5.menu.freq.276.build.f_cpu=276000000L
jumperless_v5.menu.freq.300=300 MHz (Overclock)
jumperless_v5.menu.freq.300.build.f_cpu=300000000L
jumperless_v5.menu.opt.Small=Small (-Os) (standard)
jumperless_v5.menu.opt.Small.build.flags.optimize=-Os
jumperless_v5.menu.opt.Optimize=Optimize (-O)
jumperless_v5.menu.opt.Optimize.build.flags.optimize=-O
