earlephilhower/arduino-pico/boards.txt
jumperless_v5.menu.opt.Optimize2=Optimize More (-O2)
jumperless_v5.menu.opt.Optimize2.build.flags.optimize=-O2
jumperless_v5.menu.opt.Optimize3=Optimize Even More (-O3)
jumperless_v5.menu.opt.Optimize3.build.flags.optimize=-O3
jumperless_v5.menu.opt.Fast=Fast (-Ofast) (maybe slower)
jumperless_v5.menu.opt.Fast.build.flags.optimize=-Ofast
jumperless_v5.menu.opt.Debug=Debug (-Og)
jumperless_v5.menu.opt.Debug.build.flags.optimize=-Og
jumperless_v5.menu.opt.Disabled=Disabled (-O0)
jumperless_v5.menu.opt.Disabled.build.flags.optimize=-O0
jumperless_v5.menu.profile.Disabled=Disabled
jumperless_v5.menu.profile.Disabled.build.flags.profile=
jumperless_v5.menu.profile.Enabled=Enabled
jumperless_v5.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
jumperless_v5.menu.rtti.Disabled=Disabled
jumperless_v5.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
jumperless_v5.menu.rtti.Enabled=Enabled
jumperless_v5.menu.rtti.Enabled.build.flags.rtti=
jumperless_v5.menu.stackprotect.Disabled=Disabled
jumperless_v5.menu.stackprotect.Disabled.build.flags.stackprotect=
jumperless_v5.menu.stackprotect.Enabled=Enabled
jumperless_v5.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
jumperless_v5.menu.exceptions.Disabled=Disabled
jumperless_v5.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
jumperless_v5.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
jumperless_v5.menu.exceptions.Enabled=Enabled
jumperless_v5.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
jumperless_v5.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
jumperless_v5.menu.dbgport.Disabled=Disabled
jumperless_v5.menu.dbgport.Disabled.build.debug_port=
jumperless_v5.menu.dbgport.Serial=Serial
jumperless_v5.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
jumperless_v5.menu.dbgport.Serial1=Serial1
jumperless_v5.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
jumperless_v5.menu.dbgport.Serial2=Serial2
jumperless_v5.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
jumperless_v5.menu.dbgport.SerialSemi=SerialSemi
jumperless_v5.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
jumperless_v5.menu.dbglvl.None=None
jumperless_v5.menu.dbglvl.None.build.debug_level=
jumperless_v5.menu.dbglvl.Core=Core
jumperless_v5.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
jumperless_v5.menu.dbglvl.SPI=SPI
jumperless_v5.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
jumperless_v5.menu.dbglvl.Wire=Wire
jumperless_v5.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
jumperless_v5.menu.dbglvl.Bluetooth=Bluetooth
jumperless_v5.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
jumperless_v5.menu.dbglvl.All=All
jumperless_v5.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
jumperless_v5.menu.dbglvl.NDEBUG=NDEBUG
jumperless_v5.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
jumperless_v5.menu.usbstack.picosdk=Pico SDK
jumperless_v5.menu.usbstack.picosdk.build.usbstack_flags=
jumperless_v5.menu.usbstack.tinyusb=Adafruit TinyUSB
jumperless_v5.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
jumperless_v5.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
jumperless_v5.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
jumperless_v5.menu.usbstack.nousb=No USB
jumperless_v5.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
jumperless_v5.menu.ipbtstack.ipv4only=IPv4 Only
jumperless_v5.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
jumperless_v5.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
jumperless_v5.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
jumperless_v5.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
jumperless_v5.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
jumperless_v5.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
jumperless_v5.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
jumperless_v5.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
jumperless_v5.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
jumperless_v5.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
jumperless_v5.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
jumperless_v5.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
jumperless_v5.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
jumperless_v5.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
jumperless_v5.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
jumperless_v5.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
jumperless_v5.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
jumperless_v5.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
jumperless_v5.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
jumperless_v5.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
jumperless_v5.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
jumperless_v5.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
jumperless_v5.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
jumperless_v5.menu.uploadmethod.default=Default (UF2)
jumperless_v5.menu.uploadmethod.default.build.ram_length=512k
jumperless_v5.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
jumperless_v5.menu.uploadmethod.default.upload.maximum_data_size=524288
jumperless_v5.menu.uploadmethod.default.upload.tool=uf2conv
jumperless_v5.menu.uploadmethod.default.upload.tool.default=uf2conv
jumperless_v5.menu.uploadmethod.default.upload.tool.network=uf2conv-network
jumperless_v5.menu.uploadmethod.picotool=Picotool
jumperless_v5.menu.uploadmethod.picotool.build.ram_length=512k
jumperless_v5.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
jumperless_v5.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
jumperless_v5.menu.uploadmethod.picotool.upload.maximum_data_size=524288
jumperless_v5.menu.uploadmethod.picotool.upload.tool=picotool
jumperless_v5.menu.uploadmethod.picotool.upload.tool.default=picotool
jumperless_v5.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
jumperless_v5.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
jumperless_v5.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
jumperless_v5.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
jumperless_v5.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
jumperless_v5.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

