earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Breadstick Raspberry
# -----------------------------------
breadstick_raspberry.name=Breadstick Raspberry
breadstick_raspberry.vid.0=0x2e8a
breadstick_raspberry.pid.0=0x105e
breadstick_raspberry.vid.1=0x2e8a
breadstick_raspberry.pid.1=0x115e
breadstick_raspberry.vid.2=0x2e8a
breadstick_raspberry.pid.2=0x505e
breadstick_raspberry.vid.3=0x2e8a
breadstick_raspberry.pid.3=0x515e
breadstick_raspberry.vid.4=0x2e8a
breadstick_raspberry.pid.4=0x905e
breadstick_raspberry.vid.5=0x2e8a
breadstick_raspberry.pid.5=0x915e
breadstick_raspberry.vid.6=0x2e8a
breadstick_raspberry.pid.6=0xd05e
breadstick_raspberry.vid.7=0x2e8a
breadstick_raspberry.pid.7=0xd15e
breadstick_raspberry.upload_port.0.vid=0x2e8a
breadstick_raspberry.upload_port.0.pid=0x105e
breadstick_raspberry.upload_port.1.vid=0x2e8a
breadstick_raspberry.upload_port.1.pid=0x115e
breadstick_raspberry.upload_port.2.vid=0x2e8a
breadstick_raspberry.upload_port.2.pid=0x505e
breadstick_raspberry.upload_port.3.vid=0x2e8a
breadstick_raspberry.upload_port.3.pid=0x515e
breadstick_raspberry.upload_port.4.vid=0x2e8a
breadstick_raspberry.upload_port.4.pid=0x905e
breadstick_raspberry.upload_port.5.vid=0x2e8a
breadstick_raspberry.upload_port.5.pid=0x915e
breadstick_raspberry.upload_port.6.vid=0x2e8a
breadstick_raspberry.upload_port.6.pid=0xd05e
breadstick_raspberry.upload_port.7.vid=0x2e8a
breadstick_raspberry.upload_port.7.pid=0xd15e
breadstick_raspberry.build.usbvid=-DUSBD_VID=0x2e8a
breadstick_raspberry.build.usbpid=-DUSBD_PID=0x105e
breadstick_raspberry.build.usbpwr=-DUSBD_MAX_POWER_MA=500
breadstick_raspberry.build.board=Breadstick_Raspberry
breadstick_raspberry.build.mcu=cortex-m0plus
breadstick_raspberry.build.chip=rp2040
breadstick_raspberry.build.toolchain=arm-none-eabi
breadstick_raspberry.build.toolchainpkg=pqt-gcc
breadstick_raspberry.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
breadstick_raspberry.build.uf2family=--family rp2040
breadstick_raspberry.build.variant=breadstick_raspberry
breadstick_raspberry.upload.maximum_size=16777216
breadstick_raspberry.upload.wait_for_upload_port=true
breadstick_raspberry.upload.erase_cmd=
breadstick_raspberry.serial.disableDTR=false
breadstick_raspberry.serial.disableRTS=false
breadstick_raspberry.build.f_cpu=125000000
breadstick_raspberry.build.led=
breadstick_raspberry.build.core=rp2040
breadstick_raspberry.build.ldscript=memmap_default.ld
breadstick_raspberry.build.boot2=boot2_w25q080_2_padded_checksum
breadstick_raspberry.build.usb_manufacturer="Breadstick"
breadstick_raspberry.build.usb_product="Raspberry"
breadstick_raspberry.menu.flash.16777216_0=16MB (no FS)
breadstick_raspberry.menu.flash.16777216_0.upload.maximum_size=16773120
breadstick_raspberry.menu.flash.16777216_0.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_0.build.flash_length=16773120
breadstick_raspberry.menu.flash.16777216_0.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_0.build.fs_start=285208576
breadstick_raspberry.menu.flash.16777216_0.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
breadstick_raspberry.menu.flash.16777216_65536.upload.maximum_size=16707584
breadstick_raspberry.menu.flash.16777216_65536.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_65536.build.flash_length=16707584
breadstick_raspberry.menu.flash.16777216_65536.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_65536.build.fs_start=285143040
breadstick_raspberry.menu.flash.16777216_65536.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
breadstick_raspberry.menu.flash.16777216_131072.upload.maximum_size=16642048
breadstick_raspberry.menu.flash.16777216_131072.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_131072.build.flash_length=16642048
breadstick_raspberry.menu.flash.16777216_131072.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_131072.build.fs_start=285077504
breadstick_raspberry.menu.flash.16777216_131072.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
breadstick_raspberry.menu.flash.16777216_262144.upload.maximum_size=16510976
breadstick_raspberry.menu.flash.16777216_262144.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_262144.build.flash_length=16510976
breadstick_raspberry.menu.flash.16777216_262144.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_262144.build.fs_start=284946432
breadstick_raspberry.menu.flash.16777216_262144.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
breadstick_raspberry.menu.flash.16777216_524288.upload.maximum_size=16248832
breadstick_raspberry.menu.flash.16777216_524288.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_524288.build.flash_length=16248832
breadstick_raspberry.menu.flash.16777216_524288.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_524288.build.fs_start=284684288
breadstick_raspberry.menu.flash.16777216_524288.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
breadstick_raspberry.menu.flash.16777216_1048576.upload.maximum_size=15724544
breadstick_raspberry.menu.flash.16777216_1048576.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_1048576.build.flash_length=15724544
breadstick_raspberry.menu.flash.16777216_1048576.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_1048576.build.fs_start=284160000
breadstick_raspberry.menu.flash.16777216_1048576.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
breadstick_raspberry.menu.flash.16777216_2097152.upload.maximum_size=14675968
breadstick_raspberry.menu.flash.16777216_2097152.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_2097152.build.flash_length=14675968
breadstick_raspberry.menu.flash.16777216_2097152.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_2097152.build.fs_start=283111424
breadstick_raspberry.menu.flash.16777216_2097152.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
breadstick_raspberry.menu.flash.16777216_3145728.upload.maximum_size=13627392
breadstick_raspberry.menu.flash.16777216_3145728.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_3145728.build.flash_length=13627392
breadstick_raspberry.menu.flash.16777216_3145728.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_3145728.build.fs_start=282062848
breadstick_raspberry.menu.flash.16777216_3145728.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
breadstick_raspberry.menu.flash.16777216_4194304.upload.maximum_size=12578816
breadstick_raspberry.menu.flash.16777216_4194304.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_4194304.build.flash_length=12578816
breadstick_raspberry.menu.flash.16777216_4194304.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_4194304.build.fs_start=281014272
breadstick_raspberry.menu.flash.16777216_4194304.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
breadstick_raspberry.menu.flash.16777216_5242880.upload.maximum_size=11530240
breadstick_raspberry.menu.flash.16777216_5242880.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_5242880.build.flash_length=11530240
breadstick_raspberry.menu.flash.16777216_5242880.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_5242880.build.fs_start=279965696
breadstick_raspberry.menu.flash.16777216_5242880.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
breadstick_raspberry.menu.flash.16777216_6291456.upload.maximum_size=10481664
breadstick_raspberry.menu.flash.16777216_6291456.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_6291456.build.flash_length=10481664
breadstick_raspberry.menu.flash.16777216_6291456.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_6291456.build.fs_start=278917120
breadstick_raspberry.menu.flash.16777216_6291456.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
breadstick_raspberry.menu.flash.16777216_7340032.upload.maximum_size=9433088
breadstick_raspberry.menu.flash.16777216_7340032.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_7340032.build.flash_length=9433088
breadstick_raspberry.menu.flash.16777216_7340032.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_7340032.build.fs_start=277868544
breadstick_raspberry.menu.flash.16777216_7340032.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
breadstick_raspberry.menu.flash.16777216_8388608.upload.maximum_size=8384512
breadstick_raspberry.menu.flash.16777216_8388608.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_8388608.build.flash_length=8384512
breadstick_raspberry.menu.flash.16777216_8388608.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_8388608.build.fs_start=276819968
breadstick_raspberry.menu.flash.16777216_8388608.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
breadstick_raspberry.menu.flash.16777216_9437184.upload.maximum_size=7335936
breadstick_raspberry.menu.flash.16777216_9437184.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_9437184.build.flash_length=7335936
breadstick_raspberry.menu.flash.16777216_9437184.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_9437184.build.fs_start=275771392
breadstick_raspberry.menu.flash.16777216_9437184.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
breadstick_raspberry.menu.flash.16777216_10485760.upload.maximum_size=6287360
breadstick_raspberry.menu.flash.16777216_10485760.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_10485760.build.flash_length=6287360
breadstick_raspberry.menu.flash.16777216_10485760.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_10485760.build.fs_start=274722816
breadstick_raspberry.menu.flash.16777216_10485760.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
breadstick_raspberry.menu.flash.16777216_11534336.upload.maximum_size=5238784
breadstick_raspberry.menu.flash.16777216_11534336.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_11534336.build.flash_length=5238784
breadstick_raspberry.menu.flash.16777216_11534336.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_11534336.build.fs_start=273674240
breadstick_raspberry.menu.flash.16777216_11534336.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
breadstick_raspberry.menu.flash.16777216_12582912.upload.maximum_size=4190208
breadstick_raspberry.menu.flash.16777216_12582912.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_12582912.build.flash_length=4190208
breadstick_raspberry.menu.flash.16777216_12582912.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_12582912.build.fs_start=272625664
breadstick_raspberry.menu.flash.16777216_12582912.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
breadstick_raspberry.menu.flash.16777216_13631488.upload.maximum_size=3141632
breadstick_raspberry.menu.flash.16777216_13631488.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_13631488.build.flash_length=3141632
breadstick_raspberry.menu.flash.16777216_13631488.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_13631488.build.fs_start=271577088
breadstick_raspberry.menu.flash.16777216_13631488.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
breadstick_raspberry.menu.flash.16777216_14680064.upload.maximum_size=2093056
breadstick_raspberry.menu.flash.16777216_14680064.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_14680064.build.flash_length=2093056
breadstick_raspberry.menu.flash.16777216_14680064.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_14680064.build.fs_start=270528512
breadstick_raspberry.menu.flash.16777216_14680064.build.fs_end=285208576
breadstick_raspberry.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
breadstick_raspberry.menu.flash.16777216_15728640.upload.maximum_size=1044480
breadstick_raspberry.menu.flash.16777216_15728640.build.flash_total=16777216
breadstick_raspberry.menu.flash.16777216_15728640.build.flash_length=1044480
breadstick_raspberry.menu.flash.16777216_15728640.build.eeprom_start=285208576
breadstick_raspberry.menu.flash.16777216_15728640.build.fs_start=269479936
breadstick_raspberry.menu.flash.16777216_15728640.build.fs_end=285208576
breadstick_raspberry.menu.freq.200=200 MHz
breadstick_raspberry.menu.freq.200.build.f_cpu=200000000L
breadstick_raspberry.menu.freq.50=50 MHz
breadstick_raspberry.menu.freq.50.build.f_cpu=50000000L
breadstick_raspberry.menu.freq.100=100 MHz
breadstick_raspberry.menu.freq.100.build.f_cpu=100000000L
breadstick_raspberry.menu.freq.120=120 MHz
breadstick_raspberry.menu.freq.120.build.f_cpu=120000000L
breadstick_raspberry.menu.freq.125=125 MHz
breadstick_raspberry.menu.freq.125.build.f_cpu=125000000L
breadstick_raspberry.menu.freq.128=128 MHz
breadstick_raspberry.menu.freq.128.build.f_cpu=128000000L
breadstick_raspberry.menu.freq.133=133 MHz
breadstick_raspberry.menu.freq.133.build.f_cpu=133000000L
breadstick_raspberry.menu.freq.150=150 MHz
breadstick_raspberry.menu.freq.150.build.f_cpu=150000000L
breadstick_raspberry.menu.freq.176=176 MHz
breadstick_raspberry.menu.freq.176.build.f_cpu=176000000L
breadstick_raspberry.menu.freq.225=225 MHz (Overclock)
breadstick_raspberry.menu.freq.225.build.f_cpu=225000000L
breadstick_raspberry.menu.freq.240=240 MHz (Overclock)
breadstick_raspberry.menu.freq.240.build.f_cpu=240000000L
breadstick_raspberry.menu.freq.250=250 MHz (Overclock)
breadstick_raspberry.menu.freq.250.build.f_cpu=250000000L
breadstick_raspberry.menu.freq.276=276 MHz (Overclock)
breadstick_raspberry.menu.freq.276.build.f_cpu=276000000L
breadstick_raspberry.menu.freq.300=300 MHz (Overclock)
breadstick_raspberry.menu.freq.300.build.f_cpu=300000000L
breadstick_raspberry.menu.opt.Small=Small (-Os) (standard)
breadstick_raspberry.menu.opt.Small.build.flags.optimize=-Os
breadstick_raspberry.menu.opt.Optimize=Optimize (-O)
breadstick_raspberry.menu.opt.Optimize.build.flags.optimize=-O
breadstick_raspberry.menu.opt.Optimize2=Optimize More (-O2)
breadstick_raspberry.menu.opt.Optimize2.build.flags.optimize=-O2
breadstick_raspberry.menu.opt.Optimize3=Optimize Even More (-O3)
breadstick_raspberry.menu.opt.Optimize3.build.flags.optimize=-O3
breadstick_raspberry.menu.opt.Fast=Fast (-Ofast) (maybe slower)
breadstick_raspberry.menu.opt.Fast.build.flags.optimize=-Ofast
breadstick_raspberry.menu.opt.Debug=Debug (-Og)
breadstick_raspberry.menu.opt.Debug.build.flags.optimize=-Og
breadstick_raspberry.menu.opt.Disabled=Disabled (-O0)
breadstick_raspberry.menu.opt.Disabled.build.flags.optimize=-O0
breadstick_raspberry.menu.profile.Disabled=Disabled
breadstick_raspberry.menu.profile.Disabled.build.flags.profile=
breadstick_raspberry.menu.profile.Enabled=Enabled
breadstick_raspberry.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
breadstick_raspberry.menu.rtti.Disabled=Disabled
breadstick_raspberry.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
breadstick_raspberry.menu.rtti.Enabled=Enabled
breadstick_raspberry.menu.rtti.Enabled.build.flags.rtti=
breadstick_raspberry.menu.stackprotect.Disabled=Disabled
breadstick_raspberry.menu.stackprotect.Disabled.build.flags.stackprotect=
breadstick_raspberry.menu.stackprotect.Enabled=Enabled
breadstick_raspberry.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
breadstick_raspberry.menu.exceptions.Disabled=Disabled
breadstick_raspberry.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
breadstick_raspberry.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
breadstick_raspberry.menu.exceptions.Enabled=Enabled
breadstick_raspberry.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
breadstick_raspberry.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
breadstick_raspberry.menu.dbgport.Disabled=Disabled
breadstick_raspberry.menu.dbgport.Disabled.build.debug_port=
breadstick_raspberry.menu.dbgport.Serial=Serial
breadstick_raspberry.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
breadstick_raspberry.menu.dbgport.Serial1=Serial1
breadstick_raspberry.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
breadstick_raspberry.menu.dbgport.Serial2=Serial2
breadstick_raspberry.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
breadstick_raspberry.menu.dbgport.SerialSemi=SerialSemi
breadstick_raspberry.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
breadstick_raspberry.menu.dbglvl.None=None
breadstick_raspberry.menu.dbglvl.None.build.debug_level=
breadstick_raspberry.menu.dbglvl.Core=Core
breadstick_raspberry.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
breadstick_raspberry.menu.dbglvl.SPI=SPI
breadstick_raspberry.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
breadstick_raspberry.menu.dbglvl.Wire=Wire
breadstick_raspberry.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
breadstick_raspberry.menu.dbglvl.Bluetooth=Bluetooth
breadstick_raspberry.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
breadstick_raspberry.menu.dbglvl.All=All
