earlephilhower/arduino-pico/boards.txt
breadstick_raspberry.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
breadstick_raspberry.menu.dbglvl.NDEBUG=NDEBUG
breadstick_raspberry.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
breadstick_raspberry.menu.usbstack.picosdk=Pico SDK
breadstick_raspberry.menu.usbstack.picosdk.build.usbstack_flags=
breadstick_raspberry.menu.usbstack.tinyusb=Adafruit TinyUSB
breadstick_raspberry.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
breadstick_raspberry.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
breadstick_raspberry.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
breadstick_raspberry.menu.usbstack.nousb=No USB
breadstick_raspberry.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
breadstick_raspberry.menu.ipbtstack.ipv4only=IPv4 Only
breadstick_raspberry.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
breadstick_raspberry.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
breadstick_raspberry.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
breadstick_raspberry.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
breadstick_raspberry.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
breadstick_raspberry.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
breadstick_raspberry.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
breadstick_raspberry.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
breadstick_raspberry.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
breadstick_raspberry.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
breadstick_raspberry.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
breadstick_raspberry.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
breadstick_raspberry.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
breadstick_raspberry.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
breadstick_raspberry.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
breadstick_raspberry.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
breadstick_raspberry.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
breadstick_raspberry.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
breadstick_raspberry.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
breadstick_raspberry.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
breadstick_raspberry.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
breadstick_raspberry.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
breadstick_raspberry.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
breadstick_raspberry.menu.uploadmethod.default=Default (UF2)
breadstick_raspberry.menu.uploadmethod.default.build.ram_length=256k
breadstick_raspberry.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
breadstick_raspberry.menu.uploadmethod.default.upload.maximum_data_size=262144
breadstick_raspberry.menu.uploadmethod.default.upload.tool=uf2conv
breadstick_raspberry.menu.uploadmethod.default.upload.tool.default=uf2conv
breadstick_raspberry.menu.uploadmethod.default.upload.tool.network=uf2conv-network
breadstick_raspberry.menu.uploadmethod.picotool=Picotool
breadstick_raspberry.menu.uploadmethod.picotool.build.ram_length=256k
breadstick_raspberry.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
breadstick_raspberry.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
breadstick_raspberry.menu.uploadmethod.picotool.upload.maximum_data_size=262144
breadstick_raspberry.menu.uploadmethod.picotool.upload.tool=picotool
breadstick_raspberry.menu.uploadmethod.picotool.upload.tool.default=picotool
breadstick_raspberry.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
breadstick_raspberry.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
breadstick_raspberry.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
breadstick_raspberry.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
breadstick_raspberry.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
breadstick_raspberry.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# BridgeTek IDM2040-7A
# -----------------------------------
bridgetek_idm2040_7a.name=BridgeTek IDM2040-7A
bridgetek_idm2040_7a.vid.0=0x2e8a
bridgetek_idm2040_7a.pid.0=0x1041
bridgetek_idm2040_7a.vid.1=0x2e8a
bridgetek_idm2040_7a.pid.1=0x1141
bridgetek_idm2040_7a.vid.2=0x2e8a
bridgetek_idm2040_7a.pid.2=0x5041
bridgetek_idm2040_7a.vid.3=0x2e8a
bridgetek_idm2040_7a.pid.3=0x5141
bridgetek_idm2040_7a.vid.4=0x2e8a
bridgetek_idm2040_7a.pid.4=0x9041
bridgetek_idm2040_7a.vid.5=0x2e8a
bridgetek_idm2040_7a.pid.5=0x9141
bridgetek_idm2040_7a.vid.6=0x2e8a
bridgetek_idm2040_7a.pid.6=0xd041
bridgetek_idm2040_7a.vid.7=0x2e8a
bridgetek_idm2040_7a.pid.7=0xd141
bridgetek_idm2040_7a.upload_port.0.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.0.pid=0x1041
bridgetek_idm2040_7a.upload_port.1.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.1.pid=0x1141
bridgetek_idm2040_7a.upload_port.2.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.2.pid=0x5041
bridgetek_idm2040_7a.upload_port.3.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.3.pid=0x5141
bridgetek_idm2040_7a.upload_port.4.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.4.pid=0x9041
bridgetek_idm2040_7a.upload_port.5.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.5.pid=0x9141
bridgetek_idm2040_7a.upload_port.6.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.6.pid=0xd041
bridgetek_idm2040_7a.upload_port.7.vid=0x2e8a
bridgetek_idm2040_7a.upload_port.7.pid=0xd141
bridgetek_idm2040_7a.build.usbvid=-DUSBD_VID=0x2e8a
bridgetek_idm2040_7a.build.usbpid=-DUSBD_PID=0x1041
bridgetek_idm2040_7a.build.usbpwr=-DUSBD_MAX_POWER_MA=250
bridgetek_idm2040_7a.build.board=BRIDGETEK_IDM2040_7A
bridgetek_idm2040_7a.build.mcu=cortex-m0plus
bridgetek_idm2040_7a.build.chip=rp2040
bridgetek_idm2040_7a.build.toolchain=arm-none-eabi
bridgetek_idm2040_7a.build.toolchainpkg=pqt-gcc
bridgetek_idm2040_7a.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
bridgetek_idm2040_7a.build.uf2family=--family rp2040
bridgetek_idm2040_7a.build.variant=bridgetek_idm2040_7a
bridgetek_idm2040_7a.upload.maximum_size=8388608
bridgetek_idm2040_7a.upload.wait_for_upload_port=true
bridgetek_idm2040_7a.upload.erase_cmd=
bridgetek_idm2040_7a.serial.disableDTR=false
bridgetek_idm2040_7a.serial.disableRTS=false
bridgetek_idm2040_7a.build.f_cpu=125000000
bridgetek_idm2040_7a.build.led=
bridgetek_idm2040_7a.build.core=rp2040
bridgetek_idm2040_7a.build.ldscript=memmap_default.ld
bridgetek_idm2040_7a.build.boot2=boot2_w25q080_2_padded_checksum
bridgetek_idm2040_7a.build.usb_manufacturer="BridgeTek"
bridgetek_idm2040_7a.build.usb_product="IDM2040-7A"
bridgetek_idm2040_7a.build.extra_flags=-DFT8XX_TYPE=BT817 -DDISPLAY_RES=WVGA -DPLATFORM_RP2040
bridgetek_idm2040_7a.menu.flash.8388608_0=8MB (no FS)
bridgetek_idm2040_7a.menu.flash.8388608_0.upload.maximum_size=8384512
bridgetek_idm2040_7a.menu.flash.8388608_0.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_0.build.flash_length=8384512
bridgetek_idm2040_7a.menu.flash.8388608_0.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_0.build.fs_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_0.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
bridgetek_idm2040_7a.menu.flash.8388608_65536.upload.maximum_size=8318976
bridgetek_idm2040_7a.menu.flash.8388608_65536.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_65536.build.flash_length=8318976
bridgetek_idm2040_7a.menu.flash.8388608_65536.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_65536.build.fs_start=276754432
bridgetek_idm2040_7a.menu.flash.8388608_65536.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
bridgetek_idm2040_7a.menu.flash.8388608_131072.upload.maximum_size=8253440
bridgetek_idm2040_7a.menu.flash.8388608_131072.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_131072.build.flash_length=8253440
bridgetek_idm2040_7a.menu.flash.8388608_131072.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_131072.build.fs_start=276688896
bridgetek_idm2040_7a.menu.flash.8388608_131072.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
bridgetek_idm2040_7a.menu.flash.8388608_262144.upload.maximum_size=8122368
bridgetek_idm2040_7a.menu.flash.8388608_262144.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_262144.build.flash_length=8122368
bridgetek_idm2040_7a.menu.flash.8388608_262144.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_262144.build.fs_start=276557824
bridgetek_idm2040_7a.menu.flash.8388608_262144.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
bridgetek_idm2040_7a.menu.flash.8388608_524288.upload.maximum_size=7860224
bridgetek_idm2040_7a.menu.flash.8388608_524288.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_524288.build.flash_length=7860224
bridgetek_idm2040_7a.menu.flash.8388608_524288.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_524288.build.fs_start=276295680
bridgetek_idm2040_7a.menu.flash.8388608_524288.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
bridgetek_idm2040_7a.menu.flash.8388608_1048576.upload.maximum_size=7335936
bridgetek_idm2040_7a.menu.flash.8388608_1048576.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_1048576.build.flash_length=7335936
bridgetek_idm2040_7a.menu.flash.8388608_1048576.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_1048576.build.fs_start=275771392
bridgetek_idm2040_7a.menu.flash.8388608_1048576.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
bridgetek_idm2040_7a.menu.flash.8388608_2097152.upload.maximum_size=6287360
bridgetek_idm2040_7a.menu.flash.8388608_2097152.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_2097152.build.flash_length=6287360
bridgetek_idm2040_7a.menu.flash.8388608_2097152.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_2097152.build.fs_start=274722816
bridgetek_idm2040_7a.menu.flash.8388608_2097152.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
bridgetek_idm2040_7a.menu.flash.8388608_3145728.upload.maximum_size=5238784
bridgetek_idm2040_7a.menu.flash.8388608_3145728.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_3145728.build.flash_length=5238784
bridgetek_idm2040_7a.menu.flash.8388608_3145728.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_3145728.build.fs_start=273674240
bridgetek_idm2040_7a.menu.flash.8388608_3145728.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
bridgetek_idm2040_7a.menu.flash.8388608_4194304.upload.maximum_size=4190208
bridgetek_idm2040_7a.menu.flash.8388608_4194304.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_4194304.build.flash_length=4190208
bridgetek_idm2040_7a.menu.flash.8388608_4194304.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_4194304.build.fs_start=272625664
bridgetek_idm2040_7a.menu.flash.8388608_4194304.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
bridgetek_idm2040_7a.menu.flash.8388608_5242880.upload.maximum_size=3141632
bridgetek_idm2040_7a.menu.flash.8388608_5242880.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_5242880.build.flash_length=3141632
bridgetek_idm2040_7a.menu.flash.8388608_5242880.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_5242880.build.fs_start=271577088
bridgetek_idm2040_7a.menu.flash.8388608_5242880.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
bridgetek_idm2040_7a.menu.flash.8388608_6291456.upload.maximum_size=2093056
bridgetek_idm2040_7a.menu.flash.8388608_6291456.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_6291456.build.flash_length=2093056
bridgetek_idm2040_7a.menu.flash.8388608_6291456.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_6291456.build.fs_start=270528512
bridgetek_idm2040_7a.menu.flash.8388608_6291456.build.fs_end=276819968
bridgetek_idm2040_7a.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
bridgetek_idm2040_7a.menu.flash.8388608_7340032.upload.maximum_size=1044480
bridgetek_idm2040_7a.menu.flash.8388608_7340032.build.flash_total=8388608
bridgetek_idm2040_7a.menu.flash.8388608_7340032.build.flash_length=1044480
bridgetek_idm2040_7a.menu.flash.8388608_7340032.build.eeprom_start=276819968
bridgetek_idm2040_7a.menu.flash.8388608_7340032.build.fs_start=269479936
bridgetek_idm2040_7a.menu.flash.8388608_7340032.build.fs_end=276819968
bridgetek_idm2040_7a.menu.freq.200=200 MHz
bridgetek_idm2040_7a.menu.freq.200.build.f_cpu=200000000L
bridgetek_idm2040_7a.menu.freq.50=50 MHz
bridgetek_idm2040_7a.menu.freq.50.build.f_cpu=50000000L
bridgetek_idm2040_7a.menu.freq.100=100 MHz
bridgetek_idm2040_7a.menu.freq.100.build.f_cpu=100000000L
bridgetek_idm2040_7a.menu.freq.120=120 MHz
bridgetek_idm2040_7a.menu.freq.120.build.f_cpu=120000000L
bridgetek_idm2040_7a.menu.freq.125=125 MHz
bridgetek_idm2040_7a.menu.freq.125.build.f_cpu=125000000L
bridgetek_idm2040_7a.menu.freq.128=128 MHz
bridgetek_idm2040_7a.menu.freq.128.build.f_cpu=128000000L
bridgetek_idm2040_7a.menu.freq.133=133 MHz
bridgetek_idm2040_7a.menu.freq.133.build.f_cpu=133000000L
bridgetek_idm2040_7a.menu.freq.150=150 MHz
bridgetek_idm2040_7a.menu.freq.150.build.f_cpu=150000000L
bridgetek_idm2040_7a.menu.freq.176=176 MHz
bridgetek_idm2040_7a.menu.freq.176.build.f_cpu=176000000L
bridgetek_idm2040_7a.menu.freq.225=225 MHz (Overclock)
bridgetek_idm2040_7a.menu.freq.225.build.f_cpu=225000000L
bridgetek_idm2040_7a.menu.freq.240=240 MHz (Overclock)
bridgetek_idm2040_7a.menu.freq.240.build.f_cpu=240000000L
bridgetek_idm2040_7a.menu.freq.250=250 MHz (Overclock)
bridgetek_idm2040_7a.menu.freq.250.build.f_cpu=250000000L
bridgetek_idm2040_7a.menu.freq.276=276 MHz (Overclock)
bridgetek_idm2040_7a.menu.freq.276.build.f_cpu=276000000L
bridgetek_idm2040_7a.menu.freq.300=300 MHz (Overclock)
bridgetek_idm2040_7a.menu.freq.300.build.f_cpu=300000000L
bridgetek_idm2040_7a.menu.opt.Small=Small (-Os) (standard)
bridgetek_idm2040_7a.menu.opt.Small.build.flags.optimize=-Os
bridgetek_idm2040_7a.menu.opt.Optimize=Optimize (-O)
bridgetek_idm2040_7a.menu.opt.Optimize.build.flags.optimize=-O
bridgetek_idm2040_7a.menu.opt.Optimize2=Optimize More (-O2)
bridgetek_idm2040_7a.menu.opt.Optimize2.build.flags.optimize=-O2
bridgetek_idm2040_7a.menu.opt.Optimize3=Optimize Even More (-O3)
bridgetek_idm2040_7a.menu.opt.Optimize3.build.flags.optimize=-O3
bridgetek_idm2040_7a.menu.opt.Fast=Fast (-Ofast) (maybe slower)
bridgetek_idm2040_7a.menu.opt.Fast.build.flags.optimize=-Ofast
bridgetek_idm2040_7a.menu.opt.Debug=Debug (-Og)
bridgetek_idm2040_7a.menu.opt.Debug.build.flags.optimize=-Og
bridgetek_idm2040_7a.menu.opt.Disabled=Disabled (-O0)
bridgetek_idm2040_7a.menu.opt.Disabled.build.flags.optimize=-O0
bridgetek_idm2040_7a.menu.profile.Disabled=Disabled
bridgetek_idm2040_7a.menu.profile.Disabled.build.flags.profile=
bridgetek_idm2040_7a.menu.profile.Enabled=Enabled
bridgetek_idm2040_7a.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
bridgetek_idm2040_7a.menu.rtti.Disabled=Disabled
bridgetek_idm2040_7a.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
bridgetek_idm2040_7a.menu.rtti.Enabled=Enabled
bridgetek_idm2040_7a.menu.rtti.Enabled.build.flags.rtti=
bridgetek_idm2040_7a.menu.stackprotect.Disabled=Disabled
bridgetek_idm2040_7a.menu.stackprotect.Disabled.build.flags.stackprotect=
bridgetek_idm2040_7a.menu.stackprotect.Enabled=Enabled
bridgetek_idm2040_7a.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
bridgetek_idm2040_7a.menu.exceptions.Disabled=Disabled
bridgetek_idm2040_7a.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
bridgetek_idm2040_7a.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
bridgetek_idm2040_7a.menu.exceptions.Enabled=Enabled
bridgetek_idm2040_7a.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
bridgetek_idm2040_7a.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
bridgetek_idm2040_7a.menu.dbgport.Disabled=Disabled
bridgetek_idm2040_7a.menu.dbgport.Disabled.build.debug_port=
bridgetek_idm2040_7a.menu.dbgport.Serial=Serial
bridgetek_idm2040_7a.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
bridgetek_idm2040_7a.menu.dbgport.Serial1=Serial1
bridgetek_idm2040_7a.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
bridgetek_idm2040_7a.menu.dbgport.Serial2=Serial2
bridgetek_idm2040_7a.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
bridgetek_idm2040_7a.menu.dbgport.SerialSemi=SerialSemi
bridgetek_idm2040_7a.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
bridgetek_idm2040_7a.menu.dbglvl.None=None
bridgetek_idm2040_7a.menu.dbglvl.None.build.debug_level=
bridgetek_idm2040_7a.menu.dbglvl.Core=Core
