earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# DatanoiseTV PicoADK v2
# -----------------------------------
datanoisetv_picoadk_v2.name=DatanoiseTV PicoADK v2
datanoisetv_picoadk_v2.vid.0=0x2e8a
datanoisetv_picoadk_v2.pid.0=0x10ae
datanoisetv_picoadk_v2.vid.1=0x2e8a
datanoisetv_picoadk_v2.pid.1=0x11ae
datanoisetv_picoadk_v2.vid.2=0x2e8a
datanoisetv_picoadk_v2.pid.2=0x50ae
datanoisetv_picoadk_v2.vid.3=0x2e8a
datanoisetv_picoadk_v2.pid.3=0x51ae
datanoisetv_picoadk_v2.vid.4=0x2e8a
datanoisetv_picoadk_v2.pid.4=0x90ae
datanoisetv_picoadk_v2.vid.5=0x2e8a
datanoisetv_picoadk_v2.pid.5=0x91ae
datanoisetv_picoadk_v2.vid.6=0x2e8a
datanoisetv_picoadk_v2.pid.6=0xd0ae
datanoisetv_picoadk_v2.vid.7=0x2e8a
datanoisetv_picoadk_v2.pid.7=0xd1ae
datanoisetv_picoadk_v2.upload_port.0.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.0.pid=0x10ae
datanoisetv_picoadk_v2.upload_port.1.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.1.pid=0x11ae
datanoisetv_picoadk_v2.upload_port.2.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.2.pid=0x50ae
datanoisetv_picoadk_v2.upload_port.3.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.3.pid=0x51ae
datanoisetv_picoadk_v2.upload_port.4.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.4.pid=0x90ae
datanoisetv_picoadk_v2.upload_port.5.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.5.pid=0x91ae
datanoisetv_picoadk_v2.upload_port.6.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.6.pid=0xd0ae
datanoisetv_picoadk_v2.upload_port.7.vid=0x2e8a
datanoisetv_picoadk_v2.upload_port.7.pid=0xd1ae
datanoisetv_picoadk_v2.build.usbvid=-DUSBD_VID=0x2e8a
datanoisetv_picoadk_v2.build.usbpid=-DUSBD_PID=0x10ae
datanoisetv_picoadk_v2.build.usbpwr=-DUSBD_MAX_POWER_MA=250
datanoisetv_picoadk_v2.build.board=DATANOISETV_PICOADK_V2
datanoisetv_picoadk_v2.build.variant=datanoisetv_picoadk_v2
datanoisetv_picoadk_v2.upload.maximum_size=4194304
datanoisetv_picoadk_v2.upload.wait_for_upload_port=true
datanoisetv_picoadk_v2.upload.erase_cmd=
datanoisetv_picoadk_v2.serial.disableDTR=false
datanoisetv_picoadk_v2.serial.disableRTS=false
datanoisetv_picoadk_v2.build.f_cpu=125000000
datanoisetv_picoadk_v2.build.led=
datanoisetv_picoadk_v2.build.core=rp2040
datanoisetv_picoadk_v2.build.ldscript=memmap_default.ld
datanoisetv_picoadk_v2.build.boot2=none
datanoisetv_picoadk_v2.build.usb_manufacturer="DatanoiseTV"
datanoisetv_picoadk_v2.build.usb_product="PicoADK v2"
datanoisetv_picoadk_v2.build.psram_length=0x000000
datanoisetv_picoadk_v2.menu.flash.4194304_0=4MB (no FS)
datanoisetv_picoadk_v2.menu.flash.4194304_0.upload.maximum_size=4186112
datanoisetv_picoadk_v2.menu.flash.4194304_0.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_0.build.flash_length=4186112
datanoisetv_picoadk_v2.menu.flash.4194304_0.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_0.build.fs_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_0.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
datanoisetv_picoadk_v2.menu.flash.4194304_65536.upload.maximum_size=4120576
datanoisetv_picoadk_v2.menu.flash.4194304_65536.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_65536.build.flash_length=4120576
datanoisetv_picoadk_v2.menu.flash.4194304_65536.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_65536.build.fs_start=272556032
datanoisetv_picoadk_v2.menu.flash.4194304_65536.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
datanoisetv_picoadk_v2.menu.flash.4194304_131072.upload.maximum_size=4055040
datanoisetv_picoadk_v2.menu.flash.4194304_131072.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_131072.build.flash_length=4055040
datanoisetv_picoadk_v2.menu.flash.4194304_131072.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_131072.build.fs_start=272490496
datanoisetv_picoadk_v2.menu.flash.4194304_131072.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
datanoisetv_picoadk_v2.menu.flash.4194304_262144.upload.maximum_size=3923968
datanoisetv_picoadk_v2.menu.flash.4194304_262144.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_262144.build.flash_length=3923968
datanoisetv_picoadk_v2.menu.flash.4194304_262144.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_262144.build.fs_start=272359424
datanoisetv_picoadk_v2.menu.flash.4194304_262144.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
datanoisetv_picoadk_v2.menu.flash.4194304_524288.upload.maximum_size=3661824
datanoisetv_picoadk_v2.menu.flash.4194304_524288.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_524288.build.flash_length=3661824
datanoisetv_picoadk_v2.menu.flash.4194304_524288.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_524288.build.fs_start=272097280
datanoisetv_picoadk_v2.menu.flash.4194304_524288.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
datanoisetv_picoadk_v2.menu.flash.4194304_1048576.upload.maximum_size=3137536
datanoisetv_picoadk_v2.menu.flash.4194304_1048576.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_1048576.build.flash_length=3137536
datanoisetv_picoadk_v2.menu.flash.4194304_1048576.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_1048576.build.fs_start=271572992
datanoisetv_picoadk_v2.menu.flash.4194304_1048576.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
datanoisetv_picoadk_v2.menu.flash.4194304_2097152.upload.maximum_size=2088960
datanoisetv_picoadk_v2.menu.flash.4194304_2097152.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_2097152.build.flash_length=2088960
datanoisetv_picoadk_v2.menu.flash.4194304_2097152.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_2097152.build.fs_start=270524416
datanoisetv_picoadk_v2.menu.flash.4194304_2097152.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
datanoisetv_picoadk_v2.menu.flash.4194304_3145728.upload.maximum_size=1040384
datanoisetv_picoadk_v2.menu.flash.4194304_3145728.build.flash_total=4194304
datanoisetv_picoadk_v2.menu.flash.4194304_3145728.build.flash_length=1040384
datanoisetv_picoadk_v2.menu.flash.4194304_3145728.build.eeprom_start=272621568
datanoisetv_picoadk_v2.menu.flash.4194304_3145728.build.fs_start=269475840
datanoisetv_picoadk_v2.menu.flash.4194304_3145728.build.fs_end=272621568
datanoisetv_picoadk_v2.menu.arch.arm=ARM
datanoisetv_picoadk_v2.menu.arch.arm.build.chip=rp2350
datanoisetv_picoadk_v2.menu.arch.arm.build.toolchain=arm-none-eabi
datanoisetv_picoadk_v2.menu.arch.arm.build.toolchainpkg=pqt-gcc
datanoisetv_picoadk_v2.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
datanoisetv_picoadk_v2.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
datanoisetv_picoadk_v2.menu.arch.arm.build.mcu=cortex-m33
datanoisetv_picoadk_v2.menu.arch.riscv=RISC-V
datanoisetv_picoadk_v2.menu.arch.riscv.build.chip=rp2350-riscv
datanoisetv_picoadk_v2.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
datanoisetv_picoadk_v2.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
datanoisetv_picoadk_v2.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
datanoisetv_picoadk_v2.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
datanoisetv_picoadk_v2.menu.arch.riscv.build.mcu=rv32imac
datanoisetv_picoadk_v2.menu.freq.150=150 MHz
datanoisetv_picoadk_v2.menu.freq.150.build.f_cpu=150000000L
datanoisetv_picoadk_v2.menu.freq.50=50 MHz
datanoisetv_picoadk_v2.menu.freq.50.build.f_cpu=50000000L
datanoisetv_picoadk_v2.menu.freq.100=100 MHz
datanoisetv_picoadk_v2.menu.freq.100.build.f_cpu=100000000L
datanoisetv_picoadk_v2.menu.freq.120=120 MHz
datanoisetv_picoadk_v2.menu.freq.120.build.f_cpu=120000000L
datanoisetv_picoadk_v2.menu.freq.125=125 MHz
datanoisetv_picoadk_v2.menu.freq.125.build.f_cpu=125000000L
datanoisetv_picoadk_v2.menu.freq.128=128 MHz
datanoisetv_picoadk_v2.menu.freq.128.build.f_cpu=128000000L
datanoisetv_picoadk_v2.menu.freq.133=133 MHz
datanoisetv_picoadk_v2.menu.freq.133.build.f_cpu=133000000L
datanoisetv_picoadk_v2.menu.freq.176=176 MHz (Overclock)
datanoisetv_picoadk_v2.menu.freq.176.build.f_cpu=176000000L
datanoisetv_picoadk_v2.menu.freq.200=200 MHz (Overclock)
datanoisetv_picoadk_v2.menu.freq.200.build.f_cpu=200000000L
datanoisetv_picoadk_v2.menu.freq.225=225 MHz (Overclock)
datanoisetv_picoadk_v2.menu.freq.225.build.f_cpu=225000000L
datanoisetv_picoadk_v2.menu.freq.240=240 MHz (Overclock)
datanoisetv_picoadk_v2.menu.freq.240.build.f_cpu=240000000L
datanoisetv_picoadk_v2.menu.freq.250=250 MHz (Overclock)
datanoisetv_picoadk_v2.menu.freq.250.build.f_cpu=250000000L
datanoisetv_picoadk_v2.menu.freq.276=276 MHz (Overclock)
datanoisetv_picoadk_v2.menu.freq.276.build.f_cpu=276000000L
datanoisetv_picoadk_v2.menu.freq.300=300 MHz (Overclock)
datanoisetv_picoadk_v2.menu.freq.300.build.f_cpu=300000000L
datanoisetv_picoadk_v2.menu.psram.0mb=0MByte PSRAM
datanoisetv_picoadk_v2.menu.psram.0mb.build.psram_length=0x000000
datanoisetv_picoadk_v2.menu.psram.2mb=2MByte PSRAM
datanoisetv_picoadk_v2.menu.psram.2mb.build.psram_length=0x200000
datanoisetv_picoadk_v2.menu.psram.4mb=4MByte PSRAM
datanoisetv_picoadk_v2.menu.psram.4mb.build.psram_length=0x400000
datanoisetv_picoadk_v2.menu.psram.8mb=8MByte PSRAM
datanoisetv_picoadk_v2.menu.psram.8mb.build.psram_length=0x800000
datanoisetv_picoadk_v2.menu.psramfreq.freq109=109 MHz
datanoisetv_picoadk_v2.menu.psramfreq.freq109.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=109000000
datanoisetv_picoadk_v2.menu.psramfreq.freq133=133 MHz
datanoisetv_picoadk_v2.menu.psramfreq.freq133.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=133000000
datanoisetv_picoadk_v2.menu.opt.Small=Small (-Os) (standard)
datanoisetv_picoadk_v2.menu.opt.Small.build.flags.optimize=-Os
datanoisetv_picoadk_v2.menu.opt.Optimize=Optimize (-O)
datanoisetv_picoadk_v2.menu.opt.Optimize.build.flags.optimize=-O
datanoisetv_picoadk_v2.menu.opt.Optimize2=Optimize More (-O2)
datanoisetv_picoadk_v2.menu.opt.Optimize2.build.flags.optimize=-O2
datanoisetv_picoadk_v2.menu.opt.Optimize3=Optimize Even More (-O3)
datanoisetv_picoadk_v2.menu.opt.Optimize3.build.flags.optimize=-O3
datanoisetv_picoadk_v2.menu.opt.Fast=Fast (-Ofast) (maybe slower)
datanoisetv_picoadk_v2.menu.opt.Fast.build.flags.optimize=-Ofast
datanoisetv_picoadk_v2.menu.opt.Debug=Debug (-Og)
datanoisetv_picoadk_v2.menu.opt.Debug.build.flags.optimize=-Og
datanoisetv_picoadk_v2.menu.opt.Disabled=Disabled (-O0)
datanoisetv_picoadk_v2.menu.opt.Disabled.build.flags.optimize=-O0
datanoisetv_picoadk_v2.menu.profile.Disabled=Disabled
datanoisetv_picoadk_v2.menu.profile.Disabled.build.flags.profile=
datanoisetv_picoadk_v2.menu.profile.Enabled=Enabled
datanoisetv_picoadk_v2.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
datanoisetv_picoadk_v2.menu.rtti.Disabled=Disabled
datanoisetv_picoadk_v2.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
datanoisetv_picoadk_v2.menu.rtti.Enabled=Enabled
datanoisetv_picoadk_v2.menu.rtti.Enabled.build.flags.rtti=
datanoisetv_picoadk_v2.menu.stackprotect.Disabled=Disabled
datanoisetv_picoadk_v2.menu.stackprotect.Disabled.build.flags.stackprotect=
datanoisetv_picoadk_v2.menu.stackprotect.Enabled=Enabled
datanoisetv_picoadk_v2.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
datanoisetv_picoadk_v2.menu.exceptions.Disabled=Disabled
datanoisetv_picoadk_v2.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
datanoisetv_picoadk_v2.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
datanoisetv_picoadk_v2.menu.exceptions.Enabled=Enabled
datanoisetv_picoadk_v2.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
datanoisetv_picoadk_v2.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
datanoisetv_picoadk_v2.menu.dbgport.Disabled=Disabled
datanoisetv_picoadk_v2.menu.dbgport.Disabled.build.debug_port=
datanoisetv_picoadk_v2.menu.dbgport.Serial=Serial
datanoisetv_picoadk_v2.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
datanoisetv_picoadk_v2.menu.dbgport.Serial1=Serial1
datanoisetv_picoadk_v2.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
datanoisetv_picoadk_v2.menu.dbgport.Serial2=Serial2
datanoisetv_picoadk_v2.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
datanoisetv_picoadk_v2.menu.dbgport.SerialSemi=SerialSemi
datanoisetv_picoadk_v2.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
datanoisetv_picoadk_v2.menu.dbglvl.None=None
datanoisetv_picoadk_v2.menu.dbglvl.None.build.debug_level=
datanoisetv_picoadk_v2.menu.dbglvl.Core=Core
datanoisetv_picoadk_v2.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
datanoisetv_picoadk_v2.menu.dbglvl.SPI=SPI
datanoisetv_picoadk_v2.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
datanoisetv_picoadk_v2.menu.dbglvl.Wire=Wire
datanoisetv_picoadk_v2.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
datanoisetv_picoadk_v2.menu.dbglvl.Bluetooth=Bluetooth
datanoisetv_picoadk_v2.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
datanoisetv_picoadk_v2.menu.dbglvl.All=All
datanoisetv_picoadk_v2.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
datanoisetv_picoadk_v2.menu.dbglvl.NDEBUG=NDEBUG
datanoisetv_picoadk_v2.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
datanoisetv_picoadk_v2.menu.usbstack.picosdk=Pico SDK
datanoisetv_picoadk_v2.menu.usbstack.picosdk.build.usbstack_flags=
datanoisetv_picoadk_v2.menu.usbstack.tinyusb=Adafruit TinyUSB
datanoisetv_picoadk_v2.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
datanoisetv_picoadk_v2.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
datanoisetv_picoadk_v2.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
datanoisetv_picoadk_v2.menu.usbstack.nousb=No USB
datanoisetv_picoadk_v2.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4only=IPv4 Only
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
datanoisetv_picoadk_v2.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
datanoisetv_picoadk_v2.menu.uploadmethod.default=Default (UF2)
datanoisetv_picoadk_v2.menu.uploadmethod.default.build.ram_length=512k
datanoisetv_picoadk_v2.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
datanoisetv_picoadk_v2.menu.uploadmethod.default.upload.maximum_data_size=524288
datanoisetv_picoadk_v2.menu.uploadmethod.default.upload.tool=uf2conv
datanoisetv_picoadk_v2.menu.uploadmethod.default.upload.tool.default=uf2conv
datanoisetv_picoadk_v2.menu.uploadmethod.default.upload.tool.network=uf2conv-network
datanoisetv_picoadk_v2.menu.uploadmethod.picotool=Picotool
datanoisetv_picoadk_v2.menu.uploadmethod.picotool.build.ram_length=512k
datanoisetv_picoadk_v2.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
datanoisetv_picoadk_v2.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
datanoisetv_picoadk_v2.menu.uploadmethod.picotool.upload.maximum_data_size=524288
datanoisetv_picoadk_v2.menu.uploadmethod.picotool.upload.tool=picotool
datanoisetv_picoadk_v2.menu.uploadmethod.picotool.upload.tool.default=picotool
datanoisetv_picoadk_v2.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
datanoisetv_picoadk_v2.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
datanoisetv_picoadk_v2.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
