earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# L'atelier d'Arnoz DudesCab
# -----------------------------------
DudesCab.name=L'atelier d'Arnoz DudesCab
DudesCab.vid.0=0x2e8a
DudesCab.pid.0=0x106f
DudesCab.vid.1=0x2e8a
DudesCab.pid.1=0x116f
DudesCab.vid.2=0x2e8a
DudesCab.pid.2=0x506f
DudesCab.vid.3=0x2e8a
DudesCab.pid.3=0x516f
DudesCab.vid.4=0x2e8a
DudesCab.pid.4=0x906f
DudesCab.vid.5=0x2e8a
DudesCab.pid.5=0x916f
DudesCab.vid.6=0x2e8a
DudesCab.pid.6=0xd06f
DudesCab.vid.7=0x2e8a
DudesCab.pid.7=0xd16f
DudesCab.upload_port.0.vid=0x2e8a
DudesCab.upload_port.0.pid=0x106f
DudesCab.upload_port.1.vid=0x2e8a
DudesCab.upload_port.1.pid=0x116f
DudesCab.upload_port.2.vid=0x2e8a
DudesCab.upload_port.2.pid=0x506f
DudesCab.upload_port.3.vid=0x2e8a
DudesCab.upload_port.3.pid=0x516f
DudesCab.upload_port.4.vid=0x2e8a
DudesCab.upload_port.4.pid=0x906f
DudesCab.upload_port.5.vid=0x2e8a
DudesCab.upload_port.5.pid=0x916f
DudesCab.upload_port.6.vid=0x2e8a
DudesCab.upload_port.6.pid=0xd06f
DudesCab.upload_port.7.vid=0x2e8a
DudesCab.upload_port.7.pid=0xd16f
DudesCab.build.usbvid=-DUSBD_VID=0x2e8a
DudesCab.build.usbpid=-DUSBD_PID=0x106f
DudesCab.build.usbpwr=-DUSBD_MAX_POWER_MA=250
DudesCab.build.board=RASPBERRY_PI_PICO
DudesCab.build.mcu=cortex-m0plus
DudesCab.build.chip=rp2040
DudesCab.build.toolchain=arm-none-eabi
DudesCab.build.toolchainpkg=pqt-gcc
DudesCab.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
DudesCab.build.uf2family=--family rp2040
DudesCab.build.variant=DudesCab
DudesCab.upload.maximum_size=4194304
DudesCab.upload.wait_for_upload_port=true
DudesCab.upload.erase_cmd=
DudesCab.serial.disableDTR=false
DudesCab.serial.disableRTS=false
DudesCab.build.f_cpu=125000000
DudesCab.build.led=
DudesCab.build.core=rp2040
DudesCab.build.ldscript=memmap_default.ld
DudesCab.build.boot2=boot2_w25q080_2_padded_checksum
DudesCab.build.usb_manufacturer="L'atelier d'Arnoz"
DudesCab.build.usb_product="DudesCab"
DudesCab.menu.flash.4194304_0=4MB (no FS)
DudesCab.menu.flash.4194304_0.upload.maximum_size=4190208
DudesCab.menu.flash.4194304_0.build.flash_total=4194304
DudesCab.menu.flash.4194304_0.build.flash_length=4190208
DudesCab.menu.flash.4194304_0.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_0.build.fs_start=272625664
DudesCab.menu.flash.4194304_0.build.fs_end=272625664
DudesCab.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
DudesCab.menu.flash.4194304_65536.upload.maximum_size=4124672
DudesCab.menu.flash.4194304_65536.build.flash_total=4194304
DudesCab.menu.flash.4194304_65536.build.flash_length=4124672
DudesCab.menu.flash.4194304_65536.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_65536.build.fs_start=272560128
DudesCab.menu.flash.4194304_65536.build.fs_end=272625664
DudesCab.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
DudesCab.menu.flash.4194304_131072.upload.maximum_size=4059136
DudesCab.menu.flash.4194304_131072.build.flash_total=4194304
DudesCab.menu.flash.4194304_131072.build.flash_length=4059136
DudesCab.menu.flash.4194304_131072.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_131072.build.fs_start=272494592
DudesCab.menu.flash.4194304_131072.build.fs_end=272625664
DudesCab.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
DudesCab.menu.flash.4194304_262144.upload.maximum_size=3928064
DudesCab.menu.flash.4194304_262144.build.flash_total=4194304
DudesCab.menu.flash.4194304_262144.build.flash_length=3928064
DudesCab.menu.flash.4194304_262144.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_262144.build.fs_start=272363520
DudesCab.menu.flash.4194304_262144.build.fs_end=272625664
DudesCab.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
DudesCab.menu.flash.4194304_524288.upload.maximum_size=3665920
DudesCab.menu.flash.4194304_524288.build.flash_total=4194304
DudesCab.menu.flash.4194304_524288.build.flash_length=3665920
DudesCab.menu.flash.4194304_524288.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_524288.build.fs_start=272101376
DudesCab.menu.flash.4194304_524288.build.fs_end=272625664
DudesCab.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
DudesCab.menu.flash.4194304_1048576.upload.maximum_size=3141632
DudesCab.menu.flash.4194304_1048576.build.flash_total=4194304
DudesCab.menu.flash.4194304_1048576.build.flash_length=3141632
DudesCab.menu.flash.4194304_1048576.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_1048576.build.fs_start=271577088
DudesCab.menu.flash.4194304_1048576.build.fs_end=272625664
DudesCab.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
DudesCab.menu.flash.4194304_2097152.upload.maximum_size=2093056
DudesCab.menu.flash.4194304_2097152.build.flash_total=4194304
DudesCab.menu.flash.4194304_2097152.build.flash_length=2093056
DudesCab.menu.flash.4194304_2097152.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_2097152.build.fs_start=270528512
DudesCab.menu.flash.4194304_2097152.build.fs_end=272625664
DudesCab.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
DudesCab.menu.flash.4194304_3145728.upload.maximum_size=1044480
DudesCab.menu.flash.4194304_3145728.build.flash_total=4194304
DudesCab.menu.flash.4194304_3145728.build.flash_length=1044480
DudesCab.menu.flash.4194304_3145728.build.eeprom_start=272625664
DudesCab.menu.flash.4194304_3145728.build.fs_start=269479936
DudesCab.menu.flash.4194304_3145728.build.fs_end=272625664
DudesCab.menu.freq.200=200 MHz
DudesCab.menu.freq.200.build.f_cpu=200000000L
DudesCab.menu.freq.50=50 MHz
DudesCab.menu.freq.50.build.f_cpu=50000000L
DudesCab.menu.freq.100=100 MHz
DudesCab.menu.freq.100.build.f_cpu=100000000L
DudesCab.menu.freq.120=120 MHz
DudesCab.menu.freq.120.build.f_cpu=120000000L
DudesCab.menu.freq.125=125 MHz
DudesCab.menu.freq.125.build.f_cpu=125000000L
DudesCab.menu.freq.128=128 MHz
DudesCab.menu.freq.128.build.f_cpu=128000000L
DudesCab.menu.freq.133=133 MHz
DudesCab.menu.freq.133.build.f_cpu=133000000L
DudesCab.menu.freq.150=150 MHz
DudesCab.menu.freq.150.build.f_cpu=150000000L
DudesCab.menu.freq.176=176 MHz
DudesCab.menu.freq.176.build.f_cpu=176000000L
DudesCab.menu.freq.225=225 MHz (Overclock)
DudesCab.menu.freq.225.build.f_cpu=225000000L
DudesCab.menu.freq.240=240 MHz (Overclock)
DudesCab.menu.freq.240.build.f_cpu=240000000L
DudesCab.menu.freq.250=250 MHz (Overclock)
DudesCab.menu.freq.250.build.f_cpu=250000000L
DudesCab.menu.freq.276=276 MHz (Overclock)
DudesCab.menu.freq.276.build.f_cpu=276000000L
DudesCab.menu.freq.300=300 MHz (Overclock)
DudesCab.menu.freq.300.build.f_cpu=300000000L
DudesCab.menu.opt.Small=Small (-Os) (standard)
DudesCab.menu.opt.Small.build.flags.optimize=-Os
DudesCab.menu.opt.Optimize=Optimize (-O)
DudesCab.menu.opt.Optimize.build.flags.optimize=-O
DudesCab.menu.opt.Optimize2=Optimize More (-O2)
DudesCab.menu.opt.Optimize2.build.flags.optimize=-O2
DudesCab.menu.opt.Optimize3=Optimize Even More (-O3)
DudesCab.menu.opt.Optimize3.build.flags.optimize=-O3
DudesCab.menu.opt.Fast=Fast (-Ofast) (maybe slower)
DudesCab.menu.opt.Fast.build.flags.optimize=-Ofast
DudesCab.menu.opt.Debug=Debug (-Og)
DudesCab.menu.opt.Debug.build.flags.optimize=-Og
DudesCab.menu.opt.Disabled=Disabled (-O0)
DudesCab.menu.opt.Disabled.build.flags.optimize=-O0
DudesCab.menu.profile.Disabled=Disabled
DudesCab.menu.profile.Disabled.build.flags.profile=
DudesCab.menu.profile.Enabled=Enabled
DudesCab.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
DudesCab.menu.rtti.Disabled=Disabled
DudesCab.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
DudesCab.menu.rtti.Enabled=Enabled
DudesCab.menu.rtti.Enabled.build.flags.rtti=
DudesCab.menu.stackprotect.Disabled=Disabled
DudesCab.menu.stackprotect.Disabled.build.flags.stackprotect=
DudesCab.menu.stackprotect.Enabled=Enabled
DudesCab.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
DudesCab.menu.exceptions.Disabled=Disabled
DudesCab.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
DudesCab.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
DudesCab.menu.exceptions.Enabled=Enabled
DudesCab.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
DudesCab.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
DudesCab.menu.dbgport.Disabled=Disabled
DudesCab.menu.dbgport.Disabled.build.debug_port=
DudesCab.menu.dbgport.Serial=Serial
DudesCab.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
DudesCab.menu.dbgport.Serial1=Serial1
DudesCab.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
DudesCab.menu.dbgport.Serial2=Serial2
DudesCab.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
DudesCab.menu.dbgport.SerialSemi=SerialSemi
DudesCab.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
DudesCab.menu.dbglvl.None=None
DudesCab.menu.dbglvl.None.build.debug_level=
DudesCab.menu.dbglvl.Core=Core
DudesCab.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
DudesCab.menu.dbglvl.SPI=SPI
DudesCab.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
DudesCab.menu.dbglvl.Wire=Wire
DudesCab.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
DudesCab.menu.dbglvl.Bluetooth=Bluetooth
DudesCab.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
DudesCab.menu.dbglvl.All=All
DudesCab.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
DudesCab.menu.dbglvl.NDEBUG=NDEBUG
DudesCab.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
DudesCab.menu.usbstack.picosdk=Pico SDK
DudesCab.menu.usbstack.picosdk.build.usbstack_flags=
DudesCab.menu.usbstack.tinyusb=Adafruit TinyUSB
DudesCab.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
DudesCab.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
DudesCab.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
DudesCab.menu.usbstack.nousb=No USB
DudesCab.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
DudesCab.menu.ipbtstack.ipv4only=IPv4 Only
DudesCab.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
DudesCab.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
DudesCab.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
DudesCab.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
DudesCab.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
DudesCab.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
DudesCab.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
DudesCab.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
DudesCab.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
DudesCab.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
DudesCab.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
DudesCab.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
DudesCab.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
DudesCab.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
DudesCab.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
DudesCab.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
DudesCab.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
DudesCab.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
DudesCab.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
DudesCab.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
DudesCab.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
DudesCab.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
DudesCab.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
DudesCab.menu.uploadmethod.default=Default (UF2)
DudesCab.menu.uploadmethod.default.build.ram_length=256k
DudesCab.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
DudesCab.menu.uploadmethod.default.upload.maximum_data_size=262144
DudesCab.menu.uploadmethod.default.upload.tool=uf2conv
DudesCab.menu.uploadmethod.default.upload.tool.default=uf2conv
DudesCab.menu.uploadmethod.default.upload.tool.network=uf2conv-network
DudesCab.menu.uploadmethod.picotool=Picotool
DudesCab.menu.uploadmethod.picotool.build.ram_length=256k
DudesCab.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
DudesCab.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
DudesCab.menu.uploadmethod.picotool.upload.maximum_data_size=262144
DudesCab.menu.uploadmethod.picotool.upload.tool=picotool
DudesCab.menu.uploadmethod.picotool.upload.tool.default=picotool
DudesCab.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
DudesCab.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
DudesCab.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
DudesCab.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
DudesCab.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
DudesCab.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

