earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# EVN Alpha
# -----------------------------------
evn_alpha.name=EVN Alpha
evn_alpha.vid.0=0x2e8a
evn_alpha.pid.0=0xf00a
evn_alpha.vid.1=0x2e8a
evn_alpha.pid.1=0xf10a
evn_alpha.upload_port.0.vid=0x2e8a
evn_alpha.upload_port.0.pid=0xf00a
evn_alpha.upload_port.1.vid=0x2e8a
evn_alpha.upload_port.1.pid=0xf10a
evn_alpha.build.usbvid=-DUSBD_VID=0x2e8a
evn_alpha.build.usbpid=-DUSBD_PID=0xf00a
evn_alpha.build.usbpwr=-DUSBD_MAX_POWER_MA=500
evn_alpha.build.board=EVN_ALPHA
evn_alpha.build.mcu=cortex-m0plus
evn_alpha.build.chip=rp2040
evn_alpha.build.toolchain=arm-none-eabi
evn_alpha.build.toolchainpkg=pqt-gcc
evn_alpha.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
evn_alpha.build.uf2family=--family rp2040
evn_alpha.build.variant=evn_alpha
evn_alpha.upload.maximum_size=16777216
evn_alpha.upload.wait_for_upload_port=true
evn_alpha.upload.erase_cmd=
evn_alpha.serial.disableDTR=false
evn_alpha.serial.disableRTS=false
evn_alpha.build.f_cpu=125000000
evn_alpha.build.led=
evn_alpha.build.core=rp2040
evn_alpha.build.ldscript=memmap_default.ld
evn_alpha.build.boot2=boot2_generic_03h_4_padded_checksum
evn_alpha.build.usb_manufacturer="EVN"
evn_alpha.build.usb_product="Alpha"
evn_alpha.menu.flash.16777216_0=16MB (no FS)
evn_alpha.menu.flash.16777216_0.upload.maximum_size=16773120
evn_alpha.menu.flash.16777216_0.build.flash_total=16777216
evn_alpha.menu.flash.16777216_0.build.flash_length=16773120
evn_alpha.menu.flash.16777216_0.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_0.build.fs_start=285208576
evn_alpha.menu.flash.16777216_0.build.fs_end=285208576
evn_alpha.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
evn_alpha.menu.flash.16777216_65536.upload.maximum_size=16707584
evn_alpha.menu.flash.16777216_65536.build.flash_total=16777216
evn_alpha.menu.flash.16777216_65536.build.flash_length=16707584
evn_alpha.menu.flash.16777216_65536.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_65536.build.fs_start=285143040
evn_alpha.menu.flash.16777216_65536.build.fs_end=285208576
evn_alpha.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
evn_alpha.menu.flash.16777216_131072.upload.maximum_size=16642048
evn_alpha.menu.flash.16777216_131072.build.flash_total=16777216
evn_alpha.menu.flash.16777216_131072.build.flash_length=16642048
evn_alpha.menu.flash.16777216_131072.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_131072.build.fs_start=285077504
evn_alpha.menu.flash.16777216_131072.build.fs_end=285208576
evn_alpha.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
evn_alpha.menu.flash.16777216_262144.upload.maximum_size=16510976
evn_alpha.menu.flash.16777216_262144.build.flash_total=16777216
evn_alpha.menu.flash.16777216_262144.build.flash_length=16510976
evn_alpha.menu.flash.16777216_262144.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_262144.build.fs_start=284946432
evn_alpha.menu.flash.16777216_262144.build.fs_end=285208576
evn_alpha.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
evn_alpha.menu.flash.16777216_524288.upload.maximum_size=16248832
evn_alpha.menu.flash.16777216_524288.build.flash_total=16777216
evn_alpha.menu.flash.16777216_524288.build.flash_length=16248832
evn_alpha.menu.flash.16777216_524288.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_524288.build.fs_start=284684288
evn_alpha.menu.flash.16777216_524288.build.fs_end=285208576
evn_alpha.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
evn_alpha.menu.flash.16777216_1048576.upload.maximum_size=15724544
evn_alpha.menu.flash.16777216_1048576.build.flash_total=16777216
evn_alpha.menu.flash.16777216_1048576.build.flash_length=15724544
evn_alpha.menu.flash.16777216_1048576.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_1048576.build.fs_start=284160000
evn_alpha.menu.flash.16777216_1048576.build.fs_end=285208576
evn_alpha.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
evn_alpha.menu.flash.16777216_2097152.upload.maximum_size=14675968
evn_alpha.menu.flash.16777216_2097152.build.flash_total=16777216
evn_alpha.menu.flash.16777216_2097152.build.flash_length=14675968
evn_alpha.menu.flash.16777216_2097152.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_2097152.build.fs_start=283111424
evn_alpha.menu.flash.16777216_2097152.build.fs_end=285208576
evn_alpha.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
evn_alpha.menu.flash.16777216_3145728.upload.maximum_size=13627392
evn_alpha.menu.flash.16777216_3145728.build.flash_total=16777216
evn_alpha.menu.flash.16777216_3145728.build.flash_length=13627392
evn_alpha.menu.flash.16777216_3145728.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_3145728.build.fs_start=282062848
evn_alpha.menu.flash.16777216_3145728.build.fs_end=285208576
evn_alpha.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
evn_alpha.menu.flash.16777216_4194304.upload.maximum_size=12578816
evn_alpha.menu.flash.16777216_4194304.build.flash_total=16777216
evn_alpha.menu.flash.16777216_4194304.build.flash_length=12578816
evn_alpha.menu.flash.16777216_4194304.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_4194304.build.fs_start=281014272
evn_alpha.menu.flash.16777216_4194304.build.fs_end=285208576
evn_alpha.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
evn_alpha.menu.flash.16777216_5242880.upload.maximum_size=11530240
evn_alpha.menu.flash.16777216_5242880.build.flash_total=16777216
evn_alpha.menu.flash.16777216_5242880.build.flash_length=11530240
evn_alpha.menu.flash.16777216_5242880.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_5242880.build.fs_start=279965696
evn_alpha.menu.flash.16777216_5242880.build.fs_end=285208576
evn_alpha.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
evn_alpha.menu.flash.16777216_6291456.upload.maximum_size=10481664
evn_alpha.menu.flash.16777216_6291456.build.flash_total=16777216
evn_alpha.menu.flash.16777216_6291456.build.flash_length=10481664
evn_alpha.menu.flash.16777216_6291456.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_6291456.build.fs_start=278917120
evn_alpha.menu.flash.16777216_6291456.build.fs_end=285208576
evn_alpha.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
evn_alpha.menu.flash.16777216_7340032.upload.maximum_size=9433088
evn_alpha.menu.flash.16777216_7340032.build.flash_total=16777216
evn_alpha.menu.flash.16777216_7340032.build.flash_length=9433088
evn_alpha.menu.flash.16777216_7340032.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_7340032.build.fs_start=277868544
evn_alpha.menu.flash.16777216_7340032.build.fs_end=285208576
evn_alpha.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
evn_alpha.menu.flash.16777216_8388608.upload.maximum_size=8384512
evn_alpha.menu.flash.16777216_8388608.build.flash_total=16777216
evn_alpha.menu.flash.16777216_8388608.build.flash_length=8384512
evn_alpha.menu.flash.16777216_8388608.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_8388608.build.fs_start=276819968
evn_alpha.menu.flash.16777216_8388608.build.fs_end=285208576
evn_alpha.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
evn_alpha.menu.flash.16777216_9437184.upload.maximum_size=7335936
evn_alpha.menu.flash.16777216_9437184.build.flash_total=16777216
evn_alpha.menu.flash.16777216_9437184.build.flash_length=7335936
evn_alpha.menu.flash.16777216_9437184.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_9437184.build.fs_start=275771392
evn_alpha.menu.flash.16777216_9437184.build.fs_end=285208576
evn_alpha.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
evn_alpha.menu.flash.16777216_10485760.upload.maximum_size=6287360
evn_alpha.menu.flash.16777216_10485760.build.flash_total=16777216
evn_alpha.menu.flash.16777216_10485760.build.flash_length=6287360
evn_alpha.menu.flash.16777216_10485760.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_10485760.build.fs_start=274722816
evn_alpha.menu.flash.16777216_10485760.build.fs_end=285208576
evn_alpha.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
evn_alpha.menu.flash.16777216_11534336.upload.maximum_size=5238784
evn_alpha.menu.flash.16777216_11534336.build.flash_total=16777216
evn_alpha.menu.flash.16777216_11534336.build.flash_length=5238784
evn_alpha.menu.flash.16777216_11534336.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_11534336.build.fs_start=273674240
evn_alpha.menu.flash.16777216_11534336.build.fs_end=285208576
evn_alpha.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
evn_alpha.menu.flash.16777216_12582912.upload.maximum_size=4190208
evn_alpha.menu.flash.16777216_12582912.build.flash_total=16777216
evn_alpha.menu.flash.16777216_12582912.build.flash_length=4190208
evn_alpha.menu.flash.16777216_12582912.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_12582912.build.fs_start=272625664
evn_alpha.menu.flash.16777216_12582912.build.fs_end=285208576
evn_alpha.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
evn_alpha.menu.flash.16777216_13631488.upload.maximum_size=3141632
evn_alpha.menu.flash.16777216_13631488.build.flash_total=16777216
evn_alpha.menu.flash.16777216_13631488.build.flash_length=3141632
evn_alpha.menu.flash.16777216_13631488.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_13631488.build.fs_start=271577088
evn_alpha.menu.flash.16777216_13631488.build.fs_end=285208576
evn_alpha.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
evn_alpha.menu.flash.16777216_14680064.upload.maximum_size=2093056
evn_alpha.menu.flash.16777216_14680064.build.flash_total=16777216
evn_alpha.menu.flash.16777216_14680064.build.flash_length=2093056
evn_alpha.menu.flash.16777216_14680064.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_14680064.build.fs_start=270528512
evn_alpha.menu.flash.16777216_14680064.build.fs_end=285208576
evn_alpha.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
evn_alpha.menu.flash.16777216_15728640.upload.maximum_size=1044480
evn_alpha.menu.flash.16777216_15728640.build.flash_total=16777216
evn_alpha.menu.flash.16777216_15728640.build.flash_length=1044480
evn_alpha.menu.flash.16777216_15728640.build.eeprom_start=285208576
evn_alpha.menu.flash.16777216_15728640.build.fs_start=269479936
evn_alpha.menu.flash.16777216_15728640.build.fs_end=285208576
evn_alpha.menu.freq.200=200 MHz
evn_alpha.menu.freq.200.build.f_cpu=200000000L
evn_alpha.menu.freq.50=50 MHz
evn_alpha.menu.freq.50.build.f_cpu=50000000L
evn_alpha.menu.freq.100=100 MHz
evn_alpha.menu.freq.100.build.f_cpu=100000000L
evn_alpha.menu.freq.120=120 MHz
evn_alpha.menu.freq.120.build.f_cpu=120000000L
evn_alpha.menu.freq.125=125 MHz
evn_alpha.menu.freq.125.build.f_cpu=125000000L
evn_alpha.menu.freq.128=128 MHz
evn_alpha.menu.freq.128.build.f_cpu=128000000L
evn_alpha.menu.freq.133=133 MHz
evn_alpha.menu.freq.133.build.f_cpu=133000000L
evn_alpha.menu.freq.150=150 MHz
evn_alpha.menu.freq.150.build.f_cpu=150000000L
evn_alpha.menu.freq.176=176 MHz
evn_alpha.menu.freq.176.build.f_cpu=176000000L
evn_alpha.menu.freq.225=225 MHz (Overclock)
evn_alpha.menu.freq.225.build.f_cpu=225000000L
evn_alpha.menu.freq.240=240 MHz (Overclock)
evn_alpha.menu.freq.240.build.f_cpu=240000000L
evn_alpha.menu.freq.250=250 MHz (Overclock)
evn_alpha.menu.freq.250.build.f_cpu=250000000L
evn_alpha.menu.freq.276=276 MHz (Overclock)
evn_alpha.menu.freq.276.build.f_cpu=276000000L
evn_alpha.menu.freq.300=300 MHz (Overclock)
evn_alpha.menu.freq.300.build.f_cpu=300000000L
evn_alpha.menu.opt.Small=Small (-Os) (standard)
evn_alpha.menu.opt.Small.build.flags.optimize=-Os
evn_alpha.menu.opt.Optimize=Optimize (-O)
evn_alpha.menu.opt.Optimize.build.flags.optimize=-O
evn_alpha.menu.opt.Optimize2=Optimize More (-O2)
evn_alpha.menu.opt.Optimize2.build.flags.optimize=-O2
evn_alpha.menu.opt.Optimize3=Optimize Even More (-O3)
evn_alpha.menu.opt.Optimize3.build.flags.optimize=-O3
evn_alpha.menu.opt.Fast=Fast (-Ofast) (maybe slower)
evn_alpha.menu.opt.Fast.build.flags.optimize=-Ofast
evn_alpha.menu.opt.Debug=Debug (-Og)
evn_alpha.menu.opt.Debug.build.flags.optimize=-Og
evn_alpha.menu.opt.Disabled=Disabled (-O0)
evn_alpha.menu.opt.Disabled.build.flags.optimize=-O0
evn_alpha.menu.profile.Disabled=Disabled
evn_alpha.menu.profile.Disabled.build.flags.profile=
evn_alpha.menu.profile.Enabled=Enabled
evn_alpha.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
evn_alpha.menu.rtti.Disabled=Disabled
evn_alpha.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
evn_alpha.menu.rtti.Enabled=Enabled
evn_alpha.menu.rtti.Enabled.build.flags.rtti=
evn_alpha.menu.stackprotect.Disabled=Disabled
evn_alpha.menu.stackprotect.Disabled.build.flags.stackprotect=
evn_alpha.menu.stackprotect.Enabled=Enabled
evn_alpha.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
evn_alpha.menu.exceptions.Disabled=Disabled
evn_alpha.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
evn_alpha.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
evn_alpha.menu.exceptions.Enabled=Enabled
evn_alpha.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
evn_alpha.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
evn_alpha.menu.dbgport.Disabled=Disabled
evn_alpha.menu.dbgport.Disabled.build.debug_port=
evn_alpha.menu.dbgport.Serial=Serial
evn_alpha.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
evn_alpha.menu.dbgport.Serial1=Serial1
evn_alpha.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
evn_alpha.menu.dbgport.Serial2=Serial2
evn_alpha.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
evn_alpha.menu.dbgport.SerialSemi=SerialSemi
evn_alpha.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
evn_alpha.menu.dbglvl.None=None
evn_alpha.menu.dbglvl.None.build.debug_level=
evn_alpha.menu.dbglvl.Core=Core
evn_alpha.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
evn_alpha.menu.dbglvl.SPI=SPI
evn_alpha.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
evn_alpha.menu.dbglvl.Wire=Wire
evn_alpha.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
evn_alpha.menu.dbglvl.Bluetooth=Bluetooth
evn_alpha.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
evn_alpha.menu.dbglvl.All=All
evn_alpha.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
evn_alpha.menu.dbglvl.NDEBUG=NDEBUG
evn_alpha.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
evn_alpha.menu.usbstack.picosdk=Pico SDK
evn_alpha.menu.usbstack.picosdk.build.usbstack_flags=
evn_alpha.menu.usbstack.tinyusb=Adafruit TinyUSB
evn_alpha.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
evn_alpha.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
evn_alpha.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
evn_alpha.menu.usbstack.nousb=No USB
evn_alpha.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
evn_alpha.menu.ipbtstack.ipv4only=IPv4 Only
evn_alpha.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
evn_alpha.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
evn_alpha.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
evn_alpha.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
evn_alpha.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
evn_alpha.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
evn_alpha.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
evn_alpha.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
evn_alpha.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
evn_alpha.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
evn_alpha.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
evn_alpha.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
evn_alpha.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
evn_alpha.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
evn_alpha.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
evn_alpha.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
evn_alpha.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
evn_alpha.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
evn_alpha.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
evn_alpha.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
evn_alpha.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
evn_alpha.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
evn_alpha.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
evn_alpha.menu.uploadmethod.default=Default (UF2)
evn_alpha.menu.uploadmethod.default.build.ram_length=256k
evn_alpha.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
evn_alpha.menu.uploadmethod.default.upload.maximum_data_size=262144
evn_alpha.menu.uploadmethod.default.upload.tool=uf2conv
evn_alpha.menu.uploadmethod.default.upload.tool.default=uf2conv
evn_alpha.menu.uploadmethod.default.upload.tool.network=uf2conv-network
evn_alpha.menu.uploadmethod.picotool=Picotool
evn_alpha.menu.uploadmethod.picotool.build.ram_length=256k
evn_alpha.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
evn_alpha.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
evn_alpha.menu.uploadmethod.picotool.upload.maximum_data_size=262144
evn_alpha.menu.uploadmethod.picotool.upload.tool=picotool
evn_alpha.menu.uploadmethod.picotool.upload.tool.default=picotool
evn_alpha.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
