earlephilhower/arduino-pico/boards.txt
evn_alpha.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
evn_alpha.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
evn_alpha.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
evn_alpha.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
evn_alpha.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# ExtremeElectronics RC2040
# -----------------------------------
extelec_rc2040.name=ExtremeElectronics RC2040
extelec_rc2040.vid.0=0x2e8a
extelec_rc2040.pid.0=0xee20
extelec_rc2040.vid.1=0x2e8a
extelec_rc2040.pid.1=0xef20
extelec_rc2040.upload_port.0.vid=0x2e8a
extelec_rc2040.upload_port.0.pid=0xee20
extelec_rc2040.upload_port.1.vid=0x2e8a
extelec_rc2040.upload_port.1.pid=0xef20
extelec_rc2040.build.usbvid=-DUSBD_VID=0x2e8a
extelec_rc2040.build.usbpid=-DUSBD_PID=0xee20
extelec_rc2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250
extelec_rc2040.build.board=EXTREMEELEXTRONICS_RC2040
extelec_rc2040.build.mcu=cortex-m0plus
extelec_rc2040.build.chip=rp2040
extelec_rc2040.build.toolchain=arm-none-eabi
extelec_rc2040.build.toolchainpkg=pqt-gcc
extelec_rc2040.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
extelec_rc2040.build.uf2family=--family rp2040
extelec_rc2040.build.variant=extelec_rc2040
extelec_rc2040.upload.maximum_size=2097152
extelec_rc2040.upload.wait_for_upload_port=true
extelec_rc2040.upload.erase_cmd=
extelec_rc2040.serial.disableDTR=false
extelec_rc2040.serial.disableRTS=false
extelec_rc2040.build.f_cpu=125000000
extelec_rc2040.build.led=
extelec_rc2040.build.core=rp2040
extelec_rc2040.build.ldscript=memmap_default.ld
extelec_rc2040.build.boot2=boot2_w25q080_2_padded_checksum
extelec_rc2040.build.usb_manufacturer="ExtremeElectronics"
extelec_rc2040.build.usb_product="RC2040"
extelec_rc2040.menu.flash.2097152_0=2MB (no FS)
extelec_rc2040.menu.flash.2097152_0.upload.maximum_size=2093056
extelec_rc2040.menu.flash.2097152_0.build.flash_total=2097152
extelec_rc2040.menu.flash.2097152_0.build.flash_length=2093056
extelec_rc2040.menu.flash.2097152_0.build.eeprom_start=270528512
extelec_rc2040.menu.flash.2097152_0.build.fs_start=270528512
extelec_rc2040.menu.flash.2097152_0.build.fs_end=270528512
extelec_rc2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
extelec_rc2040.menu.flash.2097152_65536.upload.maximum_size=2027520
extelec_rc2040.menu.flash.2097152_65536.build.flash_total=2097152
extelec_rc2040.menu.flash.2097152_65536.build.flash_length=2027520
extelec_rc2040.menu.flash.2097152_65536.build.eeprom_start=270528512
extelec_rc2040.menu.flash.2097152_65536.build.fs_start=270462976
extelec_rc2040.menu.flash.2097152_65536.build.fs_end=270528512
extelec_rc2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
extelec_rc2040.menu.flash.2097152_131072.upload.maximum_size=1961984
extelec_rc2040.menu.flash.2097152_131072.build.flash_total=2097152
extelec_rc2040.menu.flash.2097152_131072.build.flash_length=1961984
extelec_rc2040.menu.flash.2097152_131072.build.eeprom_start=270528512
extelec_rc2040.menu.flash.2097152_131072.build.fs_start=270397440
extelec_rc2040.menu.flash.2097152_131072.build.fs_end=270528512
extelec_rc2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
extelec_rc2040.menu.flash.2097152_262144.upload.maximum_size=1830912
extelec_rc2040.menu.flash.2097152_262144.build.flash_total=2097152
extelec_rc2040.menu.flash.2097152_262144.build.flash_length=1830912
extelec_rc2040.menu.flash.2097152_262144.build.eeprom_start=270528512
extelec_rc2040.menu.flash.2097152_262144.build.fs_start=270266368
extelec_rc2040.menu.flash.2097152_262144.build.fs_end=270528512
extelec_rc2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
extelec_rc2040.menu.flash.2097152_524288.upload.maximum_size=1568768
extelec_rc2040.menu.flash.2097152_524288.build.flash_total=2097152
extelec_rc2040.menu.flash.2097152_524288.build.flash_length=1568768
extelec_rc2040.menu.flash.2097152_524288.build.eeprom_start=270528512
extelec_rc2040.menu.flash.2097152_524288.build.fs_start=270004224
extelec_rc2040.menu.flash.2097152_524288.build.fs_end=270528512
extelec_rc2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
extelec_rc2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
extelec_rc2040.menu.flash.2097152_1048576.build.flash_total=2097152
extelec_rc2040.menu.flash.2097152_1048576.build.flash_length=1044480
extelec_rc2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
extelec_rc2040.menu.flash.2097152_1048576.build.fs_start=269479936
extelec_rc2040.menu.flash.2097152_1048576.build.fs_end=270528512
extelec_rc2040.menu.freq.200=200 MHz
extelec_rc2040.menu.freq.200.build.f_cpu=200000000L
extelec_rc2040.menu.freq.50=50 MHz
extelec_rc2040.menu.freq.50.build.f_cpu=50000000L
extelec_rc2040.menu.freq.100=100 MHz
extelec_rc2040.menu.freq.100.build.f_cpu=100000000L
extelec_rc2040.menu.freq.120=120 MHz
extelec_rc2040.menu.freq.120.build.f_cpu=120000000L
extelec_rc2040.menu.freq.125=125 MHz
extelec_rc2040.menu.freq.125.build.f_cpu=125000000L
extelec_rc2040.menu.freq.128=128 MHz
extelec_rc2040.menu.freq.128.build.f_cpu=128000000L
extelec_rc2040.menu.freq.133=133 MHz
extelec_rc2040.menu.freq.133.build.f_cpu=133000000L
extelec_rc2040.menu.freq.150=150 MHz
extelec_rc2040.menu.freq.150.build.f_cpu=150000000L
extelec_rc2040.menu.freq.176=176 MHz
extelec_rc2040.menu.freq.176.build.f_cpu=176000000L
extelec_rc2040.menu.freq.225=225 MHz (Overclock)
extelec_rc2040.menu.freq.225.build.f_cpu=225000000L
extelec_rc2040.menu.freq.240=240 MHz (Overclock)
extelec_rc2040.menu.freq.240.build.f_cpu=240000000L
extelec_rc2040.menu.freq.250=250 MHz (Overclock)
extelec_rc2040.menu.freq.250.build.f_cpu=250000000L
extelec_rc2040.menu.freq.276=276 MHz (Overclock)
extelec_rc2040.menu.freq.276.build.f_cpu=276000000L
extelec_rc2040.menu.freq.300=300 MHz (Overclock)
extelec_rc2040.menu.freq.300.build.f_cpu=300000000L
extelec_rc2040.menu.opt.Small=Small (-Os) (standard)
extelec_rc2040.menu.opt.Small.build.flags.optimize=-Os
extelec_rc2040.menu.opt.Optimize=Optimize (-O)
extelec_rc2040.menu.opt.Optimize.build.flags.optimize=-O
extelec_rc2040.menu.opt.Optimize2=Optimize More (-O2)
extelec_rc2040.menu.opt.Optimize2.build.flags.optimize=-O2
extelec_rc2040.menu.opt.Optimize3=Optimize Even More (-O3)
extelec_rc2040.menu.opt.Optimize3.build.flags.optimize=-O3
extelec_rc2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
extelec_rc2040.menu.opt.Fast.build.flags.optimize=-Ofast
extelec_rc2040.menu.opt.Debug=Debug (-Og)
extelec_rc2040.menu.opt.Debug.build.flags.optimize=-Og
extelec_rc2040.menu.opt.Disabled=Disabled (-O0)
extelec_rc2040.menu.opt.Disabled.build.flags.optimize=-O0
extelec_rc2040.menu.profile.Disabled=Disabled
extelec_rc2040.menu.profile.Disabled.build.flags.profile=
extelec_rc2040.menu.profile.Enabled=Enabled
extelec_rc2040.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
extelec_rc2040.menu.rtti.Disabled=Disabled
extelec_rc2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
extelec_rc2040.menu.rtti.Enabled=Enabled
extelec_rc2040.menu.rtti.Enabled.build.flags.rtti=
extelec_rc2040.menu.stackprotect.Disabled=Disabled
extelec_rc2040.menu.stackprotect.Disabled.build.flags.stackprotect=
extelec_rc2040.menu.stackprotect.Enabled=Enabled
extelec_rc2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
extelec_rc2040.menu.exceptions.Disabled=Disabled
extelec_rc2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
extelec_rc2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
extelec_rc2040.menu.exceptions.Enabled=Enabled
extelec_rc2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
extelec_rc2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
extelec_rc2040.menu.dbgport.Disabled=Disabled
extelec_rc2040.menu.dbgport.Disabled.build.debug_port=
extelec_rc2040.menu.dbgport.Serial=Serial
extelec_rc2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
extelec_rc2040.menu.dbgport.Serial1=Serial1
extelec_rc2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
extelec_rc2040.menu.dbgport.Serial2=Serial2
extelec_rc2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
extelec_rc2040.menu.dbgport.SerialSemi=SerialSemi
extelec_rc2040.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
extelec_rc2040.menu.dbglvl.None=None
extelec_rc2040.menu.dbglvl.None.build.debug_level=
extelec_rc2040.menu.dbglvl.Core=Core
extelec_rc2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
extelec_rc2040.menu.dbglvl.SPI=SPI
extelec_rc2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
extelec_rc2040.menu.dbglvl.Wire=Wire
extelec_rc2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
extelec_rc2040.menu.dbglvl.Bluetooth=Bluetooth
extelec_rc2040.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
extelec_rc2040.menu.dbglvl.All=All
extelec_rc2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
extelec_rc2040.menu.dbglvl.NDEBUG=NDEBUG
extelec_rc2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
extelec_rc2040.menu.usbstack.picosdk=Pico SDK
extelec_rc2040.menu.usbstack.picosdk.build.usbstack_flags=
extelec_rc2040.menu.usbstack.tinyusb=Adafruit TinyUSB
extelec_rc2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
extelec_rc2040.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
extelec_rc2040.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
extelec_rc2040.menu.usbstack.nousb=No USB
extelec_rc2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
extelec_rc2040.menu.ipbtstack.ipv4only=IPv4 Only
extelec_rc2040.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
extelec_rc2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
extelec_rc2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
extelec_rc2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
extelec_rc2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
extelec_rc2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
extelec_rc2040.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
extelec_rc2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
extelec_rc2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
extelec_rc2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
extelec_rc2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
extelec_rc2040.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
extelec_rc2040.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
extelec_rc2040.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
extelec_rc2040.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
extelec_rc2040.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
extelec_rc2040.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
extelec_rc2040.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
extelec_rc2040.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
extelec_rc2040.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
extelec_rc2040.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
extelec_rc2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
extelec_rc2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
extelec_rc2040.menu.uploadmethod.default=Default (UF2)
extelec_rc2040.menu.uploadmethod.default.build.ram_length=256k
extelec_rc2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
extelec_rc2040.menu.uploadmethod.default.upload.maximum_data_size=262144
extelec_rc2040.menu.uploadmethod.default.upload.tool=uf2conv
extelec_rc2040.menu.uploadmethod.default.upload.tool.default=uf2conv
extelec_rc2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
extelec_rc2040.menu.uploadmethod.picotool=Picotool
extelec_rc2040.menu.uploadmethod.picotool.build.ram_length=256k
extelec_rc2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
extelec_rc2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
extelec_rc2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
extelec_rc2040.menu.uploadmethod.picotool.upload.tool=picotool
extelec_rc2040.menu.uploadmethod.picotool.upload.tool.default=picotool
extelec_rc2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
extelec_rc2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
extelec_rc2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
extelec_rc2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
extelec_rc2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
extelec_rc2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

