earlephilhower/arduino-pico/boards.txt
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
challenger_2040_wifi.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
challenger_2040_wifi.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
challenger_2040_wifi.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2040_wifi.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
challenger_2040_wifi.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
challenger_2040_wifi.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
challenger_2040_wifi.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
challenger_2040_wifi.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
challenger_2040_wifi.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi.menu.uploadmethod.default=Default (UF2)
challenger_2040_wifi.menu.uploadmethod.default.build.ram_length=256k
challenger_2040_wifi.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2040_wifi.menu.uploadmethod.default.upload.maximum_data_size=262144
challenger_2040_wifi.menu.uploadmethod.default.upload.tool=uf2conv
challenger_2040_wifi.menu.uploadmethod.default.upload.tool.default=uf2conv
challenger_2040_wifi.menu.uploadmethod.default.upload.tool.network=uf2conv-network
challenger_2040_wifi.menu.uploadmethod.picotool=Picotool
challenger_2040_wifi.menu.uploadmethod.picotool.build.ram_length=256k
challenger_2040_wifi.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
challenger_2040_wifi.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
challenger_2040_wifi.menu.uploadmethod.picotool.upload.maximum_data_size=262144
challenger_2040_wifi.menu.uploadmethod.picotool.upload.tool=picotool
challenger_2040_wifi.menu.uploadmethod.picotool.upload.tool.default=picotool
challenger_2040_wifi.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
challenger_2040_wifi.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
challenger_2040_wifi.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2040_wifi.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
challenger_2040_wifi.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
challenger_2040_wifi.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# iLabs Challenger 2040 WiFi/BLE
# -----------------------------------
challenger_2040_wifi_ble.name=iLabs Challenger 2040 WiFi/BLE
challenger_2040_wifi_ble.vid.0=0x2e8a
challenger_2040_wifi_ble.pid.0=0x102c
challenger_2040_wifi_ble.vid.1=0x2e8a
challenger_2040_wifi_ble.pid.1=0x112c
challenger_2040_wifi_ble.vid.2=0x2e8a
challenger_2040_wifi_ble.pid.2=0x502c
challenger_2040_wifi_ble.vid.3=0x2e8a
challenger_2040_wifi_ble.pid.3=0x512c
challenger_2040_wifi_ble.vid.4=0x2e8a
challenger_2040_wifi_ble.pid.4=0x902c
challenger_2040_wifi_ble.vid.5=0x2e8a
challenger_2040_wifi_ble.pid.5=0x912c
challenger_2040_wifi_ble.vid.6=0x2e8a
challenger_2040_wifi_ble.pid.6=0xd02c
challenger_2040_wifi_ble.vid.7=0x2e8a
challenger_2040_wifi_ble.pid.7=0xd12c
challenger_2040_wifi_ble.upload_port.0.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.0.pid=0x102c
challenger_2040_wifi_ble.upload_port.1.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.1.pid=0x112c
challenger_2040_wifi_ble.upload_port.2.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.2.pid=0x502c
challenger_2040_wifi_ble.upload_port.3.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.3.pid=0x512c
challenger_2040_wifi_ble.upload_port.4.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.4.pid=0x902c
challenger_2040_wifi_ble.upload_port.5.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.5.pid=0x912c
challenger_2040_wifi_ble.upload_port.6.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.6.pid=0xd02c
challenger_2040_wifi_ble.upload_port.7.vid=0x2e8a
challenger_2040_wifi_ble.upload_port.7.pid=0xd12c
challenger_2040_wifi_ble.build.usbvid=-DUSBD_VID=0x2e8a
challenger_2040_wifi_ble.build.usbpid=-DUSBD_PID=0x102c
challenger_2040_wifi_ble.build.usbpwr=-DUSBD_MAX_POWER_MA=500
challenger_2040_wifi_ble.build.board=CHALLENGER_2040_WIFI_BLE_RP2040
challenger_2040_wifi_ble.build.mcu=cortex-m0plus
challenger_2040_wifi_ble.build.chip=rp2040
challenger_2040_wifi_ble.build.toolchain=arm-none-eabi
challenger_2040_wifi_ble.build.toolchainpkg=pqt-gcc
challenger_2040_wifi_ble.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
challenger_2040_wifi_ble.build.uf2family=--family rp2040
challenger_2040_wifi_ble.build.variant=challenger_2040_wifi_ble
challenger_2040_wifi_ble.upload.maximum_size=8388608
challenger_2040_wifi_ble.upload.wait_for_upload_port=true
challenger_2040_wifi_ble.upload.erase_cmd=
challenger_2040_wifi_ble.serial.disableDTR=false
challenger_2040_wifi_ble.serial.disableRTS=false
challenger_2040_wifi_ble.build.f_cpu=125000000
challenger_2040_wifi_ble.build.led=
challenger_2040_wifi_ble.build.core=rp2040
challenger_2040_wifi_ble.build.ldscript=memmap_default.ld
challenger_2040_wifi_ble.build.boot2=boot2_w25q080_2_padded_checksum
challenger_2040_wifi_ble.build.usb_manufacturer="iLabs"
challenger_2040_wifi_ble.build.usb_product="Challenger 2040 WiFi/BLE"
challenger_2040_wifi_ble.menu.espwifitype.esp_at=ESP AT
challenger_2040_wifi_ble.menu.espwifitype.esp_at.build.espwifitype=-DWIFIESPAT2
challenger_2040_wifi_ble.menu.espwifitype.esp_hosted=ESP Hosted
challenger_2040_wifi_ble.menu.espwifitype.esp_hosted.build.espwifitype=-DESPHOSTSPI=SPI1
challenger_2040_wifi_ble.menu.wificountry.worldwide=Worldwide
challenger_2040_wifi_ble.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
challenger_2040_wifi_ble.menu.wificountry.australia=Australia
challenger_2040_wifi_ble.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
challenger_2040_wifi_ble.menu.wificountry.austria=Austria
challenger_2040_wifi_ble.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
challenger_2040_wifi_ble.menu.wificountry.belgium=Belgium
challenger_2040_wifi_ble.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
challenger_2040_wifi_ble.menu.wificountry.brazil=Brazil
challenger_2040_wifi_ble.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
challenger_2040_wifi_ble.menu.wificountry.canada=Canada
challenger_2040_wifi_ble.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
challenger_2040_wifi_ble.menu.wificountry.chile=Chile
challenger_2040_wifi_ble.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
challenger_2040_wifi_ble.menu.wificountry.china=China
challenger_2040_wifi_ble.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
challenger_2040_wifi_ble.menu.wificountry.colombia=Colombia
challenger_2040_wifi_ble.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
challenger_2040_wifi_ble.menu.wificountry.czech_republic=Czech Republic
challenger_2040_wifi_ble.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
challenger_2040_wifi_ble.menu.wificountry.denmark=Denmark
challenger_2040_wifi_ble.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
challenger_2040_wifi_ble.menu.wificountry.estonia=Estonia
challenger_2040_wifi_ble.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
challenger_2040_wifi_ble.menu.wificountry.finland=Finland
challenger_2040_wifi_ble.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
challenger_2040_wifi_ble.menu.wificountry.france=France
challenger_2040_wifi_ble.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
challenger_2040_wifi_ble.menu.wificountry.germany=Germany
challenger_2040_wifi_ble.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
challenger_2040_wifi_ble.menu.wificountry.greece=Greece
challenger_2040_wifi_ble.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
challenger_2040_wifi_ble.menu.wificountry.hong_kong=Hong Kong
challenger_2040_wifi_ble.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
challenger_2040_wifi_ble.menu.wificountry.hungary=Hungary
challenger_2040_wifi_ble.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
challenger_2040_wifi_ble.menu.wificountry.iceland=Iceland
challenger_2040_wifi_ble.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
challenger_2040_wifi_ble.menu.wificountry.india=India
challenger_2040_wifi_ble.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
challenger_2040_wifi_ble.menu.wificountry.israel=Israel
challenger_2040_wifi_ble.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
challenger_2040_wifi_ble.menu.wificountry.italy=Italy
challenger_2040_wifi_ble.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
challenger_2040_wifi_ble.menu.wificountry.japan=Japan
challenger_2040_wifi_ble.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
challenger_2040_wifi_ble.menu.wificountry.kenya=Kenya
challenger_2040_wifi_ble.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
challenger_2040_wifi_ble.menu.wificountry.latvia=Latvia
challenger_2040_wifi_ble.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
challenger_2040_wifi_ble.menu.wificountry.liechtenstein=Liechtenstein
challenger_2040_wifi_ble.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
challenger_2040_wifi_ble.menu.wificountry.lithuania=Lithuania
challenger_2040_wifi_ble.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
challenger_2040_wifi_ble.menu.wificountry.luxembourg=Luxembourg
challenger_2040_wifi_ble.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
challenger_2040_wifi_ble.menu.wificountry.malaysia=Malaysia
challenger_2040_wifi_ble.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
challenger_2040_wifi_ble.menu.wificountry.malta=Malta
challenger_2040_wifi_ble.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
challenger_2040_wifi_ble.menu.wificountry.mexico=Mexico
challenger_2040_wifi_ble.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
challenger_2040_wifi_ble.menu.wificountry.netherlands=Netherlands
challenger_2040_wifi_ble.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
challenger_2040_wifi_ble.menu.wificountry.new_zealand=New Zealand
challenger_2040_wifi_ble.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
challenger_2040_wifi_ble.menu.wificountry.nigeria=Nigeria
challenger_2040_wifi_ble.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
challenger_2040_wifi_ble.menu.wificountry.norway=Norway
challenger_2040_wifi_ble.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
challenger_2040_wifi_ble.menu.wificountry.peru=Peru
challenger_2040_wifi_ble.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
challenger_2040_wifi_ble.menu.wificountry.philippines=Philippines
challenger_2040_wifi_ble.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
challenger_2040_wifi_ble.menu.wificountry.poland=Poland
challenger_2040_wifi_ble.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
challenger_2040_wifi_ble.menu.wificountry.portugal=Portugal
challenger_2040_wifi_ble.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
challenger_2040_wifi_ble.menu.wificountry.singapore=Singapore
challenger_2040_wifi_ble.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
challenger_2040_wifi_ble.menu.wificountry.slovakia=Slovakia
challenger_2040_wifi_ble.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
challenger_2040_wifi_ble.menu.wificountry.slovenia=Slovenia
challenger_2040_wifi_ble.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
challenger_2040_wifi_ble.menu.wificountry.south_africa=South Africa
challenger_2040_wifi_ble.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
challenger_2040_wifi_ble.menu.wificountry.south_korea=South Korea
challenger_2040_wifi_ble.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
challenger_2040_wifi_ble.menu.wificountry.spain=Spain
challenger_2040_wifi_ble.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
challenger_2040_wifi_ble.menu.wificountry.sweden=Sweden
challenger_2040_wifi_ble.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
challenger_2040_wifi_ble.menu.wificountry.switzerland=Switzerland
challenger_2040_wifi_ble.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
challenger_2040_wifi_ble.menu.wificountry.taiwan=Taiwan
challenger_2040_wifi_ble.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
challenger_2040_wifi_ble.menu.wificountry.thailand=Thailand
challenger_2040_wifi_ble.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
challenger_2040_wifi_ble.menu.wificountry.turkey=Turkey
challenger_2040_wifi_ble.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
challenger_2040_wifi_ble.menu.wificountry.uk=UK
challenger_2040_wifi_ble.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
challenger_2040_wifi_ble.menu.wificountry.usa=USA
challenger_2040_wifi_ble.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
challenger_2040_wifi_ble.menu.flash.8388608_0=8MB (no FS)
challenger_2040_wifi_ble.menu.flash.8388608_0.upload.maximum_size=8384512
challenger_2040_wifi_ble.menu.flash.8388608_0.build.flash_total=8388608
challenger_2040_wifi_ble.menu.flash.8388608_0.build.flash_length=8384512
challenger_2040_wifi_ble.menu.flash.8388608_0.build.eeprom_start=276819968
challenger_2040_wifi_ble.menu.flash.8388608_0.build.fs_start=276819968
challenger_2040_wifi_ble.menu.flash.8388608_0.build.fs_end=276819968
challenger_2040_wifi_ble.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
challenger_2040_wifi_ble.menu.flash.8388608_7340032.upload.maximum_size=1044480
challenger_2040_wifi_ble.menu.flash.8388608_7340032.build.flash_total=8388608
challenger_2040_wifi_ble.menu.flash.8388608_7340032.build.flash_length=1044480
challenger_2040_wifi_ble.menu.flash.8388608_7340032.build.eeprom_start=276819968
challenger_2040_wifi_ble.menu.flash.8388608_7340032.build.fs_start=269479936
challenger_2040_wifi_ble.menu.flash.8388608_7340032.build.fs_end=276819968
challenger_2040_wifi_ble.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
challenger_2040_wifi_ble.menu.flash.8388608_4194304.upload.maximum_size=4190208
challenger_2040_wifi_ble.menu.flash.8388608_4194304.build.flash_total=8388608
challenger_2040_wifi_ble.menu.flash.8388608_4194304.build.flash_length=4190208
challenger_2040_wifi_ble.menu.flash.8388608_4194304.build.eeprom_start=276819968
challenger_2040_wifi_ble.menu.flash.8388608_4194304.build.fs_start=272625664
challenger_2040_wifi_ble.menu.flash.8388608_4194304.build.fs_end=276819968
challenger_2040_wifi_ble.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
challenger_2040_wifi_ble.menu.flash.8388608_2097152.upload.maximum_size=6287360
challenger_2040_wifi_ble.menu.flash.8388608_2097152.build.flash_total=8388608
challenger_2040_wifi_ble.menu.flash.8388608_2097152.build.flash_length=6287360
challenger_2040_wifi_ble.menu.flash.8388608_2097152.build.eeprom_start=276819968
challenger_2040_wifi_ble.menu.flash.8388608_2097152.build.fs_start=274722816
challenger_2040_wifi_ble.menu.flash.8388608_2097152.build.fs_end=276819968
challenger_2040_wifi_ble.menu.flash.16777216_0=16MB (no FS)
challenger_2040_wifi_ble.menu.flash.16777216_0.upload.maximum_size=16773120
challenger_2040_wifi_ble.menu.flash.16777216_0.build.flash_total=16777216
challenger_2040_wifi_ble.menu.flash.16777216_0.build.flash_length=16773120
challenger_2040_wifi_ble.menu.flash.16777216_0.build.eeprom_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_0.build.fs_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_0.build.fs_end=285208576
challenger_2040_wifi_ble.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
challenger_2040_wifi_ble.menu.flash.16777216_15728640.upload.maximum_size=1044480
challenger_2040_wifi_ble.menu.flash.16777216_15728640.build.flash_total=16777216
challenger_2040_wifi_ble.menu.flash.16777216_15728640.build.flash_length=1044480
challenger_2040_wifi_ble.menu.flash.16777216_15728640.build.eeprom_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_15728640.build.fs_start=269479936
challenger_2040_wifi_ble.menu.flash.16777216_15728640.build.fs_end=285208576
challenger_2040_wifi_ble.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
challenger_2040_wifi_ble.menu.flash.16777216_14680064.upload.maximum_size=2093056
