earlephilhower/arduino-pico/boards.txt
challenger_2040_wifi_ble.menu.flash.16777216_14680064.build.flash_total=16777216
challenger_2040_wifi_ble.menu.flash.16777216_14680064.build.flash_length=2093056
challenger_2040_wifi_ble.menu.flash.16777216_14680064.build.eeprom_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_14680064.build.fs_start=270528512
challenger_2040_wifi_ble.menu.flash.16777216_14680064.build.fs_end=285208576
challenger_2040_wifi_ble.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
challenger_2040_wifi_ble.menu.flash.16777216_12582912.upload.maximum_size=4190208
challenger_2040_wifi_ble.menu.flash.16777216_12582912.build.flash_total=16777216
challenger_2040_wifi_ble.menu.flash.16777216_12582912.build.flash_length=4190208
challenger_2040_wifi_ble.menu.flash.16777216_12582912.build.eeprom_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_12582912.build.fs_start=272625664
challenger_2040_wifi_ble.menu.flash.16777216_12582912.build.fs_end=285208576
challenger_2040_wifi_ble.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
challenger_2040_wifi_ble.menu.flash.16777216_8388608.upload.maximum_size=8384512
challenger_2040_wifi_ble.menu.flash.16777216_8388608.build.flash_total=16777216
challenger_2040_wifi_ble.menu.flash.16777216_8388608.build.flash_length=8384512
challenger_2040_wifi_ble.menu.flash.16777216_8388608.build.eeprom_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_8388608.build.fs_start=276819968
challenger_2040_wifi_ble.menu.flash.16777216_8388608.build.fs_end=285208576
challenger_2040_wifi_ble.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
challenger_2040_wifi_ble.menu.flash.16777216_4194304.upload.maximum_size=12578816
challenger_2040_wifi_ble.menu.flash.16777216_4194304.build.flash_total=16777216
challenger_2040_wifi_ble.menu.flash.16777216_4194304.build.flash_length=12578816
challenger_2040_wifi_ble.menu.flash.16777216_4194304.build.eeprom_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_4194304.build.fs_start=281014272
challenger_2040_wifi_ble.menu.flash.16777216_4194304.build.fs_end=285208576
challenger_2040_wifi_ble.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
challenger_2040_wifi_ble.menu.flash.16777216_2097152.upload.maximum_size=14675968
challenger_2040_wifi_ble.menu.flash.16777216_2097152.build.flash_total=16777216
challenger_2040_wifi_ble.menu.flash.16777216_2097152.build.flash_length=14675968
challenger_2040_wifi_ble.menu.flash.16777216_2097152.build.eeprom_start=285208576
challenger_2040_wifi_ble.menu.flash.16777216_2097152.build.fs_start=283111424
challenger_2040_wifi_ble.menu.flash.16777216_2097152.build.fs_end=285208576
challenger_2040_wifi_ble.menu.freq.200=200 MHz
challenger_2040_wifi_ble.menu.freq.200.build.f_cpu=200000000L
challenger_2040_wifi_ble.menu.freq.50=50 MHz
challenger_2040_wifi_ble.menu.freq.50.build.f_cpu=50000000L
challenger_2040_wifi_ble.menu.freq.100=100 MHz
challenger_2040_wifi_ble.menu.freq.100.build.f_cpu=100000000L
challenger_2040_wifi_ble.menu.freq.120=120 MHz
challenger_2040_wifi_ble.menu.freq.120.build.f_cpu=120000000L
challenger_2040_wifi_ble.menu.freq.125=125 MHz
challenger_2040_wifi_ble.menu.freq.125.build.f_cpu=125000000L
challenger_2040_wifi_ble.menu.freq.128=128 MHz
challenger_2040_wifi_ble.menu.freq.128.build.f_cpu=128000000L
challenger_2040_wifi_ble.menu.freq.133=133 MHz
challenger_2040_wifi_ble.menu.freq.133.build.f_cpu=133000000L
challenger_2040_wifi_ble.menu.freq.150=150 MHz
challenger_2040_wifi_ble.menu.freq.150.build.f_cpu=150000000L
challenger_2040_wifi_ble.menu.freq.176=176 MHz
challenger_2040_wifi_ble.menu.freq.176.build.f_cpu=176000000L
challenger_2040_wifi_ble.menu.freq.225=225 MHz (Overclock)
challenger_2040_wifi_ble.menu.freq.225.build.f_cpu=225000000L
challenger_2040_wifi_ble.menu.freq.240=240 MHz (Overclock)
challenger_2040_wifi_ble.menu.freq.240.build.f_cpu=240000000L
challenger_2040_wifi_ble.menu.freq.250=250 MHz (Overclock)
challenger_2040_wifi_ble.menu.freq.250.build.f_cpu=250000000L
challenger_2040_wifi_ble.menu.freq.276=276 MHz (Overclock)
challenger_2040_wifi_ble.menu.freq.276.build.f_cpu=276000000L
challenger_2040_wifi_ble.menu.freq.300=300 MHz (Overclock)
challenger_2040_wifi_ble.menu.freq.300.build.f_cpu=300000000L
challenger_2040_wifi_ble.menu.opt.Small=Small (-Os) (standard)
challenger_2040_wifi_ble.menu.opt.Small.build.flags.optimize=-Os
challenger_2040_wifi_ble.menu.opt.Optimize=Optimize (-O)
challenger_2040_wifi_ble.menu.opt.Optimize.build.flags.optimize=-O
challenger_2040_wifi_ble.menu.opt.Optimize2=Optimize More (-O2)
challenger_2040_wifi_ble.menu.opt.Optimize2.build.flags.optimize=-O2
challenger_2040_wifi_ble.menu.opt.Optimize3=Optimize Even More (-O3)
challenger_2040_wifi_ble.menu.opt.Optimize3.build.flags.optimize=-O3
challenger_2040_wifi_ble.menu.opt.Fast=Fast (-Ofast) (maybe slower)
challenger_2040_wifi_ble.menu.opt.Fast.build.flags.optimize=-Ofast
challenger_2040_wifi_ble.menu.opt.Debug=Debug (-Og)
challenger_2040_wifi_ble.menu.opt.Debug.build.flags.optimize=-Og
challenger_2040_wifi_ble.menu.opt.Disabled=Disabled (-O0)
challenger_2040_wifi_ble.menu.opt.Disabled.build.flags.optimize=-O0
challenger_2040_wifi_ble.menu.profile.Disabled=Disabled
challenger_2040_wifi_ble.menu.profile.Disabled.build.flags.profile=
challenger_2040_wifi_ble.menu.profile.Enabled=Enabled
challenger_2040_wifi_ble.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
challenger_2040_wifi_ble.menu.rtti.Disabled=Disabled
challenger_2040_wifi_ble.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
challenger_2040_wifi_ble.menu.rtti.Enabled=Enabled
challenger_2040_wifi_ble.menu.rtti.Enabled.build.flags.rtti=
challenger_2040_wifi_ble.menu.stackprotect.Disabled=Disabled
challenger_2040_wifi_ble.menu.stackprotect.Disabled.build.flags.stackprotect=
challenger_2040_wifi_ble.menu.stackprotect.Enabled=Enabled
challenger_2040_wifi_ble.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
challenger_2040_wifi_ble.menu.exceptions.Disabled=Disabled
challenger_2040_wifi_ble.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
challenger_2040_wifi_ble.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
challenger_2040_wifi_ble.menu.exceptions.Enabled=Enabled
challenger_2040_wifi_ble.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
challenger_2040_wifi_ble.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
challenger_2040_wifi_ble.menu.dbgport.Disabled=Disabled
challenger_2040_wifi_ble.menu.dbgport.Disabled.build.debug_port=
challenger_2040_wifi_ble.menu.dbgport.Serial=Serial
challenger_2040_wifi_ble.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
challenger_2040_wifi_ble.menu.dbgport.Serial1=Serial1
challenger_2040_wifi_ble.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
challenger_2040_wifi_ble.menu.dbgport.Serial2=Serial2
challenger_2040_wifi_ble.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
challenger_2040_wifi_ble.menu.dbgport.SerialSemi=SerialSemi
challenger_2040_wifi_ble.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
challenger_2040_wifi_ble.menu.dbglvl.None=None
challenger_2040_wifi_ble.menu.dbglvl.None.build.debug_level=
challenger_2040_wifi_ble.menu.dbglvl.Core=Core
challenger_2040_wifi_ble.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
challenger_2040_wifi_ble.menu.dbglvl.SPI=SPI
challenger_2040_wifi_ble.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
challenger_2040_wifi_ble.menu.dbglvl.Wire=Wire
challenger_2040_wifi_ble.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
challenger_2040_wifi_ble.menu.dbglvl.Bluetooth=Bluetooth
challenger_2040_wifi_ble.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
challenger_2040_wifi_ble.menu.dbglvl.All=All
challenger_2040_wifi_ble.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
challenger_2040_wifi_ble.menu.dbglvl.NDEBUG=NDEBUG
challenger_2040_wifi_ble.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
challenger_2040_wifi_ble.menu.usbstack.picosdk=Pico SDK
challenger_2040_wifi_ble.menu.usbstack.picosdk.build.usbstack_flags=
challenger_2040_wifi_ble.menu.usbstack.tinyusb=Adafruit TinyUSB
challenger_2040_wifi_ble.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
challenger_2040_wifi_ble.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
challenger_2040_wifi_ble.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
challenger_2040_wifi_ble.menu.usbstack.nousb=No USB
challenger_2040_wifi_ble.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
challenger_2040_wifi_ble.menu.ipbtstack.ipv4only=IPv4 Only
challenger_2040_wifi_ble.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
challenger_2040_wifi_ble.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
challenger_2040_wifi_ble.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2040_wifi_ble.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
challenger_2040_wifi_ble.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi_ble.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
challenger_2040_wifi_ble.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
challenger_2040_wifi_ble.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2040_wifi_ble.menu.uploadmethod.default=Default (UF2)
challenger_2040_wifi_ble.menu.uploadmethod.default.build.ram_length=256k
challenger_2040_wifi_ble.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2040_wifi_ble.menu.uploadmethod.default.upload.maximum_data_size=262144
challenger_2040_wifi_ble.menu.uploadmethod.default.upload.tool=uf2conv
challenger_2040_wifi_ble.menu.uploadmethod.default.upload.tool.default=uf2conv
challenger_2040_wifi_ble.menu.uploadmethod.default.upload.tool.network=uf2conv-network
challenger_2040_wifi_ble.menu.uploadmethod.picotool=Picotool
challenger_2040_wifi_ble.menu.uploadmethod.picotool.build.ram_length=256k
challenger_2040_wifi_ble.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
challenger_2040_wifi_ble.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
challenger_2040_wifi_ble.menu.uploadmethod.picotool.upload.maximum_data_size=262144
challenger_2040_wifi_ble.menu.uploadmethod.picotool.upload.tool=picotool
challenger_2040_wifi_ble.menu.uploadmethod.picotool.upload.tool.default=picotool
challenger_2040_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
challenger_2040_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
challenger_2040_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2040_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
challenger_2040_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
challenger_2040_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

