earlephilhower/arduino-pico/boards.txt
connectivity_2040_lte_wifi_ble.menu.exceptions.Disabled=Disabled
connectivity_2040_lte_wifi_ble.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
connectivity_2040_lte_wifi_ble.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
connectivity_2040_lte_wifi_ble.menu.exceptions.Enabled=Enabled
connectivity_2040_lte_wifi_ble.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
connectivity_2040_lte_wifi_ble.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
connectivity_2040_lte_wifi_ble.menu.dbgport.Disabled=Disabled
connectivity_2040_lte_wifi_ble.menu.dbgport.Disabled.build.debug_port=
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial=Serial
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial1=Serial1
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial2=Serial2
connectivity_2040_lte_wifi_ble.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
connectivity_2040_lte_wifi_ble.menu.dbgport.SerialSemi=SerialSemi
connectivity_2040_lte_wifi_ble.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
connectivity_2040_lte_wifi_ble.menu.dbglvl.None=None
connectivity_2040_lte_wifi_ble.menu.dbglvl.None.build.debug_level=
connectivity_2040_lte_wifi_ble.menu.dbglvl.Core=Core
connectivity_2040_lte_wifi_ble.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
connectivity_2040_lte_wifi_ble.menu.dbglvl.SPI=SPI
connectivity_2040_lte_wifi_ble.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
connectivity_2040_lte_wifi_ble.menu.dbglvl.Wire=Wire
connectivity_2040_lte_wifi_ble.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
connectivity_2040_lte_wifi_ble.menu.dbglvl.Bluetooth=Bluetooth
connectivity_2040_lte_wifi_ble.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
connectivity_2040_lte_wifi_ble.menu.dbglvl.All=All
connectivity_2040_lte_wifi_ble.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
connectivity_2040_lte_wifi_ble.menu.dbglvl.NDEBUG=NDEBUG
connectivity_2040_lte_wifi_ble.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
connectivity_2040_lte_wifi_ble.menu.usbstack.picosdk=Pico SDK
connectivity_2040_lte_wifi_ble.menu.usbstack.picosdk.build.usbstack_flags=
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb=Adafruit TinyUSB
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
connectivity_2040_lte_wifi_ble.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
connectivity_2040_lte_wifi_ble.menu.usbstack.nousb=No USB
connectivity_2040_lte_wifi_ble.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4only=IPv4 Only
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
connectivity_2040_lte_wifi_ble.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
connectivity_2040_lte_wifi_ble.menu.uploadmethod.default=Default (UF2)
connectivity_2040_lte_wifi_ble.menu.uploadmethod.default.build.ram_length=256k
connectivity_2040_lte_wifi_ble.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
connectivity_2040_lte_wifi_ble.menu.uploadmethod.default.upload.maximum_data_size=262144
connectivity_2040_lte_wifi_ble.menu.uploadmethod.default.upload.tool=uf2conv
connectivity_2040_lte_wifi_ble.menu.uploadmethod.default.upload.tool.default=uf2conv
connectivity_2040_lte_wifi_ble.menu.uploadmethod.default.upload.tool.network=uf2conv-network
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picotool=Picotool
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picotool.build.ram_length=256k
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picotool.upload.maximum_data_size=262144
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picotool.upload.tool=picotool
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picotool.upload.tool.default=picotool
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
connectivity_2040_lte_wifi_ble.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

