earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# iLabs RPICO32
# -----------------------------------
ilabs_rpico32.name=iLabs RPICO32
ilabs_rpico32.vid.0=0x2e8a
ilabs_rpico32.pid.0=0x1010
ilabs_rpico32.vid.1=0x2e8a
ilabs_rpico32.pid.1=0x1110
ilabs_rpico32.vid.2=0x2e8a
ilabs_rpico32.pid.2=0x5010
ilabs_rpico32.vid.3=0x2e8a
ilabs_rpico32.pid.3=0x5110
ilabs_rpico32.vid.4=0x2e8a
ilabs_rpico32.pid.4=0x9010
ilabs_rpico32.vid.5=0x2e8a
ilabs_rpico32.pid.5=0x9110
ilabs_rpico32.vid.6=0x2e8a
ilabs_rpico32.pid.6=0xd010
ilabs_rpico32.vid.7=0x2e8a
ilabs_rpico32.pid.7=0xd110
ilabs_rpico32.upload_port.0.vid=0x2e8a
ilabs_rpico32.upload_port.0.pid=0x1010
ilabs_rpico32.upload_port.1.vid=0x2e8a
ilabs_rpico32.upload_port.1.pid=0x1110
ilabs_rpico32.upload_port.2.vid=0x2e8a
ilabs_rpico32.upload_port.2.pid=0x5010
ilabs_rpico32.upload_port.3.vid=0x2e8a
ilabs_rpico32.upload_port.3.pid=0x5110
ilabs_rpico32.upload_port.4.vid=0x2e8a
ilabs_rpico32.upload_port.4.pid=0x9010
ilabs_rpico32.upload_port.5.vid=0x2e8a
ilabs_rpico32.upload_port.5.pid=0x9110
ilabs_rpico32.upload_port.6.vid=0x2e8a
ilabs_rpico32.upload_port.6.pid=0xd010
ilabs_rpico32.upload_port.7.vid=0x2e8a
ilabs_rpico32.upload_port.7.pid=0xd110
ilabs_rpico32.build.usbvid=-DUSBD_VID=0x2e8a
ilabs_rpico32.build.usbpid=-DUSBD_PID=0x1010
ilabs_rpico32.build.usbpwr=-DUSBD_MAX_POWER_MA=250
ilabs_rpico32.build.board=ILABS_2040_RPICO32_RP2040
ilabs_rpico32.build.mcu=cortex-m0plus
ilabs_rpico32.build.chip=rp2040
ilabs_rpico32.build.toolchain=arm-none-eabi
ilabs_rpico32.build.toolchainpkg=pqt-gcc
ilabs_rpico32.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
ilabs_rpico32.build.uf2family=--family rp2040
ilabs_rpico32.build.variant=ilabs_rpico32
ilabs_rpico32.upload.maximum_size=8388608
ilabs_rpico32.upload.wait_for_upload_port=true
ilabs_rpico32.upload.erase_cmd=
ilabs_rpico32.serial.disableDTR=false
ilabs_rpico32.serial.disableRTS=false
ilabs_rpico32.build.f_cpu=125000000
ilabs_rpico32.build.led=
ilabs_rpico32.build.core=rp2040
ilabs_rpico32.build.ldscript=memmap_default.ld
ilabs_rpico32.build.boot2=boot2_w25q080_2_padded_checksum
ilabs_rpico32.build.usb_manufacturer="iLabs"
ilabs_rpico32.build.usb_product="RPICO32"
ilabs_rpico32.build.extra_flags=-DWIFIESPAT2
ilabs_rpico32.menu.flash.8388608_0=8MB (no FS)
ilabs_rpico32.menu.flash.8388608_0.upload.maximum_size=8384512
ilabs_rpico32.menu.flash.8388608_0.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_0.build.flash_length=8384512
ilabs_rpico32.menu.flash.8388608_0.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_0.build.fs_start=276819968
ilabs_rpico32.menu.flash.8388608_0.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
ilabs_rpico32.menu.flash.8388608_65536.upload.maximum_size=8318976
ilabs_rpico32.menu.flash.8388608_65536.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_65536.build.flash_length=8318976
ilabs_rpico32.menu.flash.8388608_65536.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_65536.build.fs_start=276754432
ilabs_rpico32.menu.flash.8388608_65536.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
ilabs_rpico32.menu.flash.8388608_131072.upload.maximum_size=8253440
ilabs_rpico32.menu.flash.8388608_131072.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_131072.build.flash_length=8253440
ilabs_rpico32.menu.flash.8388608_131072.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_131072.build.fs_start=276688896
ilabs_rpico32.menu.flash.8388608_131072.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
ilabs_rpico32.menu.flash.8388608_262144.upload.maximum_size=8122368
ilabs_rpico32.menu.flash.8388608_262144.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_262144.build.flash_length=8122368
ilabs_rpico32.menu.flash.8388608_262144.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_262144.build.fs_start=276557824
ilabs_rpico32.menu.flash.8388608_262144.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
ilabs_rpico32.menu.flash.8388608_524288.upload.maximum_size=7860224
ilabs_rpico32.menu.flash.8388608_524288.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_524288.build.flash_length=7860224
ilabs_rpico32.menu.flash.8388608_524288.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_524288.build.fs_start=276295680
ilabs_rpico32.menu.flash.8388608_524288.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
ilabs_rpico32.menu.flash.8388608_1048576.upload.maximum_size=7335936
ilabs_rpico32.menu.flash.8388608_1048576.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_1048576.build.flash_length=7335936
ilabs_rpico32.menu.flash.8388608_1048576.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_1048576.build.fs_start=275771392
ilabs_rpico32.menu.flash.8388608_1048576.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
ilabs_rpico32.menu.flash.8388608_2097152.upload.maximum_size=6287360
ilabs_rpico32.menu.flash.8388608_2097152.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_2097152.build.flash_length=6287360
ilabs_rpico32.menu.flash.8388608_2097152.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_2097152.build.fs_start=274722816
ilabs_rpico32.menu.flash.8388608_2097152.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
ilabs_rpico32.menu.flash.8388608_3145728.upload.maximum_size=5238784
ilabs_rpico32.menu.flash.8388608_3145728.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_3145728.build.flash_length=5238784
ilabs_rpico32.menu.flash.8388608_3145728.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_3145728.build.fs_start=273674240
ilabs_rpico32.menu.flash.8388608_3145728.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
ilabs_rpico32.menu.flash.8388608_4194304.upload.maximum_size=4190208
ilabs_rpico32.menu.flash.8388608_4194304.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_4194304.build.flash_length=4190208
ilabs_rpico32.menu.flash.8388608_4194304.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_4194304.build.fs_start=272625664
ilabs_rpico32.menu.flash.8388608_4194304.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
ilabs_rpico32.menu.flash.8388608_5242880.upload.maximum_size=3141632
ilabs_rpico32.menu.flash.8388608_5242880.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_5242880.build.flash_length=3141632
ilabs_rpico32.menu.flash.8388608_5242880.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_5242880.build.fs_start=271577088
ilabs_rpico32.menu.flash.8388608_5242880.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
ilabs_rpico32.menu.flash.8388608_6291456.upload.maximum_size=2093056
ilabs_rpico32.menu.flash.8388608_6291456.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_6291456.build.flash_length=2093056
ilabs_rpico32.menu.flash.8388608_6291456.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_6291456.build.fs_start=270528512
ilabs_rpico32.menu.flash.8388608_6291456.build.fs_end=276819968
ilabs_rpico32.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
ilabs_rpico32.menu.flash.8388608_7340032.upload.maximum_size=1044480
ilabs_rpico32.menu.flash.8388608_7340032.build.flash_total=8388608
ilabs_rpico32.menu.flash.8388608_7340032.build.flash_length=1044480
ilabs_rpico32.menu.flash.8388608_7340032.build.eeprom_start=276819968
ilabs_rpico32.menu.flash.8388608_7340032.build.fs_start=269479936
ilabs_rpico32.menu.flash.8388608_7340032.build.fs_end=276819968
ilabs_rpico32.menu.freq.200=200 MHz
ilabs_rpico32.menu.freq.200.build.f_cpu=200000000L
ilabs_rpico32.menu.freq.50=50 MHz
ilabs_rpico32.menu.freq.50.build.f_cpu=50000000L
ilabs_rpico32.menu.freq.100=100 MHz
ilabs_rpico32.menu.freq.100.build.f_cpu=100000000L
ilabs_rpico32.menu.freq.120=120 MHz
ilabs_rpico32.menu.freq.120.build.f_cpu=120000000L
ilabs_rpico32.menu.freq.125=125 MHz
ilabs_rpico32.menu.freq.125.build.f_cpu=125000000L
ilabs_rpico32.menu.freq.128=128 MHz
ilabs_rpico32.menu.freq.128.build.f_cpu=128000000L
ilabs_rpico32.menu.freq.133=133 MHz
ilabs_rpico32.menu.freq.133.build.f_cpu=133000000L
ilabs_rpico32.menu.freq.150=150 MHz
ilabs_rpico32.menu.freq.150.build.f_cpu=150000000L
ilabs_rpico32.menu.freq.176=176 MHz
ilabs_rpico32.menu.freq.176.build.f_cpu=176000000L
ilabs_rpico32.menu.freq.225=225 MHz (Overclock)
ilabs_rpico32.menu.freq.225.build.f_cpu=225000000L
ilabs_rpico32.menu.freq.240=240 MHz (Overclock)
ilabs_rpico32.menu.freq.240.build.f_cpu=240000000L
ilabs_rpico32.menu.freq.250=250 MHz (Overclock)
ilabs_rpico32.menu.freq.250.build.f_cpu=250000000L
ilabs_rpico32.menu.freq.276=276 MHz (Overclock)
ilabs_rpico32.menu.freq.276.build.f_cpu=276000000L
ilabs_rpico32.menu.freq.300=300 MHz (Overclock)
ilabs_rpico32.menu.freq.300.build.f_cpu=300000000L
ilabs_rpico32.menu.opt.Small=Small (-Os) (standard)
ilabs_rpico32.menu.opt.Small.build.flags.optimize=-Os
ilabs_rpico32.menu.opt.Optimize=Optimize (-O)
ilabs_rpico32.menu.opt.Optimize.build.flags.optimize=-O
ilabs_rpico32.menu.opt.Optimize2=Optimize More (-O2)
ilabs_rpico32.menu.opt.Optimize2.build.flags.optimize=-O2
ilabs_rpico32.menu.opt.Optimize3=Optimize Even More (-O3)
ilabs_rpico32.menu.opt.Optimize3.build.flags.optimize=-O3
ilabs_rpico32.menu.opt.Fast=Fast (-Ofast) (maybe slower)
ilabs_rpico32.menu.opt.Fast.build.flags.optimize=-Ofast
ilabs_rpico32.menu.opt.Debug=Debug (-Og)
ilabs_rpico32.menu.opt.Debug.build.flags.optimize=-Og
ilabs_rpico32.menu.opt.Disabled=Disabled (-O0)
ilabs_rpico32.menu.opt.Disabled.build.flags.optimize=-O0
ilabs_rpico32.menu.profile.Disabled=Disabled
ilabs_rpico32.menu.profile.Disabled.build.flags.profile=
ilabs_rpico32.menu.profile.Enabled=Enabled
ilabs_rpico32.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
ilabs_rpico32.menu.rtti.Disabled=Disabled
ilabs_rpico32.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
ilabs_rpico32.menu.rtti.Enabled=Enabled
ilabs_rpico32.menu.rtti.Enabled.build.flags.rtti=
ilabs_rpico32.menu.stackprotect.Disabled=Disabled
ilabs_rpico32.menu.stackprotect.Disabled.build.flags.stackprotect=
ilabs_rpico32.menu.stackprotect.Enabled=Enabled
ilabs_rpico32.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
ilabs_rpico32.menu.exceptions.Disabled=Disabled
ilabs_rpico32.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
ilabs_rpico32.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
ilabs_rpico32.menu.exceptions.Enabled=Enabled
ilabs_rpico32.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
ilabs_rpico32.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
ilabs_rpico32.menu.dbgport.Disabled=Disabled
ilabs_rpico32.menu.dbgport.Disabled.build.debug_port=
ilabs_rpico32.menu.dbgport.Serial=Serial
ilabs_rpico32.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
ilabs_rpico32.menu.dbgport.Serial1=Serial1
ilabs_rpico32.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
ilabs_rpico32.menu.dbgport.Serial2=Serial2
ilabs_rpico32.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
ilabs_rpico32.menu.dbgport.SerialSemi=SerialSemi
ilabs_rpico32.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
ilabs_rpico32.menu.dbglvl.None=None
ilabs_rpico32.menu.dbglvl.None.build.debug_level=
ilabs_rpico32.menu.dbglvl.Core=Core
ilabs_rpico32.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
ilabs_rpico32.menu.dbglvl.SPI=SPI
ilabs_rpico32.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
ilabs_rpico32.menu.dbglvl.Wire=Wire
ilabs_rpico32.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
ilabs_rpico32.menu.dbglvl.Bluetooth=Bluetooth
ilabs_rpico32.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
ilabs_rpico32.menu.dbglvl.All=All
ilabs_rpico32.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
ilabs_rpico32.menu.dbglvl.NDEBUG=NDEBUG
ilabs_rpico32.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
ilabs_rpico32.menu.usbstack.picosdk=Pico SDK
ilabs_rpico32.menu.usbstack.picosdk.build.usbstack_flags=
ilabs_rpico32.menu.usbstack.tinyusb=Adafruit TinyUSB
ilabs_rpico32.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
ilabs_rpico32.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
ilabs_rpico32.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
ilabs_rpico32.menu.usbstack.nousb=No USB
ilabs_rpico32.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
ilabs_rpico32.menu.ipbtstack.ipv4only=IPv4 Only
ilabs_rpico32.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
ilabs_rpico32.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
ilabs_rpico32.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
ilabs_rpico32.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
ilabs_rpico32.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
ilabs_rpico32.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
ilabs_rpico32.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
ilabs_rpico32.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
ilabs_rpico32.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
ilabs_rpico32.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
ilabs_rpico32.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
ilabs_rpico32.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
ilabs_rpico32.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
ilabs_rpico32.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
ilabs_rpico32.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
ilabs_rpico32.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
ilabs_rpico32.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
ilabs_rpico32.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
ilabs_rpico32.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
ilabs_rpico32.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
ilabs_rpico32.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
ilabs_rpico32.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
ilabs_rpico32.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
ilabs_rpico32.menu.uploadmethod.default=Default (UF2)
ilabs_rpico32.menu.uploadmethod.default.build.ram_length=256k
ilabs_rpico32.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
ilabs_rpico32.menu.uploadmethod.default.upload.maximum_data_size=262144
ilabs_rpico32.menu.uploadmethod.default.upload.tool=uf2conv
ilabs_rpico32.menu.uploadmethod.default.upload.tool.default=uf2conv
ilabs_rpico32.menu.uploadmethod.default.upload.tool.network=uf2conv-network
ilabs_rpico32.menu.uploadmethod.picotool=Picotool
ilabs_rpico32.menu.uploadmethod.picotool.build.ram_length=256k
ilabs_rpico32.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
ilabs_rpico32.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
ilabs_rpico32.menu.uploadmethod.picotool.upload.maximum_data_size=262144
ilabs_rpico32.menu.uploadmethod.picotool.upload.tool=picotool
ilabs_rpico32.menu.uploadmethod.picotool.upload.tool.default=picotool
ilabs_rpico32.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
ilabs_rpico32.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
ilabs_rpico32.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
ilabs_rpico32.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
ilabs_rpico32.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
ilabs_rpico32.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

