earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# iLabs Challenger 2350 WiFi/BLE
# -----------------------------------
challenger_2350_wifi6_ble5.name=iLabs Challenger 2350 WiFi/BLE
challenger_2350_wifi6_ble5.vid.0=0x2e8a
challenger_2350_wifi6_ble5.pid.0=0x109a
challenger_2350_wifi6_ble5.vid.1=0x2e8a
challenger_2350_wifi6_ble5.pid.1=0x119a
challenger_2350_wifi6_ble5.vid.2=0x2e8a
challenger_2350_wifi6_ble5.pid.2=0x509a
challenger_2350_wifi6_ble5.vid.3=0x2e8a
challenger_2350_wifi6_ble5.pid.3=0x519a
challenger_2350_wifi6_ble5.vid.4=0x2e8a
challenger_2350_wifi6_ble5.pid.4=0x909a
challenger_2350_wifi6_ble5.vid.5=0x2e8a
challenger_2350_wifi6_ble5.pid.5=0x919a
challenger_2350_wifi6_ble5.vid.6=0x2e8a
challenger_2350_wifi6_ble5.pid.6=0xd09a
challenger_2350_wifi6_ble5.vid.7=0x2e8a
challenger_2350_wifi6_ble5.pid.7=0xd19a
challenger_2350_wifi6_ble5.upload_port.0.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.0.pid=0x109a
challenger_2350_wifi6_ble5.upload_port.1.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.1.pid=0x119a
challenger_2350_wifi6_ble5.upload_port.2.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.2.pid=0x509a
challenger_2350_wifi6_ble5.upload_port.3.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.3.pid=0x519a
challenger_2350_wifi6_ble5.upload_port.4.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.4.pid=0x909a
challenger_2350_wifi6_ble5.upload_port.5.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.5.pid=0x919a
challenger_2350_wifi6_ble5.upload_port.6.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.6.pid=0xd09a
challenger_2350_wifi6_ble5.upload_port.7.vid=0x2e8a
challenger_2350_wifi6_ble5.upload_port.7.pid=0xd19a
challenger_2350_wifi6_ble5.build.usbvid=-DUSBD_VID=0x2e8a
challenger_2350_wifi6_ble5.build.usbpid=-DUSBD_PID=0x109a
challenger_2350_wifi6_ble5.build.usbpwr=-DUSBD_MAX_POWER_MA=500
challenger_2350_wifi6_ble5.build.board=CHALLENGER_2350_WIFI_BLE_RP2350
challenger_2350_wifi6_ble5.build.variant=challenger_2350_wifi6_ble5
challenger_2350_wifi6_ble5.upload.maximum_size=8388608
challenger_2350_wifi6_ble5.upload.wait_for_upload_port=true
challenger_2350_wifi6_ble5.upload.erase_cmd=
challenger_2350_wifi6_ble5.serial.disableDTR=false
challenger_2350_wifi6_ble5.serial.disableRTS=false
challenger_2350_wifi6_ble5.build.f_cpu=125000000
challenger_2350_wifi6_ble5.build.led=
challenger_2350_wifi6_ble5.build.core=rp2040
challenger_2350_wifi6_ble5.build.ldscript=memmap_default.ld
challenger_2350_wifi6_ble5.build.boot2=none
challenger_2350_wifi6_ble5.build.usb_manufacturer="iLabs"
challenger_2350_wifi6_ble5.build.usb_product="Challenger 2350 WiFi/BLE"
challenger_2350_wifi6_ble5.build.psram_length=0x800000
challenger_2350_wifi6_ble5.menu.espwifitype.esp_at=ESP AT
challenger_2350_wifi6_ble5.menu.espwifitype.esp_at.build.espwifitype=-DWIFIESPAT2
challenger_2350_wifi6_ble5.menu.espwifitype.esp_hosted=ESP Hosted
challenger_2350_wifi6_ble5.menu.espwifitype.esp_hosted.build.espwifitype=-DESPHOSTSPI=SPI1
challenger_2350_wifi6_ble5.menu.wificountry.worldwide=Worldwide
challenger_2350_wifi6_ble5.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
challenger_2350_wifi6_ble5.menu.wificountry.australia=Australia
challenger_2350_wifi6_ble5.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
challenger_2350_wifi6_ble5.menu.wificountry.austria=Austria
challenger_2350_wifi6_ble5.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
challenger_2350_wifi6_ble5.menu.wificountry.belgium=Belgium
challenger_2350_wifi6_ble5.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
challenger_2350_wifi6_ble5.menu.wificountry.brazil=Brazil
challenger_2350_wifi6_ble5.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
challenger_2350_wifi6_ble5.menu.wificountry.canada=Canada
challenger_2350_wifi6_ble5.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
challenger_2350_wifi6_ble5.menu.wificountry.chile=Chile
challenger_2350_wifi6_ble5.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
challenger_2350_wifi6_ble5.menu.wificountry.china=China
challenger_2350_wifi6_ble5.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
challenger_2350_wifi6_ble5.menu.wificountry.colombia=Colombia
challenger_2350_wifi6_ble5.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
challenger_2350_wifi6_ble5.menu.wificountry.czech_republic=Czech Republic
challenger_2350_wifi6_ble5.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
challenger_2350_wifi6_ble5.menu.wificountry.denmark=Denmark
challenger_2350_wifi6_ble5.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
challenger_2350_wifi6_ble5.menu.wificountry.estonia=Estonia
challenger_2350_wifi6_ble5.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
challenger_2350_wifi6_ble5.menu.wificountry.finland=Finland
challenger_2350_wifi6_ble5.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
challenger_2350_wifi6_ble5.menu.wificountry.france=France
challenger_2350_wifi6_ble5.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
challenger_2350_wifi6_ble5.menu.wificountry.germany=Germany
challenger_2350_wifi6_ble5.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
challenger_2350_wifi6_ble5.menu.wificountry.greece=Greece
challenger_2350_wifi6_ble5.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
challenger_2350_wifi6_ble5.menu.wificountry.hong_kong=Hong Kong
challenger_2350_wifi6_ble5.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
challenger_2350_wifi6_ble5.menu.wificountry.hungary=Hungary
challenger_2350_wifi6_ble5.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
challenger_2350_wifi6_ble5.menu.wificountry.iceland=Iceland
challenger_2350_wifi6_ble5.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
challenger_2350_wifi6_ble5.menu.wificountry.india=India
challenger_2350_wifi6_ble5.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
challenger_2350_wifi6_ble5.menu.wificountry.israel=Israel
challenger_2350_wifi6_ble5.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
challenger_2350_wifi6_ble5.menu.wificountry.italy=Italy
challenger_2350_wifi6_ble5.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
challenger_2350_wifi6_ble5.menu.wificountry.japan=Japan
challenger_2350_wifi6_ble5.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
challenger_2350_wifi6_ble5.menu.wificountry.kenya=Kenya
challenger_2350_wifi6_ble5.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
challenger_2350_wifi6_ble5.menu.wificountry.latvia=Latvia
challenger_2350_wifi6_ble5.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
challenger_2350_wifi6_ble5.menu.wificountry.liechtenstein=Liechtenstein
challenger_2350_wifi6_ble5.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
challenger_2350_wifi6_ble5.menu.wificountry.lithuania=Lithuania
challenger_2350_wifi6_ble5.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
challenger_2350_wifi6_ble5.menu.wificountry.luxembourg=Luxembourg
challenger_2350_wifi6_ble5.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
challenger_2350_wifi6_ble5.menu.wificountry.malaysia=Malaysia
challenger_2350_wifi6_ble5.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
challenger_2350_wifi6_ble5.menu.wificountry.malta=Malta
challenger_2350_wifi6_ble5.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
challenger_2350_wifi6_ble5.menu.wificountry.mexico=Mexico
challenger_2350_wifi6_ble5.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
challenger_2350_wifi6_ble5.menu.wificountry.netherlands=Netherlands
challenger_2350_wifi6_ble5.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
challenger_2350_wifi6_ble5.menu.wificountry.new_zealand=New Zealand
challenger_2350_wifi6_ble5.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
challenger_2350_wifi6_ble5.menu.wificountry.nigeria=Nigeria
challenger_2350_wifi6_ble5.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
challenger_2350_wifi6_ble5.menu.wificountry.norway=Norway
challenger_2350_wifi6_ble5.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
challenger_2350_wifi6_ble5.menu.wificountry.peru=Peru
challenger_2350_wifi6_ble5.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
challenger_2350_wifi6_ble5.menu.wificountry.philippines=Philippines
challenger_2350_wifi6_ble5.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
challenger_2350_wifi6_ble5.menu.wificountry.poland=Poland
challenger_2350_wifi6_ble5.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
challenger_2350_wifi6_ble5.menu.wificountry.portugal=Portugal
challenger_2350_wifi6_ble5.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
challenger_2350_wifi6_ble5.menu.wificountry.singapore=Singapore
challenger_2350_wifi6_ble5.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
challenger_2350_wifi6_ble5.menu.wificountry.slovakia=Slovakia
challenger_2350_wifi6_ble5.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
challenger_2350_wifi6_ble5.menu.wificountry.slovenia=Slovenia
challenger_2350_wifi6_ble5.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
challenger_2350_wifi6_ble5.menu.wificountry.south_africa=South Africa
challenger_2350_wifi6_ble5.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
challenger_2350_wifi6_ble5.menu.wificountry.south_korea=South Korea
challenger_2350_wifi6_ble5.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
challenger_2350_wifi6_ble5.menu.wificountry.spain=Spain
challenger_2350_wifi6_ble5.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
challenger_2350_wifi6_ble5.menu.wificountry.sweden=Sweden
challenger_2350_wifi6_ble5.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
challenger_2350_wifi6_ble5.menu.wificountry.switzerland=Switzerland
challenger_2350_wifi6_ble5.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
challenger_2350_wifi6_ble5.menu.wificountry.taiwan=Taiwan
challenger_2350_wifi6_ble5.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
challenger_2350_wifi6_ble5.menu.wificountry.thailand=Thailand
challenger_2350_wifi6_ble5.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
challenger_2350_wifi6_ble5.menu.wificountry.turkey=Turkey
challenger_2350_wifi6_ble5.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
challenger_2350_wifi6_ble5.menu.wificountry.uk=UK
challenger_2350_wifi6_ble5.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
challenger_2350_wifi6_ble5.menu.wificountry.usa=USA
challenger_2350_wifi6_ble5.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
challenger_2350_wifi6_ble5.menu.flash.8388608_0=8MB (no FS)
challenger_2350_wifi6_ble5.menu.flash.8388608_0.upload.maximum_size=8380416
challenger_2350_wifi6_ble5.menu.flash.8388608_0.build.flash_total=8388608
challenger_2350_wifi6_ble5.menu.flash.8388608_0.build.flash_length=8380416
challenger_2350_wifi6_ble5.menu.flash.8388608_0.build.eeprom_start=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_0.build.fs_start=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_0.build.fs_end=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
challenger_2350_wifi6_ble5.menu.flash.8388608_7340032.upload.maximum_size=1040384
challenger_2350_wifi6_ble5.menu.flash.8388608_7340032.build.flash_total=8388608
challenger_2350_wifi6_ble5.menu.flash.8388608_7340032.build.flash_length=1040384
challenger_2350_wifi6_ble5.menu.flash.8388608_7340032.build.eeprom_start=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_7340032.build.fs_start=269475840
challenger_2350_wifi6_ble5.menu.flash.8388608_7340032.build.fs_end=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
challenger_2350_wifi6_ble5.menu.flash.8388608_4194304.upload.maximum_size=4186112
challenger_2350_wifi6_ble5.menu.flash.8388608_4194304.build.flash_total=8388608
challenger_2350_wifi6_ble5.menu.flash.8388608_4194304.build.flash_length=4186112
challenger_2350_wifi6_ble5.menu.flash.8388608_4194304.build.eeprom_start=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_4194304.build.fs_start=272621568
challenger_2350_wifi6_ble5.menu.flash.8388608_4194304.build.fs_end=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
challenger_2350_wifi6_ble5.menu.flash.8388608_2097152.upload.maximum_size=6283264
challenger_2350_wifi6_ble5.menu.flash.8388608_2097152.build.flash_total=8388608
challenger_2350_wifi6_ble5.menu.flash.8388608_2097152.build.flash_length=6283264
challenger_2350_wifi6_ble5.menu.flash.8388608_2097152.build.eeprom_start=276815872
challenger_2350_wifi6_ble5.menu.flash.8388608_2097152.build.fs_start=274718720
challenger_2350_wifi6_ble5.menu.flash.8388608_2097152.build.fs_end=276815872
challenger_2350_wifi6_ble5.menu.flash.16777216_0=16MB (no FS)
challenger_2350_wifi6_ble5.menu.flash.16777216_0.upload.maximum_size=16769024
challenger_2350_wifi6_ble5.menu.flash.16777216_0.build.flash_total=16777216
challenger_2350_wifi6_ble5.menu.flash.16777216_0.build.flash_length=16769024
challenger_2350_wifi6_ble5.menu.flash.16777216_0.build.eeprom_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_0.build.fs_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_0.build.fs_end=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
challenger_2350_wifi6_ble5.menu.flash.16777216_15728640.upload.maximum_size=1040384
challenger_2350_wifi6_ble5.menu.flash.16777216_15728640.build.flash_total=16777216
challenger_2350_wifi6_ble5.menu.flash.16777216_15728640.build.flash_length=1040384
challenger_2350_wifi6_ble5.menu.flash.16777216_15728640.build.eeprom_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_15728640.build.fs_start=269475840
challenger_2350_wifi6_ble5.menu.flash.16777216_15728640.build.fs_end=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
challenger_2350_wifi6_ble5.menu.flash.16777216_14680064.upload.maximum_size=2088960
challenger_2350_wifi6_ble5.menu.flash.16777216_14680064.build.flash_total=16777216
challenger_2350_wifi6_ble5.menu.flash.16777216_14680064.build.flash_length=2088960
challenger_2350_wifi6_ble5.menu.flash.16777216_14680064.build.eeprom_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_14680064.build.fs_start=270524416
challenger_2350_wifi6_ble5.menu.flash.16777216_14680064.build.fs_end=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
challenger_2350_wifi6_ble5.menu.flash.16777216_12582912.upload.maximum_size=4186112
challenger_2350_wifi6_ble5.menu.flash.16777216_12582912.build.flash_total=16777216
challenger_2350_wifi6_ble5.menu.flash.16777216_12582912.build.flash_length=4186112
challenger_2350_wifi6_ble5.menu.flash.16777216_12582912.build.eeprom_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_12582912.build.fs_start=272621568
challenger_2350_wifi6_ble5.menu.flash.16777216_12582912.build.fs_end=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
challenger_2350_wifi6_ble5.menu.flash.16777216_8388608.upload.maximum_size=8380416
challenger_2350_wifi6_ble5.menu.flash.16777216_8388608.build.flash_total=16777216
challenger_2350_wifi6_ble5.menu.flash.16777216_8388608.build.flash_length=8380416
challenger_2350_wifi6_ble5.menu.flash.16777216_8388608.build.eeprom_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_8388608.build.fs_start=276815872
challenger_2350_wifi6_ble5.menu.flash.16777216_8388608.build.fs_end=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
challenger_2350_wifi6_ble5.menu.flash.16777216_4194304.upload.maximum_size=12574720
challenger_2350_wifi6_ble5.menu.flash.16777216_4194304.build.flash_total=16777216
challenger_2350_wifi6_ble5.menu.flash.16777216_4194304.build.flash_length=12574720
challenger_2350_wifi6_ble5.menu.flash.16777216_4194304.build.eeprom_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_4194304.build.fs_start=281010176
challenger_2350_wifi6_ble5.menu.flash.16777216_4194304.build.fs_end=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
challenger_2350_wifi6_ble5.menu.flash.16777216_2097152.upload.maximum_size=14671872
challenger_2350_wifi6_ble5.menu.flash.16777216_2097152.build.flash_total=16777216
challenger_2350_wifi6_ble5.menu.flash.16777216_2097152.build.flash_length=14671872
challenger_2350_wifi6_ble5.menu.flash.16777216_2097152.build.eeprom_start=285204480
challenger_2350_wifi6_ble5.menu.flash.16777216_2097152.build.fs_start=283107328
challenger_2350_wifi6_ble5.menu.flash.16777216_2097152.build.fs_end=285204480
challenger_2350_wifi6_ble5.menu.arch.arm=ARM
challenger_2350_wifi6_ble5.menu.arch.arm.build.chip=rp2350
challenger_2350_wifi6_ble5.menu.arch.arm.build.toolchain=arm-none-eabi
challenger_2350_wifi6_ble5.menu.arch.arm.build.toolchainpkg=pqt-gcc
challenger_2350_wifi6_ble5.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
challenger_2350_wifi6_ble5.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
challenger_2350_wifi6_ble5.menu.arch.arm.build.mcu=cortex-m33
challenger_2350_wifi6_ble5.menu.arch.riscv=RISC-V
challenger_2350_wifi6_ble5.menu.arch.riscv.build.chip=rp2350-riscv
