earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# iLabs Challenger 2350 BConnect
# -----------------------------------
challenger_2350_bconnect.name=iLabs Challenger 2350 BConnect
challenger_2350_bconnect.vid.0=0x2e8a
challenger_2350_bconnect.pid.0=0x109b
challenger_2350_bconnect.vid.1=0x2e8a
challenger_2350_bconnect.pid.1=0x119b
challenger_2350_bconnect.vid.2=0x2e8a
challenger_2350_bconnect.pid.2=0x509b
challenger_2350_bconnect.vid.3=0x2e8a
challenger_2350_bconnect.pid.3=0x519b
challenger_2350_bconnect.vid.4=0x2e8a
challenger_2350_bconnect.pid.4=0x909b
challenger_2350_bconnect.vid.5=0x2e8a
challenger_2350_bconnect.pid.5=0x919b
challenger_2350_bconnect.vid.6=0x2e8a
challenger_2350_bconnect.pid.6=0xd09b
challenger_2350_bconnect.vid.7=0x2e8a
challenger_2350_bconnect.pid.7=0xd19b
challenger_2350_bconnect.upload_port.0.vid=0x2e8a
challenger_2350_bconnect.upload_port.0.pid=0x109b
challenger_2350_bconnect.upload_port.1.vid=0x2e8a
challenger_2350_bconnect.upload_port.1.pid=0x119b
challenger_2350_bconnect.upload_port.2.vid=0x2e8a
challenger_2350_bconnect.upload_port.2.pid=0x509b
challenger_2350_bconnect.upload_port.3.vid=0x2e8a
challenger_2350_bconnect.upload_port.3.pid=0x519b
challenger_2350_bconnect.upload_port.4.vid=0x2e8a
challenger_2350_bconnect.upload_port.4.pid=0x909b
challenger_2350_bconnect.upload_port.5.vid=0x2e8a
challenger_2350_bconnect.upload_port.5.pid=0x919b
challenger_2350_bconnect.upload_port.6.vid=0x2e8a
challenger_2350_bconnect.upload_port.6.pid=0xd09b
challenger_2350_bconnect.upload_port.7.vid=0x2e8a
challenger_2350_bconnect.upload_port.7.pid=0xd19b
challenger_2350_bconnect.build.usbvid=-DUSBD_VID=0x2e8a
challenger_2350_bconnect.build.usbpid=-DUSBD_PID=0x109b
challenger_2350_bconnect.build.usbpwr=-DUSBD_MAX_POWER_MA=500
challenger_2350_bconnect.build.board=CHALLENGER_2350_BCONNECT_RP2350
challenger_2350_bconnect.build.variant=challenger_2350_bconnect
challenger_2350_bconnect.upload.maximum_size=8388608
challenger_2350_bconnect.upload.wait_for_upload_port=true
challenger_2350_bconnect.upload.erase_cmd=
challenger_2350_bconnect.serial.disableDTR=false
challenger_2350_bconnect.serial.disableRTS=false
challenger_2350_bconnect.build.f_cpu=125000000
challenger_2350_bconnect.build.led=
challenger_2350_bconnect.build.core=rp2040
challenger_2350_bconnect.build.ldscript=memmap_default.ld
challenger_2350_bconnect.build.boot2=none
challenger_2350_bconnect.build.usb_manufacturer="iLabs"
challenger_2350_bconnect.build.usb_product="Challenger 2350 BConnect"
challenger_2350_bconnect.build.psram_length=0x800000
challenger_2350_bconnect.menu.flash.8388608_0=8MB (no FS)
challenger_2350_bconnect.menu.flash.8388608_0.upload.maximum_size=8380416
challenger_2350_bconnect.menu.flash.8388608_0.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_0.build.flash_length=8380416
challenger_2350_bconnect.menu.flash.8388608_0.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_0.build.fs_start=276815872
challenger_2350_bconnect.menu.flash.8388608_0.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
challenger_2350_bconnect.menu.flash.8388608_65536.upload.maximum_size=8314880
challenger_2350_bconnect.menu.flash.8388608_65536.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_65536.build.flash_length=8314880
challenger_2350_bconnect.menu.flash.8388608_65536.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_65536.build.fs_start=276750336
challenger_2350_bconnect.menu.flash.8388608_65536.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
challenger_2350_bconnect.menu.flash.8388608_131072.upload.maximum_size=8249344
challenger_2350_bconnect.menu.flash.8388608_131072.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_131072.build.flash_length=8249344
challenger_2350_bconnect.menu.flash.8388608_131072.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_131072.build.fs_start=276684800
challenger_2350_bconnect.menu.flash.8388608_131072.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
challenger_2350_bconnect.menu.flash.8388608_262144.upload.maximum_size=8118272
challenger_2350_bconnect.menu.flash.8388608_262144.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_262144.build.flash_length=8118272
challenger_2350_bconnect.menu.flash.8388608_262144.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_262144.build.fs_start=276553728
challenger_2350_bconnect.menu.flash.8388608_262144.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
challenger_2350_bconnect.menu.flash.8388608_524288.upload.maximum_size=7856128
challenger_2350_bconnect.menu.flash.8388608_524288.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_524288.build.flash_length=7856128
challenger_2350_bconnect.menu.flash.8388608_524288.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_524288.build.fs_start=276291584
challenger_2350_bconnect.menu.flash.8388608_524288.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
challenger_2350_bconnect.menu.flash.8388608_1048576.upload.maximum_size=7331840
challenger_2350_bconnect.menu.flash.8388608_1048576.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_1048576.build.flash_length=7331840
challenger_2350_bconnect.menu.flash.8388608_1048576.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_1048576.build.fs_start=275767296
challenger_2350_bconnect.menu.flash.8388608_1048576.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
challenger_2350_bconnect.menu.flash.8388608_2097152.upload.maximum_size=6283264
challenger_2350_bconnect.menu.flash.8388608_2097152.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_2097152.build.flash_length=6283264
challenger_2350_bconnect.menu.flash.8388608_2097152.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_2097152.build.fs_start=274718720
challenger_2350_bconnect.menu.flash.8388608_2097152.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
challenger_2350_bconnect.menu.flash.8388608_3145728.upload.maximum_size=5234688
challenger_2350_bconnect.menu.flash.8388608_3145728.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_3145728.build.flash_length=5234688
challenger_2350_bconnect.menu.flash.8388608_3145728.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_3145728.build.fs_start=273670144
challenger_2350_bconnect.menu.flash.8388608_3145728.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
challenger_2350_bconnect.menu.flash.8388608_4194304.upload.maximum_size=4186112
challenger_2350_bconnect.menu.flash.8388608_4194304.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_4194304.build.flash_length=4186112
challenger_2350_bconnect.menu.flash.8388608_4194304.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_4194304.build.fs_start=272621568
challenger_2350_bconnect.menu.flash.8388608_4194304.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
challenger_2350_bconnect.menu.flash.8388608_5242880.upload.maximum_size=3137536
challenger_2350_bconnect.menu.flash.8388608_5242880.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_5242880.build.flash_length=3137536
challenger_2350_bconnect.menu.flash.8388608_5242880.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_5242880.build.fs_start=271572992
challenger_2350_bconnect.menu.flash.8388608_5242880.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
challenger_2350_bconnect.menu.flash.8388608_6291456.upload.maximum_size=2088960
challenger_2350_bconnect.menu.flash.8388608_6291456.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_6291456.build.flash_length=2088960
challenger_2350_bconnect.menu.flash.8388608_6291456.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_6291456.build.fs_start=270524416
challenger_2350_bconnect.menu.flash.8388608_6291456.build.fs_end=276815872
challenger_2350_bconnect.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
challenger_2350_bconnect.menu.flash.8388608_7340032.upload.maximum_size=1040384
challenger_2350_bconnect.menu.flash.8388608_7340032.build.flash_total=8388608
challenger_2350_bconnect.menu.flash.8388608_7340032.build.flash_length=1040384
challenger_2350_bconnect.menu.flash.8388608_7340032.build.eeprom_start=276815872
challenger_2350_bconnect.menu.flash.8388608_7340032.build.fs_start=269475840
challenger_2350_bconnect.menu.flash.8388608_7340032.build.fs_end=276815872
challenger_2350_bconnect.menu.arch.arm=ARM
challenger_2350_bconnect.menu.arch.arm.build.chip=rp2350
challenger_2350_bconnect.menu.arch.arm.build.toolchain=arm-none-eabi
challenger_2350_bconnect.menu.arch.arm.build.toolchainpkg=pqt-gcc
challenger_2350_bconnect.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
challenger_2350_bconnect.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
challenger_2350_bconnect.menu.arch.arm.build.mcu=cortex-m33
challenger_2350_bconnect.menu.arch.riscv=RISC-V
challenger_2350_bconnect.menu.arch.riscv.build.chip=rp2350-riscv
challenger_2350_bconnect.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
challenger_2350_bconnect.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
challenger_2350_bconnect.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
challenger_2350_bconnect.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
challenger_2350_bconnect.menu.arch.riscv.build.mcu=rv32imac
challenger_2350_bconnect.menu.freq.150=150 MHz
challenger_2350_bconnect.menu.freq.150.build.f_cpu=150000000L
challenger_2350_bconnect.menu.freq.50=50 MHz
challenger_2350_bconnect.menu.freq.50.build.f_cpu=50000000L
challenger_2350_bconnect.menu.freq.100=100 MHz
challenger_2350_bconnect.menu.freq.100.build.f_cpu=100000000L
challenger_2350_bconnect.menu.freq.120=120 MHz
challenger_2350_bconnect.menu.freq.120.build.f_cpu=120000000L
challenger_2350_bconnect.menu.freq.125=125 MHz
challenger_2350_bconnect.menu.freq.125.build.f_cpu=125000000L
challenger_2350_bconnect.menu.freq.128=128 MHz
challenger_2350_bconnect.menu.freq.128.build.f_cpu=128000000L
challenger_2350_bconnect.menu.freq.133=133 MHz
challenger_2350_bconnect.menu.freq.133.build.f_cpu=133000000L
challenger_2350_bconnect.menu.freq.176=176 MHz (Overclock)
challenger_2350_bconnect.menu.freq.176.build.f_cpu=176000000L
challenger_2350_bconnect.menu.freq.200=200 MHz (Overclock)
challenger_2350_bconnect.menu.freq.200.build.f_cpu=200000000L
challenger_2350_bconnect.menu.freq.225=225 MHz (Overclock)
challenger_2350_bconnect.menu.freq.225.build.f_cpu=225000000L
challenger_2350_bconnect.menu.freq.240=240 MHz (Overclock)
challenger_2350_bconnect.menu.freq.240.build.f_cpu=240000000L
challenger_2350_bconnect.menu.freq.250=250 MHz (Overclock)
challenger_2350_bconnect.menu.freq.250.build.f_cpu=250000000L
challenger_2350_bconnect.menu.freq.276=276 MHz (Overclock)
challenger_2350_bconnect.menu.freq.276.build.f_cpu=276000000L
challenger_2350_bconnect.menu.freq.300=300 MHz (Overclock)
challenger_2350_bconnect.menu.freq.300.build.f_cpu=300000000L
challenger_2350_bconnect.menu.opt.Small=Small (-Os) (standard)
challenger_2350_bconnect.menu.opt.Small.build.flags.optimize=-Os
challenger_2350_bconnect.menu.opt.Optimize=Optimize (-O)
challenger_2350_bconnect.menu.opt.Optimize.build.flags.optimize=-O
challenger_2350_bconnect.menu.opt.Optimize2=Optimize More (-O2)
challenger_2350_bconnect.menu.opt.Optimize2.build.flags.optimize=-O2
challenger_2350_bconnect.menu.opt.Optimize3=Optimize Even More (-O3)
challenger_2350_bconnect.menu.opt.Optimize3.build.flags.optimize=-O3
challenger_2350_bconnect.menu.opt.Fast=Fast (-Ofast) (maybe slower)
challenger_2350_bconnect.menu.opt.Fast.build.flags.optimize=-Ofast
challenger_2350_bconnect.menu.opt.Debug=Debug (-Og)
challenger_2350_bconnect.menu.opt.Debug.build.flags.optimize=-Og
challenger_2350_bconnect.menu.opt.Disabled=Disabled (-O0)
challenger_2350_bconnect.menu.opt.Disabled.build.flags.optimize=-O0
challenger_2350_bconnect.menu.profile.Disabled=Disabled
challenger_2350_bconnect.menu.profile.Disabled.build.flags.profile=
challenger_2350_bconnect.menu.profile.Enabled=Enabled
challenger_2350_bconnect.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
challenger_2350_bconnect.menu.rtti.Disabled=Disabled
challenger_2350_bconnect.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
challenger_2350_bconnect.menu.rtti.Enabled=Enabled
challenger_2350_bconnect.menu.rtti.Enabled.build.flags.rtti=
challenger_2350_bconnect.menu.stackprotect.Disabled=Disabled
challenger_2350_bconnect.menu.stackprotect.Disabled.build.flags.stackprotect=
challenger_2350_bconnect.menu.stackprotect.Enabled=Enabled
challenger_2350_bconnect.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
challenger_2350_bconnect.menu.exceptions.Disabled=Disabled
challenger_2350_bconnect.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
challenger_2350_bconnect.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
challenger_2350_bconnect.menu.exceptions.Enabled=Enabled
challenger_2350_bconnect.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
challenger_2350_bconnect.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
challenger_2350_bconnect.menu.dbgport.Disabled=Disabled
challenger_2350_bconnect.menu.dbgport.Disabled.build.debug_port=
challenger_2350_bconnect.menu.dbgport.Serial=Serial
challenger_2350_bconnect.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
challenger_2350_bconnect.menu.dbgport.Serial1=Serial1
challenger_2350_bconnect.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
challenger_2350_bconnect.menu.dbgport.Serial2=Serial2
challenger_2350_bconnect.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
challenger_2350_bconnect.menu.dbgport.SerialSemi=SerialSemi
challenger_2350_bconnect.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
challenger_2350_bconnect.menu.dbglvl.None=None
challenger_2350_bconnect.menu.dbglvl.None.build.debug_level=
challenger_2350_bconnect.menu.dbglvl.Core=Core
challenger_2350_bconnect.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
challenger_2350_bconnect.menu.dbglvl.SPI=SPI
challenger_2350_bconnect.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
challenger_2350_bconnect.menu.dbglvl.Wire=Wire
challenger_2350_bconnect.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
challenger_2350_bconnect.menu.dbglvl.Bluetooth=Bluetooth
challenger_2350_bconnect.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
challenger_2350_bconnect.menu.dbglvl.All=All
challenger_2350_bconnect.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
challenger_2350_bconnect.menu.dbglvl.NDEBUG=NDEBUG
challenger_2350_bconnect.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
challenger_2350_bconnect.menu.usbstack.picosdk=Pico SDK
challenger_2350_bconnect.menu.usbstack.picosdk.build.usbstack_flags=
challenger_2350_bconnect.menu.usbstack.tinyusb=Adafruit TinyUSB
challenger_2350_bconnect.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
challenger_2350_bconnect.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
challenger_2350_bconnect.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
challenger_2350_bconnect.menu.usbstack.nousb=No USB
challenger_2350_bconnect.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
challenger_2350_bconnect.menu.ipbtstack.ipv4only=IPv4 Only
challenger_2350_bconnect.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
challenger_2350_bconnect.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
challenger_2350_bconnect.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
challenger_2350_bconnect.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
challenger_2350_bconnect.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
challenger_2350_bconnect.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
challenger_2350_bconnect.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
challenger_2350_bconnect.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
challenger_2350_bconnect.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
