earlephilhower/arduino-pico/boards.txt
challenger_2350_bconnect.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
challenger_2350_bconnect.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
challenger_2350_bconnect.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
challenger_2350_bconnect.menu.uploadmethod.default=Default (UF2)
challenger_2350_bconnect.menu.uploadmethod.default.build.ram_length=512k
challenger_2350_bconnect.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2350_bconnect.menu.uploadmethod.default.upload.maximum_data_size=524288
challenger_2350_bconnect.menu.uploadmethod.default.upload.tool=uf2conv
challenger_2350_bconnect.menu.uploadmethod.default.upload.tool.default=uf2conv
challenger_2350_bconnect.menu.uploadmethod.default.upload.tool.network=uf2conv-network
challenger_2350_bconnect.menu.uploadmethod.picotool=Picotool
challenger_2350_bconnect.menu.uploadmethod.picotool.build.ram_length=512k
challenger_2350_bconnect.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
challenger_2350_bconnect.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
challenger_2350_bconnect.menu.uploadmethod.picotool.upload.maximum_data_size=524288
challenger_2350_bconnect.menu.uploadmethod.picotool.upload.tool=picotool
challenger_2350_bconnect.menu.uploadmethod.picotool.upload.tool.default=picotool
challenger_2350_bconnect.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
challenger_2350_bconnect.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
challenger_2350_bconnect.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
challenger_2350_bconnect.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
challenger_2350_bconnect.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
challenger_2350_bconnect.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Makerbase MKS THR36
# -----------------------------------
mksthr36.name=Makerbase MKS THR36
mksthr36.vid.0=0x2e8a
mksthr36.pid.0=0x000a
mksthr36.vid.1=0x2e8a
mksthr36.pid.1=0x010a
mksthr36.vid.2=0x2e8a
mksthr36.pid.2=0x400a
mksthr36.vid.3=0x2e8a
mksthr36.pid.3=0x410a
mksthr36.vid.4=0x2e8a
mksthr36.pid.4=0x800a
mksthr36.vid.5=0x2e8a
mksthr36.pid.5=0x810a
mksthr36.vid.6=0x2e8a
mksthr36.pid.6=0xc00a
mksthr36.vid.7=0x2e8a
mksthr36.pid.7=0xc10a
mksthr36.upload_port.0.vid=0x2e8a
mksthr36.upload_port.0.pid=0x000a
mksthr36.upload_port.1.vid=0x2e8a
mksthr36.upload_port.1.pid=0x010a
mksthr36.upload_port.2.vid=0x2e8a
mksthr36.upload_port.2.pid=0x400a
mksthr36.upload_port.3.vid=0x2e8a
mksthr36.upload_port.3.pid=0x410a
mksthr36.upload_port.4.vid=0x2e8a
mksthr36.upload_port.4.pid=0x800a
mksthr36.upload_port.5.vid=0x2e8a
mksthr36.upload_port.5.pid=0x810a
mksthr36.upload_port.6.vid=0x2e8a
mksthr36.upload_port.6.pid=0xc00a
mksthr36.upload_port.7.vid=0x2e8a
mksthr36.upload_port.7.pid=0xc10a
mksthr36.build.usbvid=-DUSBD_VID=0x2e8a
mksthr36.build.usbpid=-DUSBD_PID=0x000a
mksthr36.build.usbpwr=-DUSBD_MAX_POWER_MA=250
mksthr36.build.board=MAKERBASE_MKSTHR36
mksthr36.build.mcu=cortex-m0plus
mksthr36.build.chip=rp2040
mksthr36.build.toolchain=arm-none-eabi
mksthr36.build.toolchainpkg=pqt-gcc
mksthr36.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
mksthr36.build.uf2family=--family rp2040
mksthr36.build.variant=mksthr36
mksthr36.upload.maximum_size=1048576
mksthr36.upload.wait_for_upload_port=true
mksthr36.upload.erase_cmd=
mksthr36.serial.disableDTR=false
mksthr36.serial.disableRTS=false
mksthr36.build.f_cpu=125000000
mksthr36.build.led=
mksthr36.build.core=rp2040
mksthr36.build.ldscript=memmap_default.ld
mksthr36.build.boot2=boot2_w25q080_2_padded_checksum
mksthr36.build.usb_manufacturer="Makerbase"
mksthr36.build.usb_product="MKS THR36"
mksthr36.menu.flash.1048576_0=1MB (no FS)
mksthr36.menu.flash.1048576_0.upload.maximum_size=1044480
mksthr36.menu.flash.1048576_0.build.flash_total=1048576
mksthr36.menu.flash.1048576_0.build.flash_length=1044480
mksthr36.menu.flash.1048576_0.build.eeprom_start=269479936
mksthr36.menu.flash.1048576_0.build.fs_start=269479936
mksthr36.menu.flash.1048576_0.build.fs_end=269479936
mksthr36.menu.flash.1048576_65536=1MB (Sketch: 960KB, FS: 64KB)
mksthr36.menu.flash.1048576_65536.upload.maximum_size=978944
mksthr36.menu.flash.1048576_65536.build.flash_total=1048576
mksthr36.menu.flash.1048576_65536.build.flash_length=978944
mksthr36.menu.flash.1048576_65536.build.eeprom_start=269479936
mksthr36.menu.flash.1048576_65536.build.fs_start=269414400
mksthr36.menu.flash.1048576_65536.build.fs_end=269479936
mksthr36.menu.flash.1048576_131072=1MB (Sketch: 896KB, FS: 128KB)
mksthr36.menu.flash.1048576_131072.upload.maximum_size=913408
mksthr36.menu.flash.1048576_131072.build.flash_total=1048576
mksthr36.menu.flash.1048576_131072.build.flash_length=913408
mksthr36.menu.flash.1048576_131072.build.eeprom_start=269479936
mksthr36.menu.flash.1048576_131072.build.fs_start=269348864
mksthr36.menu.flash.1048576_131072.build.fs_end=269479936
mksthr36.menu.flash.1048576_262144=1MB (Sketch: 768KB, FS: 256KB)
mksthr36.menu.flash.1048576_262144.upload.maximum_size=782336
mksthr36.menu.flash.1048576_262144.build.flash_total=1048576
mksthr36.menu.flash.1048576_262144.build.flash_length=782336
mksthr36.menu.flash.1048576_262144.build.eeprom_start=269479936
mksthr36.menu.flash.1048576_262144.build.fs_start=269217792
mksthr36.menu.flash.1048576_262144.build.fs_end=269479936
mksthr36.menu.flash.1048576_524288=1MB (Sketch: 512KB, FS: 512KB)
mksthr36.menu.flash.1048576_524288.upload.maximum_size=520192
mksthr36.menu.flash.1048576_524288.build.flash_total=1048576
mksthr36.menu.flash.1048576_524288.build.flash_length=520192
mksthr36.menu.flash.1048576_524288.build.eeprom_start=269479936
mksthr36.menu.flash.1048576_524288.build.fs_start=268955648
mksthr36.menu.flash.1048576_524288.build.fs_end=269479936
mksthr36.menu.freq.200=200 MHz
mksthr36.menu.freq.200.build.f_cpu=200000000L
mksthr36.menu.freq.50=50 MHz
mksthr36.menu.freq.50.build.f_cpu=50000000L
mksthr36.menu.freq.100=100 MHz
mksthr36.menu.freq.100.build.f_cpu=100000000L
mksthr36.menu.freq.120=120 MHz
mksthr36.menu.freq.120.build.f_cpu=120000000L
mksthr36.menu.freq.125=125 MHz
mksthr36.menu.freq.125.build.f_cpu=125000000L
mksthr36.menu.freq.128=128 MHz
mksthr36.menu.freq.128.build.f_cpu=128000000L
mksthr36.menu.freq.133=133 MHz
mksthr36.menu.freq.133.build.f_cpu=133000000L
mksthr36.menu.freq.150=150 MHz
mksthr36.menu.freq.150.build.f_cpu=150000000L
mksthr36.menu.freq.176=176 MHz
mksthr36.menu.freq.176.build.f_cpu=176000000L
mksthr36.menu.freq.225=225 MHz (Overclock)
mksthr36.menu.freq.225.build.f_cpu=225000000L
mksthr36.menu.freq.240=240 MHz (Overclock)
mksthr36.menu.freq.240.build.f_cpu=240000000L
mksthr36.menu.freq.250=250 MHz (Overclock)
mksthr36.menu.freq.250.build.f_cpu=250000000L
mksthr36.menu.freq.276=276 MHz (Overclock)
mksthr36.menu.freq.276.build.f_cpu=276000000L
mksthr36.menu.freq.300=300 MHz (Overclock)
mksthr36.menu.freq.300.build.f_cpu=300000000L
mksthr36.menu.opt.Small=Small (-Os) (standard)
mksthr36.menu.opt.Small.build.flags.optimize=-Os
mksthr36.menu.opt.Optimize=Optimize (-O)
mksthr36.menu.opt.Optimize.build.flags.optimize=-O
mksthr36.menu.opt.Optimize2=Optimize More (-O2)
mksthr36.menu.opt.Optimize2.build.flags.optimize=-O2
mksthr36.menu.opt.Optimize3=Optimize Even More (-O3)
mksthr36.menu.opt.Optimize3.build.flags.optimize=-O3
mksthr36.menu.opt.Fast=Fast (-Ofast) (maybe slower)
mksthr36.menu.opt.Fast.build.flags.optimize=-Ofast
mksthr36.menu.opt.Debug=Debug (-Og)
mksthr36.menu.opt.Debug.build.flags.optimize=-Og
mksthr36.menu.opt.Disabled=Disabled (-O0)
mksthr36.menu.opt.Disabled.build.flags.optimize=-O0
mksthr36.menu.profile.Disabled=Disabled
mksthr36.menu.profile.Disabled.build.flags.profile=
mksthr36.menu.profile.Enabled=Enabled
mksthr36.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
mksthr36.menu.rtti.Disabled=Disabled
mksthr36.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
mksthr36.menu.rtti.Enabled=Enabled
mksthr36.menu.rtti.Enabled.build.flags.rtti=
mksthr36.menu.stackprotect.Disabled=Disabled
mksthr36.menu.stackprotect.Disabled.build.flags.stackprotect=
mksthr36.menu.stackprotect.Enabled=Enabled
mksthr36.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
mksthr36.menu.exceptions.Disabled=Disabled
mksthr36.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
mksthr36.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
mksthr36.menu.exceptions.Enabled=Enabled
mksthr36.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
mksthr36.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
mksthr36.menu.dbgport.Disabled=Disabled
mksthr36.menu.dbgport.Disabled.build.debug_port=
mksthr36.menu.dbgport.Serial=Serial
mksthr36.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
mksthr36.menu.dbgport.Serial1=Serial1
mksthr36.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
mksthr36.menu.dbgport.Serial2=Serial2
mksthr36.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
mksthr36.menu.dbgport.SerialSemi=SerialSemi
mksthr36.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
mksthr36.menu.dbglvl.None=None
mksthr36.menu.dbglvl.None.build.debug_level=
mksthr36.menu.dbglvl.Core=Core
mksthr36.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
mksthr36.menu.dbglvl.SPI=SPI
mksthr36.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
mksthr36.menu.dbglvl.Wire=Wire
mksthr36.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
mksthr36.menu.dbglvl.Bluetooth=Bluetooth
mksthr36.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
mksthr36.menu.dbglvl.All=All
mksthr36.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
mksthr36.menu.dbglvl.NDEBUG=NDEBUG
mksthr36.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
mksthr36.menu.usbstack.picosdk=Pico SDK
mksthr36.menu.usbstack.picosdk.build.usbstack_flags=
mksthr36.menu.usbstack.tinyusb=Adafruit TinyUSB
mksthr36.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
mksthr36.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
mksthr36.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
mksthr36.menu.usbstack.nousb=No USB
mksthr36.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
mksthr36.menu.ipbtstack.ipv4only=IPv4 Only
mksthr36.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
mksthr36.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
mksthr36.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
mksthr36.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
mksthr36.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
mksthr36.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
mksthr36.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
mksthr36.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
mksthr36.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
mksthr36.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
mksthr36.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
mksthr36.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
mksthr36.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
mksthr36.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
mksthr36.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
mksthr36.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
mksthr36.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
mksthr36.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
mksthr36.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
mksthr36.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
mksthr36.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
mksthr36.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
mksthr36.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
mksthr36.menu.uploadmethod.default=Default (UF2)
mksthr36.menu.uploadmethod.default.build.ram_length=256k
mksthr36.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
mksthr36.menu.uploadmethod.default.upload.maximum_data_size=262144
mksthr36.menu.uploadmethod.default.upload.tool=uf2conv
mksthr36.menu.uploadmethod.default.upload.tool.default=uf2conv
mksthr36.menu.uploadmethod.default.upload.tool.network=uf2conv-network
mksthr36.menu.uploadmethod.picotool=Picotool
mksthr36.menu.uploadmethod.picotool.build.ram_length=256k
mksthr36.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
mksthr36.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
mksthr36.menu.uploadmethod.picotool.upload.maximum_data_size=262144
mksthr36.menu.uploadmethod.picotool.upload.tool=picotool
mksthr36.menu.uploadmethod.picotool.upload.tool.default=picotool
mksthr36.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
mksthr36.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
mksthr36.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
mksthr36.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
mksthr36.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
mksthr36.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

