earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Newsan Archi
# -----------------------------------
newsan_archi.name=Newsan Archi
newsan_archi.vid.0=0x2E8A
newsan_archi.pid.0=0x1043
newsan_archi.vid.1=0x2E8A
newsan_archi.pid.1=0x1143
newsan_archi.vid.2=0x2E8A
newsan_archi.pid.2=0x5043
newsan_archi.vid.3=0x2E8A
newsan_archi.pid.3=0x5143
newsan_archi.vid.4=0x2E8A
newsan_archi.pid.4=0x9043
newsan_archi.vid.5=0x2E8A
newsan_archi.pid.5=0x9143
newsan_archi.vid.6=0x2E8A
newsan_archi.pid.6=0xd043
newsan_archi.vid.7=0x2E8A
newsan_archi.pid.7=0xd143
newsan_archi.upload_port.0.vid=0x2E8A
newsan_archi.upload_port.0.pid=0x1043
newsan_archi.upload_port.1.vid=0x2E8A
newsan_archi.upload_port.1.pid=0x1143
newsan_archi.upload_port.2.vid=0x2E8A
newsan_archi.upload_port.2.pid=0x5043
newsan_archi.upload_port.3.vid=0x2E8A
newsan_archi.upload_port.3.pid=0x5143
newsan_archi.upload_port.4.vid=0x2E8A
newsan_archi.upload_port.4.pid=0x9043
newsan_archi.upload_port.5.vid=0x2E8A
newsan_archi.upload_port.5.pid=0x9143
newsan_archi.upload_port.6.vid=0x2E8A
newsan_archi.upload_port.6.pid=0xd043
newsan_archi.upload_port.7.vid=0x2E8A
newsan_archi.upload_port.7.pid=0xd143
newsan_archi.build.usbvid=-DUSBD_VID=0x2E8A
newsan_archi.build.usbpid=-DUSBD_PID=0x1043
newsan_archi.build.usbpwr=-DUSBD_MAX_POWER_MA=250
newsan_archi.build.board=NEWSAN_ARCHI
newsan_archi.build.mcu=cortex-m0plus
newsan_archi.build.chip=rp2040
newsan_archi.build.toolchain=arm-none-eabi
newsan_archi.build.toolchainpkg=pqt-gcc
newsan_archi.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
newsan_archi.build.uf2family=--family rp2040
newsan_archi.build.variant=newsan_archi
newsan_archi.upload.maximum_size=4194304
newsan_archi.upload.wait_for_upload_port=true
newsan_archi.upload.erase_cmd=
newsan_archi.serial.disableDTR=false
newsan_archi.serial.disableRTS=false
newsan_archi.build.f_cpu=125000000
newsan_archi.build.led=
newsan_archi.build.core=rp2040
newsan_archi.build.ldscript=memmap_default.ld
newsan_archi.build.boot2=boot2_generic_03h_4_padded_checksum
newsan_archi.build.usb_manufacturer="Newsan"
newsan_archi.build.usb_product="Archi"
newsan_archi.menu.flash.4194304_0=4MB (no FS)
newsan_archi.menu.flash.4194304_0.upload.maximum_size=4190208
newsan_archi.menu.flash.4194304_0.build.flash_total=4194304
newsan_archi.menu.flash.4194304_0.build.flash_length=4190208
newsan_archi.menu.flash.4194304_0.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_0.build.fs_start=272625664
newsan_archi.menu.flash.4194304_0.build.fs_end=272625664
newsan_archi.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
newsan_archi.menu.flash.4194304_65536.upload.maximum_size=4124672
newsan_archi.menu.flash.4194304_65536.build.flash_total=4194304
newsan_archi.menu.flash.4194304_65536.build.flash_length=4124672
newsan_archi.menu.flash.4194304_65536.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_65536.build.fs_start=272560128
newsan_archi.menu.flash.4194304_65536.build.fs_end=272625664
newsan_archi.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
newsan_archi.menu.flash.4194304_131072.upload.maximum_size=4059136
newsan_archi.menu.flash.4194304_131072.build.flash_total=4194304
newsan_archi.menu.flash.4194304_131072.build.flash_length=4059136
newsan_archi.menu.flash.4194304_131072.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_131072.build.fs_start=272494592
newsan_archi.menu.flash.4194304_131072.build.fs_end=272625664
newsan_archi.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
newsan_archi.menu.flash.4194304_262144.upload.maximum_size=3928064
newsan_archi.menu.flash.4194304_262144.build.flash_total=4194304
newsan_archi.menu.flash.4194304_262144.build.flash_length=3928064
newsan_archi.menu.flash.4194304_262144.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_262144.build.fs_start=272363520
newsan_archi.menu.flash.4194304_262144.build.fs_end=272625664
newsan_archi.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
newsan_archi.menu.flash.4194304_524288.upload.maximum_size=3665920
newsan_archi.menu.flash.4194304_524288.build.flash_total=4194304
newsan_archi.menu.flash.4194304_524288.build.flash_length=3665920
newsan_archi.menu.flash.4194304_524288.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_524288.build.fs_start=272101376
newsan_archi.menu.flash.4194304_524288.build.fs_end=272625664
newsan_archi.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
newsan_archi.menu.flash.4194304_1048576.upload.maximum_size=3141632
newsan_archi.menu.flash.4194304_1048576.build.flash_total=4194304
newsan_archi.menu.flash.4194304_1048576.build.flash_length=3141632
newsan_archi.menu.flash.4194304_1048576.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_1048576.build.fs_start=271577088
newsan_archi.menu.flash.4194304_1048576.build.fs_end=272625664
newsan_archi.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
newsan_archi.menu.flash.4194304_2097152.upload.maximum_size=2093056
newsan_archi.menu.flash.4194304_2097152.build.flash_total=4194304
newsan_archi.menu.flash.4194304_2097152.build.flash_length=2093056
newsan_archi.menu.flash.4194304_2097152.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_2097152.build.fs_start=270528512
newsan_archi.menu.flash.4194304_2097152.build.fs_end=272625664
newsan_archi.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
newsan_archi.menu.flash.4194304_3145728.upload.maximum_size=1044480
newsan_archi.menu.flash.4194304_3145728.build.flash_total=4194304
newsan_archi.menu.flash.4194304_3145728.build.flash_length=1044480
newsan_archi.menu.flash.4194304_3145728.build.eeprom_start=272625664
newsan_archi.menu.flash.4194304_3145728.build.fs_start=269479936
newsan_archi.menu.flash.4194304_3145728.build.fs_end=272625664
newsan_archi.menu.freq.200=200 MHz
newsan_archi.menu.freq.200.build.f_cpu=200000000L
newsan_archi.menu.freq.50=50 MHz
newsan_archi.menu.freq.50.build.f_cpu=50000000L
newsan_archi.menu.freq.100=100 MHz
newsan_archi.menu.freq.100.build.f_cpu=100000000L
newsan_archi.menu.freq.120=120 MHz
newsan_archi.menu.freq.120.build.f_cpu=120000000L
newsan_archi.menu.freq.125=125 MHz
newsan_archi.menu.freq.125.build.f_cpu=125000000L
newsan_archi.menu.freq.128=128 MHz
newsan_archi.menu.freq.128.build.f_cpu=128000000L
newsan_archi.menu.freq.133=133 MHz
newsan_archi.menu.freq.133.build.f_cpu=133000000L
newsan_archi.menu.freq.150=150 MHz
newsan_archi.menu.freq.150.build.f_cpu=150000000L
newsan_archi.menu.freq.176=176 MHz
newsan_archi.menu.freq.176.build.f_cpu=176000000L
newsan_archi.menu.freq.225=225 MHz (Overclock)
newsan_archi.menu.freq.225.build.f_cpu=225000000L
newsan_archi.menu.freq.240=240 MHz (Overclock)
newsan_archi.menu.freq.240.build.f_cpu=240000000L
newsan_archi.menu.freq.250=250 MHz (Overclock)
newsan_archi.menu.freq.250.build.f_cpu=250000000L
newsan_archi.menu.freq.276=276 MHz (Overclock)
newsan_archi.menu.freq.276.build.f_cpu=276000000L
newsan_archi.menu.freq.300=300 MHz (Overclock)
newsan_archi.menu.freq.300.build.f_cpu=300000000L
newsan_archi.menu.opt.Small=Small (-Os) (standard)
newsan_archi.menu.opt.Small.build.flags.optimize=-Os
newsan_archi.menu.opt.Optimize=Optimize (-O)
newsan_archi.menu.opt.Optimize.build.flags.optimize=-O
newsan_archi.menu.opt.Optimize2=Optimize More (-O2)
newsan_archi.menu.opt.Optimize2.build.flags.optimize=-O2
newsan_archi.menu.opt.Optimize3=Optimize Even More (-O3)
newsan_archi.menu.opt.Optimize3.build.flags.optimize=-O3
newsan_archi.menu.opt.Fast=Fast (-Ofast) (maybe slower)
newsan_archi.menu.opt.Fast.build.flags.optimize=-Ofast
newsan_archi.menu.opt.Debug=Debug (-Og)
newsan_archi.menu.opt.Debug.build.flags.optimize=-Og
newsan_archi.menu.opt.Disabled=Disabled (-O0)
newsan_archi.menu.opt.Disabled.build.flags.optimize=-O0
newsan_archi.menu.profile.Disabled=Disabled
newsan_archi.menu.profile.Disabled.build.flags.profile=
newsan_archi.menu.profile.Enabled=Enabled
newsan_archi.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
newsan_archi.menu.rtti.Disabled=Disabled
newsan_archi.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
newsan_archi.menu.rtti.Enabled=Enabled
newsan_archi.menu.rtti.Enabled.build.flags.rtti=
newsan_archi.menu.stackprotect.Disabled=Disabled
newsan_archi.menu.stackprotect.Disabled.build.flags.stackprotect=
newsan_archi.menu.stackprotect.Enabled=Enabled
newsan_archi.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
newsan_archi.menu.exceptions.Disabled=Disabled
newsan_archi.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
newsan_archi.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
newsan_archi.menu.exceptions.Enabled=Enabled
newsan_archi.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
newsan_archi.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
newsan_archi.menu.dbgport.Disabled=Disabled
newsan_archi.menu.dbgport.Disabled.build.debug_port=
newsan_archi.menu.dbgport.Serial=Serial
newsan_archi.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
newsan_archi.menu.dbgport.Serial1=Serial1
newsan_archi.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
newsan_archi.menu.dbgport.Serial2=Serial2
newsan_archi.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
newsan_archi.menu.dbgport.SerialSemi=SerialSemi
newsan_archi.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
newsan_archi.menu.dbglvl.None=None
newsan_archi.menu.dbglvl.None.build.debug_level=
newsan_archi.menu.dbglvl.Core=Core
newsan_archi.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
newsan_archi.menu.dbglvl.SPI=SPI
newsan_archi.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
newsan_archi.menu.dbglvl.Wire=Wire
newsan_archi.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
newsan_archi.menu.dbglvl.Bluetooth=Bluetooth
newsan_archi.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
newsan_archi.menu.dbglvl.All=All
newsan_archi.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
newsan_archi.menu.dbglvl.NDEBUG=NDEBUG
newsan_archi.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
newsan_archi.menu.usbstack.picosdk=Pico SDK
newsan_archi.menu.usbstack.picosdk.build.usbstack_flags=
newsan_archi.menu.usbstack.tinyusb=Adafruit TinyUSB
newsan_archi.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
newsan_archi.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
newsan_archi.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
newsan_archi.menu.usbstack.nousb=No USB
newsan_archi.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
newsan_archi.menu.ipbtstack.ipv4only=IPv4 Only
newsan_archi.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
newsan_archi.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
newsan_archi.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
newsan_archi.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
newsan_archi.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
newsan_archi.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
newsan_archi.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
newsan_archi.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
newsan_archi.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
newsan_archi.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
newsan_archi.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
newsan_archi.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
newsan_archi.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
newsan_archi.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
newsan_archi.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
newsan_archi.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
newsan_archi.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
newsan_archi.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
newsan_archi.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
newsan_archi.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
newsan_archi.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
newsan_archi.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
newsan_archi.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
newsan_archi.menu.uploadmethod.default=Default (UF2)
newsan_archi.menu.uploadmethod.default.build.ram_length=256k
newsan_archi.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
newsan_archi.menu.uploadmethod.default.upload.maximum_data_size=262144
newsan_archi.menu.uploadmethod.default.upload.tool=uf2conv
newsan_archi.menu.uploadmethod.default.upload.tool.default=uf2conv
newsan_archi.menu.uploadmethod.default.upload.tool.network=uf2conv-network
newsan_archi.menu.uploadmethod.picotool=Picotool
newsan_archi.menu.uploadmethod.picotool.build.ram_length=256k
newsan_archi.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
newsan_archi.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
newsan_archi.menu.uploadmethod.picotool.upload.maximum_data_size=262144
newsan_archi.menu.uploadmethod.picotool.upload.tool=picotool
newsan_archi.menu.uploadmethod.picotool.upload.tool.default=picotool
newsan_archi.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
newsan_archi.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
newsan_archi.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
newsan_archi.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
newsan_archi.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
newsan_archi.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

