earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Olimex Pico2XL
# -----------------------------------
olimex_pico2xl.name=Olimex Pico2XL
olimex_pico2xl.vid.0=0x15ba
olimex_pico2xl.pid.0=0x0026
olimex_pico2xl.vid.1=0x15ba
olimex_pico2xl.pid.1=0x0126
olimex_pico2xl.vid.2=0x15ba
olimex_pico2xl.pid.2=0x4026
olimex_pico2xl.vid.3=0x15ba
olimex_pico2xl.pid.3=0x4126
olimex_pico2xl.vid.4=0x15ba
olimex_pico2xl.pid.4=0x8026
olimex_pico2xl.vid.5=0x15ba
olimex_pico2xl.pid.5=0x8126
olimex_pico2xl.vid.6=0x15ba
olimex_pico2xl.pid.6=0xc026
olimex_pico2xl.vid.7=0x15ba
olimex_pico2xl.pid.7=0xc126
olimex_pico2xl.upload_port.0.vid=0x15ba
olimex_pico2xl.upload_port.0.pid=0x0026
olimex_pico2xl.upload_port.1.vid=0x15ba
olimex_pico2xl.upload_port.1.pid=0x0126
olimex_pico2xl.upload_port.2.vid=0x15ba
olimex_pico2xl.upload_port.2.pid=0x4026
olimex_pico2xl.upload_port.3.vid=0x15ba
olimex_pico2xl.upload_port.3.pid=0x4126
olimex_pico2xl.upload_port.4.vid=0x15ba
olimex_pico2xl.upload_port.4.pid=0x8026
olimex_pico2xl.upload_port.5.vid=0x15ba
olimex_pico2xl.upload_port.5.pid=0x8126
olimex_pico2xl.upload_port.6.vid=0x15ba
olimex_pico2xl.upload_port.6.pid=0xc026
olimex_pico2xl.upload_port.7.vid=0x15ba
olimex_pico2xl.upload_port.7.pid=0xc126
olimex_pico2xl.build.usbvid=-DUSBD_VID=0x15ba
olimex_pico2xl.build.usbpid=-DUSBD_PID=0x0026
olimex_pico2xl.build.usbpwr=-DUSBD_MAX_POWER_MA=250
olimex_pico2xl.build.board=OLIMEX_PICO2XL
olimex_pico2xl.build.variant=olimex_pico2xl
olimex_pico2xl.upload.maximum_size=2097152
olimex_pico2xl.upload.wait_for_upload_port=true
olimex_pico2xl.upload.erase_cmd=
olimex_pico2xl.serial.disableDTR=false
olimex_pico2xl.serial.disableRTS=false
olimex_pico2xl.build.f_cpu=125000000
olimex_pico2xl.build.led=
olimex_pico2xl.build.core=rp2040
olimex_pico2xl.build.ldscript=memmap_default.ld
olimex_pico2xl.build.boot2=none
olimex_pico2xl.build.usb_manufacturer="Olimex"
olimex_pico2xl.build.usb_product="Pico2XL"
olimex_pico2xl.build.psram_length=0x000000
olimex_pico2xl.menu.flash.2097152_0=2MB (no FS)
olimex_pico2xl.menu.flash.2097152_0.upload.maximum_size=2088960
olimex_pico2xl.menu.flash.2097152_0.build.flash_total=2097152
olimex_pico2xl.menu.flash.2097152_0.build.flash_length=2088960
olimex_pico2xl.menu.flash.2097152_0.build.eeprom_start=270524416
olimex_pico2xl.menu.flash.2097152_0.build.fs_start=270524416
olimex_pico2xl.menu.flash.2097152_0.build.fs_end=270524416
olimex_pico2xl.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
olimex_pico2xl.menu.flash.2097152_65536.upload.maximum_size=2023424
olimex_pico2xl.menu.flash.2097152_65536.build.flash_total=2097152
olimex_pico2xl.menu.flash.2097152_65536.build.flash_length=2023424
olimex_pico2xl.menu.flash.2097152_65536.build.eeprom_start=270524416
olimex_pico2xl.menu.flash.2097152_65536.build.fs_start=270458880
olimex_pico2xl.menu.flash.2097152_65536.build.fs_end=270524416
olimex_pico2xl.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
olimex_pico2xl.menu.flash.2097152_131072.upload.maximum_size=1957888
olimex_pico2xl.menu.flash.2097152_131072.build.flash_total=2097152
olimex_pico2xl.menu.flash.2097152_131072.build.flash_length=1957888
olimex_pico2xl.menu.flash.2097152_131072.build.eeprom_start=270524416
olimex_pico2xl.menu.flash.2097152_131072.build.fs_start=270393344
olimex_pico2xl.menu.flash.2097152_131072.build.fs_end=270524416
olimex_pico2xl.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
olimex_pico2xl.menu.flash.2097152_262144.upload.maximum_size=1826816
olimex_pico2xl.menu.flash.2097152_262144.build.flash_total=2097152
olimex_pico2xl.menu.flash.2097152_262144.build.flash_length=1826816
olimex_pico2xl.menu.flash.2097152_262144.build.eeprom_start=270524416
olimex_pico2xl.menu.flash.2097152_262144.build.fs_start=270262272
olimex_pico2xl.menu.flash.2097152_262144.build.fs_end=270524416
olimex_pico2xl.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
olimex_pico2xl.menu.flash.2097152_524288.upload.maximum_size=1564672
olimex_pico2xl.menu.flash.2097152_524288.build.flash_total=2097152
olimex_pico2xl.menu.flash.2097152_524288.build.flash_length=1564672
olimex_pico2xl.menu.flash.2097152_524288.build.eeprom_start=270524416
olimex_pico2xl.menu.flash.2097152_524288.build.fs_start=270000128
olimex_pico2xl.menu.flash.2097152_524288.build.fs_end=270524416
olimex_pico2xl.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
olimex_pico2xl.menu.flash.2097152_1048576.upload.maximum_size=1040384
olimex_pico2xl.menu.flash.2097152_1048576.build.flash_total=2097152
olimex_pico2xl.menu.flash.2097152_1048576.build.flash_length=1040384
olimex_pico2xl.menu.flash.2097152_1048576.build.eeprom_start=270524416
olimex_pico2xl.menu.flash.2097152_1048576.build.fs_start=269475840
olimex_pico2xl.menu.flash.2097152_1048576.build.fs_end=270524416
olimex_pico2xl.menu.arch.arm=ARM
olimex_pico2xl.menu.arch.arm.build.chip=rp2350
olimex_pico2xl.menu.arch.arm.build.toolchain=arm-none-eabi
olimex_pico2xl.menu.arch.arm.build.toolchainpkg=pqt-gcc
olimex_pico2xl.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
olimex_pico2xl.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
olimex_pico2xl.menu.arch.arm.build.mcu=cortex-m33
olimex_pico2xl.menu.arch.riscv=RISC-V
olimex_pico2xl.menu.arch.riscv.build.chip=rp2350-riscv
olimex_pico2xl.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
olimex_pico2xl.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
olimex_pico2xl.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
olimex_pico2xl.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
olimex_pico2xl.menu.arch.riscv.build.mcu=rv32imac
olimex_pico2xl.menu.freq.150=150 MHz
olimex_pico2xl.menu.freq.150.build.f_cpu=150000000L
olimex_pico2xl.menu.freq.50=50 MHz
olimex_pico2xl.menu.freq.50.build.f_cpu=50000000L
olimex_pico2xl.menu.freq.100=100 MHz
olimex_pico2xl.menu.freq.100.build.f_cpu=100000000L
olimex_pico2xl.menu.freq.120=120 MHz
olimex_pico2xl.menu.freq.120.build.f_cpu=120000000L
olimex_pico2xl.menu.freq.125=125 MHz
olimex_pico2xl.menu.freq.125.build.f_cpu=125000000L
olimex_pico2xl.menu.freq.128=128 MHz
olimex_pico2xl.menu.freq.128.build.f_cpu=128000000L
olimex_pico2xl.menu.freq.133=133 MHz
olimex_pico2xl.menu.freq.133.build.f_cpu=133000000L
olimex_pico2xl.menu.freq.176=176 MHz (Overclock)
olimex_pico2xl.menu.freq.176.build.f_cpu=176000000L
olimex_pico2xl.menu.freq.200=200 MHz (Overclock)
olimex_pico2xl.menu.freq.200.build.f_cpu=200000000L
olimex_pico2xl.menu.freq.225=225 MHz (Overclock)
olimex_pico2xl.menu.freq.225.build.f_cpu=225000000L
olimex_pico2xl.menu.freq.240=240 MHz (Overclock)
olimex_pico2xl.menu.freq.240.build.f_cpu=240000000L
olimex_pico2xl.menu.freq.250=250 MHz (Overclock)
olimex_pico2xl.menu.freq.250.build.f_cpu=250000000L
olimex_pico2xl.menu.freq.276=276 MHz (Overclock)
olimex_pico2xl.menu.freq.276.build.f_cpu=276000000L
olimex_pico2xl.menu.freq.300=300 MHz (Overclock)
olimex_pico2xl.menu.freq.300.build.f_cpu=300000000L
olimex_pico2xl.menu.opt.Small=Small (-Os) (standard)
olimex_pico2xl.menu.opt.Small.build.flags.optimize=-Os
olimex_pico2xl.menu.opt.Optimize=Optimize (-O)
olimex_pico2xl.menu.opt.Optimize.build.flags.optimize=-O
olimex_pico2xl.menu.opt.Optimize2=Optimize More (-O2)
olimex_pico2xl.menu.opt.Optimize2.build.flags.optimize=-O2
olimex_pico2xl.menu.opt.Optimize3=Optimize Even More (-O3)
olimex_pico2xl.menu.opt.Optimize3.build.flags.optimize=-O3
olimex_pico2xl.menu.opt.Fast=Fast (-Ofast) (maybe slower)
olimex_pico2xl.menu.opt.Fast.build.flags.optimize=-Ofast
olimex_pico2xl.menu.opt.Debug=Debug (-Og)
olimex_pico2xl.menu.opt.Debug.build.flags.optimize=-Og
olimex_pico2xl.menu.opt.Disabled=Disabled (-O0)
olimex_pico2xl.menu.opt.Disabled.build.flags.optimize=-O0
olimex_pico2xl.menu.profile.Disabled=Disabled
olimex_pico2xl.menu.profile.Disabled.build.flags.profile=
olimex_pico2xl.menu.profile.Enabled=Enabled
olimex_pico2xl.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
olimex_pico2xl.menu.rtti.Disabled=Disabled
olimex_pico2xl.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
olimex_pico2xl.menu.rtti.Enabled=Enabled
olimex_pico2xl.menu.rtti.Enabled.build.flags.rtti=
olimex_pico2xl.menu.stackprotect.Disabled=Disabled
olimex_pico2xl.menu.stackprotect.Disabled.build.flags.stackprotect=
olimex_pico2xl.menu.stackprotect.Enabled=Enabled
olimex_pico2xl.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
olimex_pico2xl.menu.exceptions.Disabled=Disabled
olimex_pico2xl.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
olimex_pico2xl.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
olimex_pico2xl.menu.exceptions.Enabled=Enabled
olimex_pico2xl.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
olimex_pico2xl.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
olimex_pico2xl.menu.dbgport.Disabled=Disabled
olimex_pico2xl.menu.dbgport.Disabled.build.debug_port=
olimex_pico2xl.menu.dbgport.Serial=Serial
olimex_pico2xl.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
olimex_pico2xl.menu.dbgport.Serial1=Serial1
olimex_pico2xl.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
olimex_pico2xl.menu.dbgport.Serial2=Serial2
olimex_pico2xl.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
olimex_pico2xl.menu.dbgport.SerialSemi=SerialSemi
olimex_pico2xl.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
olimex_pico2xl.menu.dbglvl.None=None
olimex_pico2xl.menu.dbglvl.None.build.debug_level=
olimex_pico2xl.menu.dbglvl.Core=Core
olimex_pico2xl.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
olimex_pico2xl.menu.dbglvl.SPI=SPI
olimex_pico2xl.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
olimex_pico2xl.menu.dbglvl.Wire=Wire
olimex_pico2xl.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
olimex_pico2xl.menu.dbglvl.Bluetooth=Bluetooth
olimex_pico2xl.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
olimex_pico2xl.menu.dbglvl.All=All
olimex_pico2xl.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
olimex_pico2xl.menu.dbglvl.NDEBUG=NDEBUG
olimex_pico2xl.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
olimex_pico2xl.menu.usbstack.picosdk=Pico SDK
olimex_pico2xl.menu.usbstack.picosdk.build.usbstack_flags=
olimex_pico2xl.menu.usbstack.tinyusb=Adafruit TinyUSB
olimex_pico2xl.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_pico2xl.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
olimex_pico2xl.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_pico2xl.menu.usbstack.nousb=No USB
olimex_pico2xl.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
olimex_pico2xl.menu.ipbtstack.ipv4only=IPv4 Only
olimex_pico2xl.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
olimex_pico2xl.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
olimex_pico2xl.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
olimex_pico2xl.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
olimex_pico2xl.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
olimex_pico2xl.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
olimex_pico2xl.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
olimex_pico2xl.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_pico2xl.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
olimex_pico2xl.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
olimex_pico2xl.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_pico2xl.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
olimex_pico2xl.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
olimex_pico2xl.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_pico2xl.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
olimex_pico2xl.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
olimex_pico2xl.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_pico2xl.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
olimex_pico2xl.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
olimex_pico2xl.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_pico2xl.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
olimex_pico2xl.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
olimex_pico2xl.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_pico2xl.menu.uploadmethod.default=Default (UF2)
olimex_pico2xl.menu.uploadmethod.default.build.ram_length=512k
olimex_pico2xl.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_pico2xl.menu.uploadmethod.default.upload.maximum_data_size=524288
olimex_pico2xl.menu.uploadmethod.default.upload.tool=uf2conv
olimex_pico2xl.menu.uploadmethod.default.upload.tool.default=uf2conv
olimex_pico2xl.menu.uploadmethod.default.upload.tool.network=uf2conv-network
olimex_pico2xl.menu.uploadmethod.picotool=Picotool
olimex_pico2xl.menu.uploadmethod.picotool.build.ram_length=512k
olimex_pico2xl.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
olimex_pico2xl.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
olimex_pico2xl.menu.uploadmethod.picotool.upload.maximum_data_size=524288
olimex_pico2xl.menu.uploadmethod.picotool.upload.tool=picotool
olimex_pico2xl.menu.uploadmethod.picotool.upload.tool.default=picotool
olimex_pico2xl.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
olimex_pico2xl.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
olimex_pico2xl.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_pico2xl.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
olimex_pico2xl.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
olimex_pico2xl.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

