earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Olimex Pico2XXL
# -----------------------------------
olimex_pico2xxl.name=Olimex Pico2XXL
olimex_pico2xxl.vid.0=0x15ba
olimex_pico2xxl.pid.0=0x0026
olimex_pico2xxl.vid.1=0x15ba
olimex_pico2xxl.pid.1=0x0126
olimex_pico2xxl.vid.2=0x15ba
olimex_pico2xxl.pid.2=0x4026
olimex_pico2xxl.vid.3=0x15ba
olimex_pico2xxl.pid.3=0x4126
olimex_pico2xxl.vid.4=0x15ba
olimex_pico2xxl.pid.4=0x8026
olimex_pico2xxl.vid.5=0x15ba
olimex_pico2xxl.pid.5=0x8126
olimex_pico2xxl.vid.6=0x15ba
olimex_pico2xxl.pid.6=0xc026
olimex_pico2xxl.vid.7=0x15ba
olimex_pico2xxl.pid.7=0xc126
olimex_pico2xxl.upload_port.0.vid=0x15ba
olimex_pico2xxl.upload_port.0.pid=0x0026
olimex_pico2xxl.upload_port.1.vid=0x15ba
olimex_pico2xxl.upload_port.1.pid=0x0126
olimex_pico2xxl.upload_port.2.vid=0x15ba
olimex_pico2xxl.upload_port.2.pid=0x4026
olimex_pico2xxl.upload_port.3.vid=0x15ba
olimex_pico2xxl.upload_port.3.pid=0x4126
olimex_pico2xxl.upload_port.4.vid=0x15ba
olimex_pico2xxl.upload_port.4.pid=0x8026
olimex_pico2xxl.upload_port.5.vid=0x15ba
olimex_pico2xxl.upload_port.5.pid=0x8126
olimex_pico2xxl.upload_port.6.vid=0x15ba
olimex_pico2xxl.upload_port.6.pid=0xc026
olimex_pico2xxl.upload_port.7.vid=0x15ba
olimex_pico2xxl.upload_port.7.pid=0xc126
olimex_pico2xxl.build.usbvid=-DUSBD_VID=0x15ba
olimex_pico2xxl.build.usbpid=-DUSBD_PID=0x0026
olimex_pico2xxl.build.usbpwr=-DUSBD_MAX_POWER_MA=500
olimex_pico2xxl.build.board=OLIMEX_PICO2XXL
olimex_pico2xxl.build.variant=olimex_pico2xxl
olimex_pico2xxl.upload.maximum_size=16777216
olimex_pico2xxl.upload.wait_for_upload_port=true
olimex_pico2xxl.upload.erase_cmd=
olimex_pico2xxl.serial.disableDTR=false
olimex_pico2xxl.serial.disableRTS=false
olimex_pico2xxl.build.f_cpu=125000000
olimex_pico2xxl.build.led=
olimex_pico2xxl.build.core=rp2040
olimex_pico2xxl.build.ldscript=memmap_default.ld
olimex_pico2xxl.build.boot2=none
olimex_pico2xxl.build.usb_manufacturer="Olimex"
olimex_pico2xxl.build.usb_product="Pico2XXL"
olimex_pico2xxl.build.psram_length=0x800000
olimex_pico2xxl.menu.flash.16777216_0=16MB (no FS)
olimex_pico2xxl.menu.flash.16777216_0.upload.maximum_size=16769024
olimex_pico2xxl.menu.flash.16777216_0.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_0.build.flash_length=16769024
olimex_pico2xxl.menu.flash.16777216_0.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_0.build.fs_start=285204480
olimex_pico2xxl.menu.flash.16777216_0.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
olimex_pico2xxl.menu.flash.16777216_65536.upload.maximum_size=16703488
olimex_pico2xxl.menu.flash.16777216_65536.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_65536.build.flash_length=16703488
olimex_pico2xxl.menu.flash.16777216_65536.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_65536.build.fs_start=285138944
olimex_pico2xxl.menu.flash.16777216_65536.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
olimex_pico2xxl.menu.flash.16777216_131072.upload.maximum_size=16637952
olimex_pico2xxl.menu.flash.16777216_131072.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_131072.build.flash_length=16637952
olimex_pico2xxl.menu.flash.16777216_131072.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_131072.build.fs_start=285073408
olimex_pico2xxl.menu.flash.16777216_131072.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
olimex_pico2xxl.menu.flash.16777216_262144.upload.maximum_size=16506880
olimex_pico2xxl.menu.flash.16777216_262144.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_262144.build.flash_length=16506880
olimex_pico2xxl.menu.flash.16777216_262144.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_262144.build.fs_start=284942336
olimex_pico2xxl.menu.flash.16777216_262144.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
olimex_pico2xxl.menu.flash.16777216_524288.upload.maximum_size=16244736
olimex_pico2xxl.menu.flash.16777216_524288.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_524288.build.flash_length=16244736
olimex_pico2xxl.menu.flash.16777216_524288.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_524288.build.fs_start=284680192
olimex_pico2xxl.menu.flash.16777216_524288.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
olimex_pico2xxl.menu.flash.16777216_1048576.upload.maximum_size=15720448
olimex_pico2xxl.menu.flash.16777216_1048576.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_1048576.build.flash_length=15720448
olimex_pico2xxl.menu.flash.16777216_1048576.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_1048576.build.fs_start=284155904
olimex_pico2xxl.menu.flash.16777216_1048576.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
olimex_pico2xxl.menu.flash.16777216_2097152.upload.maximum_size=14671872
olimex_pico2xxl.menu.flash.16777216_2097152.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_2097152.build.flash_length=14671872
olimex_pico2xxl.menu.flash.16777216_2097152.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_2097152.build.fs_start=283107328
olimex_pico2xxl.menu.flash.16777216_2097152.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
olimex_pico2xxl.menu.flash.16777216_3145728.upload.maximum_size=13623296
olimex_pico2xxl.menu.flash.16777216_3145728.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_3145728.build.flash_length=13623296
olimex_pico2xxl.menu.flash.16777216_3145728.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_3145728.build.fs_start=282058752
olimex_pico2xxl.menu.flash.16777216_3145728.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
olimex_pico2xxl.menu.flash.16777216_4194304.upload.maximum_size=12574720
olimex_pico2xxl.menu.flash.16777216_4194304.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_4194304.build.flash_length=12574720
olimex_pico2xxl.menu.flash.16777216_4194304.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_4194304.build.fs_start=281010176
olimex_pico2xxl.menu.flash.16777216_4194304.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
olimex_pico2xxl.menu.flash.16777216_5242880.upload.maximum_size=11526144
olimex_pico2xxl.menu.flash.16777216_5242880.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_5242880.build.flash_length=11526144
olimex_pico2xxl.menu.flash.16777216_5242880.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_5242880.build.fs_start=279961600
olimex_pico2xxl.menu.flash.16777216_5242880.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
olimex_pico2xxl.menu.flash.16777216_6291456.upload.maximum_size=10477568
olimex_pico2xxl.menu.flash.16777216_6291456.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_6291456.build.flash_length=10477568
olimex_pico2xxl.menu.flash.16777216_6291456.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_6291456.build.fs_start=278913024
olimex_pico2xxl.menu.flash.16777216_6291456.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
olimex_pico2xxl.menu.flash.16777216_7340032.upload.maximum_size=9428992
olimex_pico2xxl.menu.flash.16777216_7340032.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_7340032.build.flash_length=9428992
olimex_pico2xxl.menu.flash.16777216_7340032.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_7340032.build.fs_start=277864448
olimex_pico2xxl.menu.flash.16777216_7340032.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
olimex_pico2xxl.menu.flash.16777216_8388608.upload.maximum_size=8380416
olimex_pico2xxl.menu.flash.16777216_8388608.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_8388608.build.flash_length=8380416
olimex_pico2xxl.menu.flash.16777216_8388608.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_8388608.build.fs_start=276815872
olimex_pico2xxl.menu.flash.16777216_8388608.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
olimex_pico2xxl.menu.flash.16777216_9437184.upload.maximum_size=7331840
olimex_pico2xxl.menu.flash.16777216_9437184.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_9437184.build.flash_length=7331840
olimex_pico2xxl.menu.flash.16777216_9437184.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_9437184.build.fs_start=275767296
olimex_pico2xxl.menu.flash.16777216_9437184.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
olimex_pico2xxl.menu.flash.16777216_10485760.upload.maximum_size=6283264
olimex_pico2xxl.menu.flash.16777216_10485760.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_10485760.build.flash_length=6283264
olimex_pico2xxl.menu.flash.16777216_10485760.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_10485760.build.fs_start=274718720
olimex_pico2xxl.menu.flash.16777216_10485760.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
olimex_pico2xxl.menu.flash.16777216_11534336.upload.maximum_size=5234688
olimex_pico2xxl.menu.flash.16777216_11534336.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_11534336.build.flash_length=5234688
olimex_pico2xxl.menu.flash.16777216_11534336.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_11534336.build.fs_start=273670144
olimex_pico2xxl.menu.flash.16777216_11534336.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
olimex_pico2xxl.menu.flash.16777216_12582912.upload.maximum_size=4186112
olimex_pico2xxl.menu.flash.16777216_12582912.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_12582912.build.flash_length=4186112
olimex_pico2xxl.menu.flash.16777216_12582912.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_12582912.build.fs_start=272621568
olimex_pico2xxl.menu.flash.16777216_12582912.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
olimex_pico2xxl.menu.flash.16777216_13631488.upload.maximum_size=3137536
olimex_pico2xxl.menu.flash.16777216_13631488.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_13631488.build.flash_length=3137536
olimex_pico2xxl.menu.flash.16777216_13631488.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_13631488.build.fs_start=271572992
olimex_pico2xxl.menu.flash.16777216_13631488.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
olimex_pico2xxl.menu.flash.16777216_14680064.upload.maximum_size=2088960
olimex_pico2xxl.menu.flash.16777216_14680064.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_14680064.build.flash_length=2088960
olimex_pico2xxl.menu.flash.16777216_14680064.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_14680064.build.fs_start=270524416
olimex_pico2xxl.menu.flash.16777216_14680064.build.fs_end=285204480
olimex_pico2xxl.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
olimex_pico2xxl.menu.flash.16777216_15728640.upload.maximum_size=1040384
olimex_pico2xxl.menu.flash.16777216_15728640.build.flash_total=16777216
olimex_pico2xxl.menu.flash.16777216_15728640.build.flash_length=1040384
olimex_pico2xxl.menu.flash.16777216_15728640.build.eeprom_start=285204480
olimex_pico2xxl.menu.flash.16777216_15728640.build.fs_start=269475840
olimex_pico2xxl.menu.flash.16777216_15728640.build.fs_end=285204480
olimex_pico2xxl.menu.arch.arm=ARM
olimex_pico2xxl.menu.arch.arm.build.chip=rp2350
olimex_pico2xxl.menu.arch.arm.build.toolchain=arm-none-eabi
olimex_pico2xxl.menu.arch.arm.build.toolchainpkg=pqt-gcc
olimex_pico2xxl.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
olimex_pico2xxl.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
olimex_pico2xxl.menu.arch.arm.build.mcu=cortex-m33
olimex_pico2xxl.menu.arch.riscv=RISC-V
olimex_pico2xxl.menu.arch.riscv.build.chip=rp2350-riscv
olimex_pico2xxl.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
olimex_pico2xxl.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
olimex_pico2xxl.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
olimex_pico2xxl.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
olimex_pico2xxl.menu.arch.riscv.build.mcu=rv32imac
olimex_pico2xxl.menu.freq.150=150 MHz
olimex_pico2xxl.menu.freq.150.build.f_cpu=150000000L
olimex_pico2xxl.menu.freq.50=50 MHz
olimex_pico2xxl.menu.freq.50.build.f_cpu=50000000L
olimex_pico2xxl.menu.freq.100=100 MHz
olimex_pico2xxl.menu.freq.100.build.f_cpu=100000000L
olimex_pico2xxl.menu.freq.120=120 MHz
olimex_pico2xxl.menu.freq.120.build.f_cpu=120000000L
olimex_pico2xxl.menu.freq.125=125 MHz
olimex_pico2xxl.menu.freq.125.build.f_cpu=125000000L
olimex_pico2xxl.menu.freq.128=128 MHz
olimex_pico2xxl.menu.freq.128.build.f_cpu=128000000L
olimex_pico2xxl.menu.freq.133=133 MHz
olimex_pico2xxl.menu.freq.133.build.f_cpu=133000000L
olimex_pico2xxl.menu.freq.176=176 MHz (Overclock)
olimex_pico2xxl.menu.freq.176.build.f_cpu=176000000L
olimex_pico2xxl.menu.freq.200=200 MHz (Overclock)
olimex_pico2xxl.menu.freq.200.build.f_cpu=200000000L
olimex_pico2xxl.menu.freq.225=225 MHz (Overclock)
olimex_pico2xxl.menu.freq.225.build.f_cpu=225000000L
olimex_pico2xxl.menu.freq.240=240 MHz (Overclock)
olimex_pico2xxl.menu.freq.240.build.f_cpu=240000000L
olimex_pico2xxl.menu.freq.250=250 MHz (Overclock)
olimex_pico2xxl.menu.freq.250.build.f_cpu=250000000L
olimex_pico2xxl.menu.freq.276=276 MHz (Overclock)
olimex_pico2xxl.menu.freq.276.build.f_cpu=276000000L
olimex_pico2xxl.menu.freq.300=300 MHz (Overclock)
olimex_pico2xxl.menu.freq.300.build.f_cpu=300000000L
olimex_pico2xxl.menu.opt.Small=Small (-Os) (standard)
olimex_pico2xxl.menu.opt.Small.build.flags.optimize=-Os
olimex_pico2xxl.menu.opt.Optimize=Optimize (-O)
olimex_pico2xxl.menu.opt.Optimize.build.flags.optimize=-O
olimex_pico2xxl.menu.opt.Optimize2=Optimize More (-O2)
olimex_pico2xxl.menu.opt.Optimize2.build.flags.optimize=-O2
olimex_pico2xxl.menu.opt.Optimize3=Optimize Even More (-O3)
olimex_pico2xxl.menu.opt.Optimize3.build.flags.optimize=-O3
olimex_pico2xxl.menu.opt.Fast=Fast (-Ofast) (maybe slower)
olimex_pico2xxl.menu.opt.Fast.build.flags.optimize=-Ofast
olimex_pico2xxl.menu.opt.Debug=Debug (-Og)
olimex_pico2xxl.menu.opt.Debug.build.flags.optimize=-Og
olimex_pico2xxl.menu.opt.Disabled=Disabled (-O0)
olimex_pico2xxl.menu.opt.Disabled.build.flags.optimize=-O0
olimex_pico2xxl.menu.profile.Disabled=Disabled
olimex_pico2xxl.menu.profile.Disabled.build.flags.profile=
olimex_pico2xxl.menu.profile.Enabled=Enabled
olimex_pico2xxl.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
olimex_pico2xxl.menu.rtti.Disabled=Disabled
olimex_pico2xxl.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
olimex_pico2xxl.menu.rtti.Enabled=Enabled
olimex_pico2xxl.menu.rtti.Enabled.build.flags.rtti=
olimex_pico2xxl.menu.stackprotect.Disabled=Disabled
olimex_pico2xxl.menu.stackprotect.Disabled.build.flags.stackprotect=
olimex_pico2xxl.menu.stackprotect.Enabled=Enabled
olimex_pico2xxl.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
olimex_pico2xxl.menu.exceptions.Disabled=Disabled
olimex_pico2xxl.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
olimex_pico2xxl.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
olimex_pico2xxl.menu.exceptions.Enabled=Enabled
olimex_pico2xxl.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
olimex_pico2xxl.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
olimex_pico2xxl.menu.dbgport.Disabled=Disabled
olimex_pico2xxl.menu.dbgport.Disabled.build.debug_port=
olimex_pico2xxl.menu.dbgport.Serial=Serial
olimex_pico2xxl.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
olimex_pico2xxl.menu.dbgport.Serial1=Serial1
olimex_pico2xxl.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
olimex_pico2xxl.menu.dbgport.Serial2=Serial2
olimex_pico2xxl.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
olimex_pico2xxl.menu.dbgport.SerialSemi=SerialSemi
olimex_pico2xxl.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
olimex_pico2xxl.menu.dbglvl.None=None
olimex_pico2xxl.menu.dbglvl.None.build.debug_level=
olimex_pico2xxl.menu.dbglvl.Core=Core
olimex_pico2xxl.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
olimex_pico2xxl.menu.dbglvl.SPI=SPI
olimex_pico2xxl.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
olimex_pico2xxl.menu.dbglvl.Wire=Wire
olimex_pico2xxl.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
olimex_pico2xxl.menu.dbglvl.Bluetooth=Bluetooth
olimex_pico2xxl.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
olimex_pico2xxl.menu.dbglvl.All=All
olimex_pico2xxl.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
olimex_pico2xxl.menu.dbglvl.NDEBUG=NDEBUG
olimex_pico2xxl.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
olimex_pico2xxl.menu.usbstack.picosdk=Pico SDK
olimex_pico2xxl.menu.usbstack.picosdk.build.usbstack_flags=
olimex_pico2xxl.menu.usbstack.tinyusb=Adafruit TinyUSB
olimex_pico2xxl.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_pico2xxl.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
