earlephilhower/arduino-pico/boards.txt
olimex_pico2xxl.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
olimex_pico2xxl.menu.usbstack.nousb=No USB
olimex_pico2xxl.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
olimex_pico2xxl.menu.ipbtstack.ipv4only=IPv4 Only
olimex_pico2xxl.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
olimex_pico2xxl.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
olimex_pico2xxl.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
olimex_pico2xxl.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
olimex_pico2xxl.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
olimex_pico2xxl.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
olimex_pico2xxl.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
olimex_pico2xxl.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
olimex_pico2xxl.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
olimex_pico2xxl.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
olimex_pico2xxl.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
olimex_pico2xxl.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
olimex_pico2xxl.menu.uploadmethod.default=Default (UF2)
olimex_pico2xxl.menu.uploadmethod.default.build.ram_length=512k
olimex_pico2xxl.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_pico2xxl.menu.uploadmethod.default.upload.maximum_data_size=524288
olimex_pico2xxl.menu.uploadmethod.default.upload.tool=uf2conv
olimex_pico2xxl.menu.uploadmethod.default.upload.tool.default=uf2conv
olimex_pico2xxl.menu.uploadmethod.default.upload.tool.network=uf2conv-network
olimex_pico2xxl.menu.uploadmethod.picotool=Picotool
olimex_pico2xxl.menu.uploadmethod.picotool.build.ram_length=512k
olimex_pico2xxl.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
olimex_pico2xxl.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
olimex_pico2xxl.menu.uploadmethod.picotool.upload.maximum_data_size=524288
olimex_pico2xxl.menu.uploadmethod.picotool.upload.tool=picotool
olimex_pico2xxl.menu.uploadmethod.picotool.upload.tool.default=picotool
olimex_pico2xxl.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
olimex_pico2xxl.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
olimex_pico2xxl.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
olimex_pico2xxl.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
olimex_pico2xxl.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
olimex_pico2xxl.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Olimex RP2040-Pico30
# -----------------------------------
olimex_rp2040pico30.name=Olimex RP2040-Pico30
olimex_rp2040pico30.vid.0=0x15ba
olimex_rp2040pico30.pid.0=0x0026
olimex_rp2040pico30.vid.1=0x15ba
olimex_rp2040pico30.pid.1=0x0126
olimex_rp2040pico30.vid.2=0x15ba
olimex_rp2040pico30.pid.2=0x4026
olimex_rp2040pico30.vid.3=0x15ba
olimex_rp2040pico30.pid.3=0x4126
olimex_rp2040pico30.vid.4=0x15ba
olimex_rp2040pico30.pid.4=0x8026
olimex_rp2040pico30.vid.5=0x15ba
olimex_rp2040pico30.pid.5=0x8126
olimex_rp2040pico30.vid.6=0x15ba
olimex_rp2040pico30.pid.6=0xc026
olimex_rp2040pico30.vid.7=0x15ba
olimex_rp2040pico30.pid.7=0xc126
olimex_rp2040pico30.upload_port.0.vid=0x15ba
olimex_rp2040pico30.upload_port.0.pid=0x0026
olimex_rp2040pico30.upload_port.1.vid=0x15ba
olimex_rp2040pico30.upload_port.1.pid=0x0126
olimex_rp2040pico30.upload_port.2.vid=0x15ba
olimex_rp2040pico30.upload_port.2.pid=0x4026
olimex_rp2040pico30.upload_port.3.vid=0x15ba
olimex_rp2040pico30.upload_port.3.pid=0x4126
olimex_rp2040pico30.upload_port.4.vid=0x15ba
olimex_rp2040pico30.upload_port.4.pid=0x8026
olimex_rp2040pico30.upload_port.5.vid=0x15ba
olimex_rp2040pico30.upload_port.5.pid=0x8126
olimex_rp2040pico30.upload_port.6.vid=0x15ba
olimex_rp2040pico30.upload_port.6.pid=0xc026
olimex_rp2040pico30.upload_port.7.vid=0x15ba
olimex_rp2040pico30.upload_port.7.pid=0xc126
olimex_rp2040pico30.build.usbvid=-DUSBD_VID=0x15ba
olimex_rp2040pico30.build.usbpid=-DUSBD_PID=0x0026
olimex_rp2040pico30.build.usbpwr=-DUSBD_MAX_POWER_MA=250
olimex_rp2040pico30.build.board=OLIMEX_RP2040_PICO30
olimex_rp2040pico30.build.mcu=cortex-m0plus
olimex_rp2040pico30.build.chip=rp2040
olimex_rp2040pico30.build.toolchain=arm-none-eabi
olimex_rp2040pico30.build.toolchainpkg=pqt-gcc
olimex_rp2040pico30.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
olimex_rp2040pico30.build.uf2family=--family rp2040
olimex_rp2040pico30.build.variant=olimex_rp2040pico30
olimex_rp2040pico30.upload.maximum_size=2097152
olimex_rp2040pico30.upload.wait_for_upload_port=true
olimex_rp2040pico30.upload.erase_cmd=
olimex_rp2040pico30.serial.disableDTR=false
olimex_rp2040pico30.serial.disableRTS=false
olimex_rp2040pico30.build.f_cpu=125000000
olimex_rp2040pico30.build.led=
olimex_rp2040pico30.build.core=rp2040
olimex_rp2040pico30.build.ldscript=memmap_default.ld
olimex_rp2040pico30.build.boot2=boot2_w25q080_2_padded_checksum
olimex_rp2040pico30.build.usb_manufacturer="Olimex"
olimex_rp2040pico30.build.usb_product="RP2040-Pico30"
olimex_rp2040pico30.menu.flash.2097152_0=2MB (no FS)
olimex_rp2040pico30.menu.flash.2097152_0.upload.maximum_size=2093056
olimex_rp2040pico30.menu.flash.2097152_0.build.flash_total=2097152
olimex_rp2040pico30.menu.flash.2097152_0.build.flash_length=2093056
olimex_rp2040pico30.menu.flash.2097152_0.build.eeprom_start=270528512
olimex_rp2040pico30.menu.flash.2097152_0.build.fs_start=270528512
olimex_rp2040pico30.menu.flash.2097152_0.build.fs_end=270528512
olimex_rp2040pico30.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
olimex_rp2040pico30.menu.flash.2097152_65536.upload.maximum_size=2027520
olimex_rp2040pico30.menu.flash.2097152_65536.build.flash_total=2097152
olimex_rp2040pico30.menu.flash.2097152_65536.build.flash_length=2027520
olimex_rp2040pico30.menu.flash.2097152_65536.build.eeprom_start=270528512
olimex_rp2040pico30.menu.flash.2097152_65536.build.fs_start=270462976
olimex_rp2040pico30.menu.flash.2097152_65536.build.fs_end=270528512
olimex_rp2040pico30.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
olimex_rp2040pico30.menu.flash.2097152_131072.upload.maximum_size=1961984
olimex_rp2040pico30.menu.flash.2097152_131072.build.flash_total=2097152
olimex_rp2040pico30.menu.flash.2097152_131072.build.flash_length=1961984
olimex_rp2040pico30.menu.flash.2097152_131072.build.eeprom_start=270528512
olimex_rp2040pico30.menu.flash.2097152_131072.build.fs_start=270397440
olimex_rp2040pico30.menu.flash.2097152_131072.build.fs_end=270528512
olimex_rp2040pico30.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
olimex_rp2040pico30.menu.flash.2097152_262144.upload.maximum_size=1830912
olimex_rp2040pico30.menu.flash.2097152_262144.build.flash_total=2097152
olimex_rp2040pico30.menu.flash.2097152_262144.build.flash_length=1830912
olimex_rp2040pico30.menu.flash.2097152_262144.build.eeprom_start=270528512
olimex_rp2040pico30.menu.flash.2097152_262144.build.fs_start=270266368
olimex_rp2040pico30.menu.flash.2097152_262144.build.fs_end=270528512
olimex_rp2040pico30.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
olimex_rp2040pico30.menu.flash.2097152_524288.upload.maximum_size=1568768
olimex_rp2040pico30.menu.flash.2097152_524288.build.flash_total=2097152
olimex_rp2040pico30.menu.flash.2097152_524288.build.flash_length=1568768
olimex_rp2040pico30.menu.flash.2097152_524288.build.eeprom_start=270528512
olimex_rp2040pico30.menu.flash.2097152_524288.build.fs_start=270004224
olimex_rp2040pico30.menu.flash.2097152_524288.build.fs_end=270528512
olimex_rp2040pico30.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
olimex_rp2040pico30.menu.flash.2097152_1048576.upload.maximum_size=1044480
olimex_rp2040pico30.menu.flash.2097152_1048576.build.flash_total=2097152
olimex_rp2040pico30.menu.flash.2097152_1048576.build.flash_length=1044480
olimex_rp2040pico30.menu.flash.2097152_1048576.build.eeprom_start=270528512
olimex_rp2040pico30.menu.flash.2097152_1048576.build.fs_start=269479936
olimex_rp2040pico30.menu.flash.2097152_1048576.build.fs_end=270528512
olimex_rp2040pico30.menu.flash.16777216_0=16MB (no FS)
olimex_rp2040pico30.menu.flash.16777216_0.upload.maximum_size=16773120
olimex_rp2040pico30.menu.flash.16777216_0.build.flash_total=16777216
olimex_rp2040pico30.menu.flash.16777216_0.build.flash_length=16773120
olimex_rp2040pico30.menu.flash.16777216_0.build.eeprom_start=285208576
olimex_rp2040pico30.menu.flash.16777216_0.build.fs_start=285208576
olimex_rp2040pico30.menu.flash.16777216_0.build.fs_end=285208576
olimex_rp2040pico30.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
olimex_rp2040pico30.menu.flash.16777216_15728640.upload.maximum_size=1044480
olimex_rp2040pico30.menu.flash.16777216_15728640.build.flash_total=16777216
olimex_rp2040pico30.menu.flash.16777216_15728640.build.flash_length=1044480
olimex_rp2040pico30.menu.flash.16777216_15728640.build.eeprom_start=285208576
olimex_rp2040pico30.menu.flash.16777216_15728640.build.fs_start=269479936
olimex_rp2040pico30.menu.flash.16777216_15728640.build.fs_end=285208576
olimex_rp2040pico30.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
olimex_rp2040pico30.menu.flash.16777216_14680064.upload.maximum_size=2093056
olimex_rp2040pico30.menu.flash.16777216_14680064.build.flash_total=16777216
olimex_rp2040pico30.menu.flash.16777216_14680064.build.flash_length=2093056
olimex_rp2040pico30.menu.flash.16777216_14680064.build.eeprom_start=285208576
olimex_rp2040pico30.menu.flash.16777216_14680064.build.fs_start=270528512
olimex_rp2040pico30.menu.flash.16777216_14680064.build.fs_end=285208576
olimex_rp2040pico30.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
olimex_rp2040pico30.menu.flash.16777216_12582912.upload.maximum_size=4190208
olimex_rp2040pico30.menu.flash.16777216_12582912.build.flash_total=16777216
olimex_rp2040pico30.menu.flash.16777216_12582912.build.flash_length=4190208
olimex_rp2040pico30.menu.flash.16777216_12582912.build.eeprom_start=285208576
olimex_rp2040pico30.menu.flash.16777216_12582912.build.fs_start=272625664
olimex_rp2040pico30.menu.flash.16777216_12582912.build.fs_end=285208576
olimex_rp2040pico30.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
olimex_rp2040pico30.menu.flash.16777216_8388608.upload.maximum_size=8384512
olimex_rp2040pico30.menu.flash.16777216_8388608.build.flash_total=16777216
olimex_rp2040pico30.menu.flash.16777216_8388608.build.flash_length=8384512
olimex_rp2040pico30.menu.flash.16777216_8388608.build.eeprom_start=285208576
olimex_rp2040pico30.menu.flash.16777216_8388608.build.fs_start=276819968
olimex_rp2040pico30.menu.flash.16777216_8388608.build.fs_end=285208576
olimex_rp2040pico30.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
olimex_rp2040pico30.menu.flash.16777216_4194304.upload.maximum_size=12578816
olimex_rp2040pico30.menu.flash.16777216_4194304.build.flash_total=16777216
olimex_rp2040pico30.menu.flash.16777216_4194304.build.flash_length=12578816
olimex_rp2040pico30.menu.flash.16777216_4194304.build.eeprom_start=285208576
olimex_rp2040pico30.menu.flash.16777216_4194304.build.fs_start=281014272
olimex_rp2040pico30.menu.flash.16777216_4194304.build.fs_end=285208576
olimex_rp2040pico30.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
olimex_rp2040pico30.menu.flash.16777216_2097152.upload.maximum_size=14675968
olimex_rp2040pico30.menu.flash.16777216_2097152.build.flash_total=16777216
olimex_rp2040pico30.menu.flash.16777216_2097152.build.flash_length=14675968
olimex_rp2040pico30.menu.flash.16777216_2097152.build.eeprom_start=285208576
olimex_rp2040pico30.menu.flash.16777216_2097152.build.fs_start=283111424
olimex_rp2040pico30.menu.flash.16777216_2097152.build.fs_end=285208576
olimex_rp2040pico30.menu.freq.200=200 MHz
olimex_rp2040pico30.menu.freq.200.build.f_cpu=200000000L
olimex_rp2040pico30.menu.freq.50=50 MHz
olimex_rp2040pico30.menu.freq.50.build.f_cpu=50000000L
olimex_rp2040pico30.menu.freq.100=100 MHz
olimex_rp2040pico30.menu.freq.100.build.f_cpu=100000000L
olimex_rp2040pico30.menu.freq.120=120 MHz
olimex_rp2040pico30.menu.freq.120.build.f_cpu=120000000L
olimex_rp2040pico30.menu.freq.125=125 MHz
olimex_rp2040pico30.menu.freq.125.build.f_cpu=125000000L
olimex_rp2040pico30.menu.freq.128=128 MHz
olimex_rp2040pico30.menu.freq.128.build.f_cpu=128000000L
olimex_rp2040pico30.menu.freq.133=133 MHz
olimex_rp2040pico30.menu.freq.133.build.f_cpu=133000000L
olimex_rp2040pico30.menu.freq.150=150 MHz
olimex_rp2040pico30.menu.freq.150.build.f_cpu=150000000L
olimex_rp2040pico30.menu.freq.176=176 MHz
olimex_rp2040pico30.menu.freq.176.build.f_cpu=176000000L
olimex_rp2040pico30.menu.freq.225=225 MHz (Overclock)
olimex_rp2040pico30.menu.freq.225.build.f_cpu=225000000L
olimex_rp2040pico30.menu.freq.240=240 MHz (Overclock)
olimex_rp2040pico30.menu.freq.240.build.f_cpu=240000000L
olimex_rp2040pico30.menu.freq.250=250 MHz (Overclock)
olimex_rp2040pico30.menu.freq.250.build.f_cpu=250000000L
olimex_rp2040pico30.menu.freq.276=276 MHz (Overclock)
olimex_rp2040pico30.menu.freq.276.build.f_cpu=276000000L
olimex_rp2040pico30.menu.freq.300=300 MHz (Overclock)
olimex_rp2040pico30.menu.freq.300.build.f_cpu=300000000L
olimex_rp2040pico30.menu.opt.Small=Small (-Os) (standard)
olimex_rp2040pico30.menu.opt.Small.build.flags.optimize=-Os
olimex_rp2040pico30.menu.opt.Optimize=Optimize (-O)
olimex_rp2040pico30.menu.opt.Optimize.build.flags.optimize=-O
olimex_rp2040pico30.menu.opt.Optimize2=Optimize More (-O2)
olimex_rp2040pico30.menu.opt.Optimize2.build.flags.optimize=-O2
olimex_rp2040pico30.menu.opt.Optimize3=Optimize Even More (-O3)
olimex_rp2040pico30.menu.opt.Optimize3.build.flags.optimize=-O3
olimex_rp2040pico30.menu.opt.Fast=Fast (-Ofast) (maybe slower)
olimex_rp2040pico30.menu.opt.Fast.build.flags.optimize=-Ofast
olimex_rp2040pico30.menu.opt.Debug=Debug (-Og)
olimex_rp2040pico30.menu.opt.Debug.build.flags.optimize=-Og
olimex_rp2040pico30.menu.opt.Disabled=Disabled (-O0)
olimex_rp2040pico30.menu.opt.Disabled.build.flags.optimize=-O0
olimex_rp2040pico30.menu.profile.Disabled=Disabled
olimex_rp2040pico30.menu.profile.Disabled.build.flags.profile=
olimex_rp2040pico30.menu.profile.Enabled=Enabled
olimex_rp2040pico30.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
olimex_rp2040pico30.menu.rtti.Disabled=Disabled
olimex_rp2040pico30.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
olimex_rp2040pico30.menu.rtti.Enabled=Enabled
olimex_rp2040pico30.menu.rtti.Enabled.build.flags.rtti=
olimex_rp2040pico30.menu.stackprotect.Disabled=Disabled
olimex_rp2040pico30.menu.stackprotect.Disabled.build.flags.stackprotect=
olimex_rp2040pico30.menu.stackprotect.Enabled=Enabled
olimex_rp2040pico30.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
olimex_rp2040pico30.menu.exceptions.Disabled=Disabled
olimex_rp2040pico30.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
olimex_rp2040pico30.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
olimex_rp2040pico30.menu.exceptions.Enabled=Enabled
olimex_rp2040pico30.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
olimex_rp2040pico30.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
olimex_rp2040pico30.menu.dbgport.Disabled=Disabled
olimex_rp2040pico30.menu.dbgport.Disabled.build.debug_port=
olimex_rp2040pico30.menu.dbgport.Serial=Serial
olimex_rp2040pico30.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
olimex_rp2040pico30.menu.dbgport.Serial1=Serial1
olimex_rp2040pico30.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
olimex_rp2040pico30.menu.dbgport.Serial2=Serial2
olimex_rp2040pico30.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
olimex_rp2040pico30.menu.dbgport.SerialSemi=SerialSemi
olimex_rp2040pico30.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
olimex_rp2040pico30.menu.dbglvl.None=None
olimex_rp2040pico30.menu.dbglvl.None.build.debug_level=
olimex_rp2040pico30.menu.dbglvl.Core=Core
olimex_rp2040pico30.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
olimex_rp2040pico30.menu.dbglvl.SPI=SPI
olimex_rp2040pico30.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
olimex_rp2040pico30.menu.dbglvl.Wire=Wire
olimex_rp2040pico30.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
olimex_rp2040pico30.menu.dbglvl.Bluetooth=Bluetooth
olimex_rp2040pico30.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
olimex_rp2040pico30.menu.dbglvl.All=All
olimex_rp2040pico30.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
olimex_rp2040pico30.menu.dbglvl.NDEBUG=NDEBUG
