earlephilhower/arduino-pico/boards.txt
pimoroni_pga2350.menu.freq.276=276 MHz (Overclock)
pimoroni_pga2350.menu.freq.276.build.f_cpu=276000000L
pimoroni_pga2350.menu.freq.300=300 MHz (Overclock)
pimoroni_pga2350.menu.freq.300.build.f_cpu=300000000L
pimoroni_pga2350.menu.opt.Small=Small (-Os) (standard)
pimoroni_pga2350.menu.opt.Small.build.flags.optimize=-Os
pimoroni_pga2350.menu.opt.Optimize=Optimize (-O)
pimoroni_pga2350.menu.opt.Optimize.build.flags.optimize=-O
pimoroni_pga2350.menu.opt.Optimize2=Optimize More (-O2)
pimoroni_pga2350.menu.opt.Optimize2.build.flags.optimize=-O2
pimoroni_pga2350.menu.opt.Optimize3=Optimize Even More (-O3)
pimoroni_pga2350.menu.opt.Optimize3.build.flags.optimize=-O3
pimoroni_pga2350.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pimoroni_pga2350.menu.opt.Fast.build.flags.optimize=-Ofast
pimoroni_pga2350.menu.opt.Debug=Debug (-Og)
pimoroni_pga2350.menu.opt.Debug.build.flags.optimize=-Og
pimoroni_pga2350.menu.opt.Disabled=Disabled (-O0)
pimoroni_pga2350.menu.opt.Disabled.build.flags.optimize=-O0
pimoroni_pga2350.menu.profile.Disabled=Disabled
pimoroni_pga2350.menu.profile.Disabled.build.flags.profile=
pimoroni_pga2350.menu.profile.Enabled=Enabled
pimoroni_pga2350.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
pimoroni_pga2350.menu.rtti.Disabled=Disabled
pimoroni_pga2350.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pimoroni_pga2350.menu.rtti.Enabled=Enabled
pimoroni_pga2350.menu.rtti.Enabled.build.flags.rtti=
pimoroni_pga2350.menu.stackprotect.Disabled=Disabled
pimoroni_pga2350.menu.stackprotect.Disabled.build.flags.stackprotect=
pimoroni_pga2350.menu.stackprotect.Enabled=Enabled
pimoroni_pga2350.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
pimoroni_pga2350.menu.exceptions.Disabled=Disabled
pimoroni_pga2350.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pimoroni_pga2350.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pimoroni_pga2350.menu.exceptions.Enabled=Enabled
pimoroni_pga2350.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pimoroni_pga2350.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
pimoroni_pga2350.menu.dbgport.Disabled=Disabled
pimoroni_pga2350.menu.dbgport.Disabled.build.debug_port=
pimoroni_pga2350.menu.dbgport.Serial=Serial
pimoroni_pga2350.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
pimoroni_pga2350.menu.dbgport.Serial1=Serial1
pimoroni_pga2350.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
pimoroni_pga2350.menu.dbgport.Serial2=Serial2
pimoroni_pga2350.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
pimoroni_pga2350.menu.dbgport.SerialSemi=SerialSemi
pimoroni_pga2350.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
pimoroni_pga2350.menu.dbglvl.None=None
pimoroni_pga2350.menu.dbglvl.None.build.debug_level=
pimoroni_pga2350.menu.dbglvl.Core=Core
pimoroni_pga2350.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
pimoroni_pga2350.menu.dbglvl.SPI=SPI
pimoroni_pga2350.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
pimoroni_pga2350.menu.dbglvl.Wire=Wire
pimoroni_pga2350.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
pimoroni_pga2350.menu.dbglvl.Bluetooth=Bluetooth
pimoroni_pga2350.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
pimoroni_pga2350.menu.dbglvl.All=All
pimoroni_pga2350.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
pimoroni_pga2350.menu.dbglvl.NDEBUG=NDEBUG
pimoroni_pga2350.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
pimoroni_pga2350.menu.usbstack.picosdk=Pico SDK
pimoroni_pga2350.menu.usbstack.picosdk.build.usbstack_flags=
pimoroni_pga2350.menu.usbstack.tinyusb=Adafruit TinyUSB
pimoroni_pga2350.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_pga2350.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
pimoroni_pga2350.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_pga2350.menu.usbstack.nousb=No USB
pimoroni_pga2350.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
pimoroni_pga2350.menu.ipbtstack.ipv4only=IPv4 Only
pimoroni_pga2350.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
pimoroni_pga2350.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
pimoroni_pga2350.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
pimoroni_pga2350.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
pimoroni_pga2350.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_pga2350.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
pimoroni_pga2350.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
pimoroni_pga2350.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_pga2350.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
pimoroni_pga2350.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
pimoroni_pga2350.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
pimoroni_pga2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_pga2350.menu.uploadmethod.default=Default (UF2)
pimoroni_pga2350.menu.uploadmethod.default.build.ram_length=512k
pimoroni_pga2350.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_pga2350.menu.uploadmethod.default.upload.maximum_data_size=524288
pimoroni_pga2350.menu.uploadmethod.default.upload.tool=uf2conv
pimoroni_pga2350.menu.uploadmethod.default.upload.tool.default=uf2conv
pimoroni_pga2350.menu.uploadmethod.default.upload.tool.network=uf2conv-network
pimoroni_pga2350.menu.uploadmethod.picotool=Picotool
pimoroni_pga2350.menu.uploadmethod.picotool.build.ram_length=512k
pimoroni_pga2350.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
pimoroni_pga2350.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
pimoroni_pga2350.menu.uploadmethod.picotool.upload.maximum_data_size=524288
pimoroni_pga2350.menu.uploadmethod.picotool.upload.tool=picotool
pimoroni_pga2350.menu.uploadmethod.picotool.upload.tool.default=picotool
pimoroni_pga2350.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
pimoroni_pga2350.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
pimoroni_pga2350.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_pga2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
pimoroni_pga2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
pimoroni_pga2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

