earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Pimoroni PicoPlus2
# -----------------------------------
pimoroni_pico_plus_2.name=Pimoroni PicoPlus2
pimoroni_pico_plus_2.vid.0=0x2e8a
pimoroni_pico_plus_2.pid.0=0x100a
pimoroni_pico_plus_2.vid.1=0x2e8a
pimoroni_pico_plus_2.pid.1=0x110a
pimoroni_pico_plus_2.vid.2=0x2e8a
pimoroni_pico_plus_2.pid.2=0x500a
pimoroni_pico_plus_2.vid.3=0x2e8a
pimoroni_pico_plus_2.pid.3=0x510a
pimoroni_pico_plus_2.vid.4=0x2e8a
pimoroni_pico_plus_2.pid.4=0x900a
pimoroni_pico_plus_2.vid.5=0x2e8a
pimoroni_pico_plus_2.pid.5=0x910a
pimoroni_pico_plus_2.vid.6=0x2e8a
pimoroni_pico_plus_2.pid.6=0xd00a
pimoroni_pico_plus_2.vid.7=0x2e8a
pimoroni_pico_plus_2.pid.7=0xd10a
pimoroni_pico_plus_2.upload_port.0.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.0.pid=0x100a
pimoroni_pico_plus_2.upload_port.1.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.1.pid=0x110a
pimoroni_pico_plus_2.upload_port.2.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.2.pid=0x500a
pimoroni_pico_plus_2.upload_port.3.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.3.pid=0x510a
pimoroni_pico_plus_2.upload_port.4.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.4.pid=0x900a
pimoroni_pico_plus_2.upload_port.5.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.5.pid=0x910a
pimoroni_pico_plus_2.upload_port.6.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.6.pid=0xd00a
pimoroni_pico_plus_2.upload_port.7.vid=0x2e8a
pimoroni_pico_plus_2.upload_port.7.pid=0xd10a
pimoroni_pico_plus_2.build.usbvid=-DUSBD_VID=0x2e8a
pimoroni_pico_plus_2.build.usbpid=-DUSBD_PID=0x100a
pimoroni_pico_plus_2.build.usbpwr=-DUSBD_MAX_POWER_MA=500
pimoroni_pico_plus_2.build.board=PIMORONI_PICO_PLUS_2
pimoroni_pico_plus_2.build.variant=pimoroni_pico_plus_2
pimoroni_pico_plus_2.upload.maximum_size=16777216
pimoroni_pico_plus_2.upload.wait_for_upload_port=true
pimoroni_pico_plus_2.upload.erase_cmd=
pimoroni_pico_plus_2.serial.disableDTR=false
pimoroni_pico_plus_2.serial.disableRTS=false
pimoroni_pico_plus_2.build.f_cpu=125000000
pimoroni_pico_plus_2.build.led=
pimoroni_pico_plus_2.build.core=rp2040
pimoroni_pico_plus_2.build.ldscript=memmap_default.ld
pimoroni_pico_plus_2.build.boot2=none
pimoroni_pico_plus_2.build.usb_manufacturer="Pimoroni"
pimoroni_pico_plus_2.build.usb_product="PicoPlus2"
pimoroni_pico_plus_2.build.psram_length=0x800000
pimoroni_pico_plus_2.menu.flash.16777216_0=16MB (no FS)
pimoroni_pico_plus_2.menu.flash.16777216_0.upload.maximum_size=16769024
pimoroni_pico_plus_2.menu.flash.16777216_0.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_0.build.flash_length=16769024
pimoroni_pico_plus_2.menu.flash.16777216_0.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_0.build.fs_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_0.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
pimoroni_pico_plus_2.menu.flash.16777216_65536.upload.maximum_size=16703488
pimoroni_pico_plus_2.menu.flash.16777216_65536.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_65536.build.flash_length=16703488
pimoroni_pico_plus_2.menu.flash.16777216_65536.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_65536.build.fs_start=285138944
pimoroni_pico_plus_2.menu.flash.16777216_65536.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
pimoroni_pico_plus_2.menu.flash.16777216_131072.upload.maximum_size=16637952
pimoroni_pico_plus_2.menu.flash.16777216_131072.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_131072.build.flash_length=16637952
pimoroni_pico_plus_2.menu.flash.16777216_131072.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_131072.build.fs_start=285073408
pimoroni_pico_plus_2.menu.flash.16777216_131072.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
pimoroni_pico_plus_2.menu.flash.16777216_262144.upload.maximum_size=16506880
pimoroni_pico_plus_2.menu.flash.16777216_262144.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_262144.build.flash_length=16506880
pimoroni_pico_plus_2.menu.flash.16777216_262144.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_262144.build.fs_start=284942336
pimoroni_pico_plus_2.menu.flash.16777216_262144.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
pimoroni_pico_plus_2.menu.flash.16777216_524288.upload.maximum_size=16244736
pimoroni_pico_plus_2.menu.flash.16777216_524288.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_524288.build.flash_length=16244736
pimoroni_pico_plus_2.menu.flash.16777216_524288.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_524288.build.fs_start=284680192
pimoroni_pico_plus_2.menu.flash.16777216_524288.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
pimoroni_pico_plus_2.menu.flash.16777216_1048576.upload.maximum_size=15720448
pimoroni_pico_plus_2.menu.flash.16777216_1048576.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_1048576.build.flash_length=15720448
pimoroni_pico_plus_2.menu.flash.16777216_1048576.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_1048576.build.fs_start=284155904
pimoroni_pico_plus_2.menu.flash.16777216_1048576.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
pimoroni_pico_plus_2.menu.flash.16777216_2097152.upload.maximum_size=14671872
pimoroni_pico_plus_2.menu.flash.16777216_2097152.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_2097152.build.flash_length=14671872
pimoroni_pico_plus_2.menu.flash.16777216_2097152.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_2097152.build.fs_start=283107328
pimoroni_pico_plus_2.menu.flash.16777216_2097152.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
pimoroni_pico_plus_2.menu.flash.16777216_3145728.upload.maximum_size=13623296
pimoroni_pico_plus_2.menu.flash.16777216_3145728.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_3145728.build.flash_length=13623296
pimoroni_pico_plus_2.menu.flash.16777216_3145728.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_3145728.build.fs_start=282058752
pimoroni_pico_plus_2.menu.flash.16777216_3145728.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
pimoroni_pico_plus_2.menu.flash.16777216_4194304.upload.maximum_size=12574720
pimoroni_pico_plus_2.menu.flash.16777216_4194304.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_4194304.build.flash_length=12574720
pimoroni_pico_plus_2.menu.flash.16777216_4194304.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_4194304.build.fs_start=281010176
pimoroni_pico_plus_2.menu.flash.16777216_4194304.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
pimoroni_pico_plus_2.menu.flash.16777216_5242880.upload.maximum_size=11526144
pimoroni_pico_plus_2.menu.flash.16777216_5242880.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_5242880.build.flash_length=11526144
pimoroni_pico_plus_2.menu.flash.16777216_5242880.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_5242880.build.fs_start=279961600
pimoroni_pico_plus_2.menu.flash.16777216_5242880.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
pimoroni_pico_plus_2.menu.flash.16777216_6291456.upload.maximum_size=10477568
pimoroni_pico_plus_2.menu.flash.16777216_6291456.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_6291456.build.flash_length=10477568
pimoroni_pico_plus_2.menu.flash.16777216_6291456.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_6291456.build.fs_start=278913024
pimoroni_pico_plus_2.menu.flash.16777216_6291456.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
pimoroni_pico_plus_2.menu.flash.16777216_7340032.upload.maximum_size=9428992
pimoroni_pico_plus_2.menu.flash.16777216_7340032.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_7340032.build.flash_length=9428992
pimoroni_pico_plus_2.menu.flash.16777216_7340032.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_7340032.build.fs_start=277864448
pimoroni_pico_plus_2.menu.flash.16777216_7340032.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
pimoroni_pico_plus_2.menu.flash.16777216_8388608.upload.maximum_size=8380416
pimoroni_pico_plus_2.menu.flash.16777216_8388608.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_8388608.build.flash_length=8380416
pimoroni_pico_plus_2.menu.flash.16777216_8388608.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_8388608.build.fs_start=276815872
pimoroni_pico_plus_2.menu.flash.16777216_8388608.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
pimoroni_pico_plus_2.menu.flash.16777216_9437184.upload.maximum_size=7331840
pimoroni_pico_plus_2.menu.flash.16777216_9437184.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_9437184.build.flash_length=7331840
pimoroni_pico_plus_2.menu.flash.16777216_9437184.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_9437184.build.fs_start=275767296
pimoroni_pico_plus_2.menu.flash.16777216_9437184.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
pimoroni_pico_plus_2.menu.flash.16777216_10485760.upload.maximum_size=6283264
pimoroni_pico_plus_2.menu.flash.16777216_10485760.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_10485760.build.flash_length=6283264
pimoroni_pico_plus_2.menu.flash.16777216_10485760.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_10485760.build.fs_start=274718720
pimoroni_pico_plus_2.menu.flash.16777216_10485760.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
pimoroni_pico_plus_2.menu.flash.16777216_11534336.upload.maximum_size=5234688
pimoroni_pico_plus_2.menu.flash.16777216_11534336.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_11534336.build.flash_length=5234688
pimoroni_pico_plus_2.menu.flash.16777216_11534336.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_11534336.build.fs_start=273670144
pimoroni_pico_plus_2.menu.flash.16777216_11534336.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
pimoroni_pico_plus_2.menu.flash.16777216_12582912.upload.maximum_size=4186112
pimoroni_pico_plus_2.menu.flash.16777216_12582912.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_12582912.build.flash_length=4186112
pimoroni_pico_plus_2.menu.flash.16777216_12582912.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_12582912.build.fs_start=272621568
pimoroni_pico_plus_2.menu.flash.16777216_12582912.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
pimoroni_pico_plus_2.menu.flash.16777216_13631488.upload.maximum_size=3137536
pimoroni_pico_plus_2.menu.flash.16777216_13631488.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_13631488.build.flash_length=3137536
pimoroni_pico_plus_2.menu.flash.16777216_13631488.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_13631488.build.fs_start=271572992
pimoroni_pico_plus_2.menu.flash.16777216_13631488.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
pimoroni_pico_plus_2.menu.flash.16777216_14680064.upload.maximum_size=2088960
pimoroni_pico_plus_2.menu.flash.16777216_14680064.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_14680064.build.flash_length=2088960
pimoroni_pico_plus_2.menu.flash.16777216_14680064.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_14680064.build.fs_start=270524416
pimoroni_pico_plus_2.menu.flash.16777216_14680064.build.fs_end=285204480
pimoroni_pico_plus_2.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
pimoroni_pico_plus_2.menu.flash.16777216_15728640.upload.maximum_size=1040384
pimoroni_pico_plus_2.menu.flash.16777216_15728640.build.flash_total=16777216
pimoroni_pico_plus_2.menu.flash.16777216_15728640.build.flash_length=1040384
pimoroni_pico_plus_2.menu.flash.16777216_15728640.build.eeprom_start=285204480
pimoroni_pico_plus_2.menu.flash.16777216_15728640.build.fs_start=269475840
pimoroni_pico_plus_2.menu.flash.16777216_15728640.build.fs_end=285204480
pimoroni_pico_plus_2.menu.arch.arm=ARM
pimoroni_pico_plus_2.menu.arch.arm.build.chip=rp2350
pimoroni_pico_plus_2.menu.arch.arm.build.toolchain=arm-none-eabi
pimoroni_pico_plus_2.menu.arch.arm.build.toolchainpkg=pqt-gcc
pimoroni_pico_plus_2.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
pimoroni_pico_plus_2.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
pimoroni_pico_plus_2.menu.arch.arm.build.mcu=cortex-m33
pimoroni_pico_plus_2.menu.arch.riscv=RISC-V
pimoroni_pico_plus_2.menu.arch.riscv.build.chip=rp2350-riscv
pimoroni_pico_plus_2.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
pimoroni_pico_plus_2.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
pimoroni_pico_plus_2.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
pimoroni_pico_plus_2.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
pimoroni_pico_plus_2.menu.arch.riscv.build.mcu=rv32imac
pimoroni_pico_plus_2.menu.freq.150=150 MHz
pimoroni_pico_plus_2.menu.freq.150.build.f_cpu=150000000L
pimoroni_pico_plus_2.menu.freq.50=50 MHz
pimoroni_pico_plus_2.menu.freq.50.build.f_cpu=50000000L
pimoroni_pico_plus_2.menu.freq.100=100 MHz
pimoroni_pico_plus_2.menu.freq.100.build.f_cpu=100000000L
pimoroni_pico_plus_2.menu.freq.120=120 MHz
pimoroni_pico_plus_2.menu.freq.120.build.f_cpu=120000000L
pimoroni_pico_plus_2.menu.freq.125=125 MHz
pimoroni_pico_plus_2.menu.freq.125.build.f_cpu=125000000L
pimoroni_pico_plus_2.menu.freq.128=128 MHz
pimoroni_pico_plus_2.menu.freq.128.build.f_cpu=128000000L
pimoroni_pico_plus_2.menu.freq.133=133 MHz
pimoroni_pico_plus_2.menu.freq.133.build.f_cpu=133000000L
pimoroni_pico_plus_2.menu.freq.176=176 MHz (Overclock)
pimoroni_pico_plus_2.menu.freq.176.build.f_cpu=176000000L
pimoroni_pico_plus_2.menu.freq.200=200 MHz (Overclock)
pimoroni_pico_plus_2.menu.freq.200.build.f_cpu=200000000L
pimoroni_pico_plus_2.menu.freq.225=225 MHz (Overclock)
pimoroni_pico_plus_2.menu.freq.225.build.f_cpu=225000000L
pimoroni_pico_plus_2.menu.freq.240=240 MHz (Overclock)
pimoroni_pico_plus_2.menu.freq.240.build.f_cpu=240000000L
pimoroni_pico_plus_2.menu.freq.250=250 MHz (Overclock)
pimoroni_pico_plus_2.menu.freq.250.build.f_cpu=250000000L
pimoroni_pico_plus_2.menu.freq.276=276 MHz (Overclock)
pimoroni_pico_plus_2.menu.freq.276.build.f_cpu=276000000L
pimoroni_pico_plus_2.menu.freq.300=300 MHz (Overclock)
pimoroni_pico_plus_2.menu.freq.300.build.f_cpu=300000000L
pimoroni_pico_plus_2.menu.opt.Small=Small (-Os) (standard)
pimoroni_pico_plus_2.menu.opt.Small.build.flags.optimize=-Os
pimoroni_pico_plus_2.menu.opt.Optimize=Optimize (-O)
pimoroni_pico_plus_2.menu.opt.Optimize.build.flags.optimize=-O
pimoroni_pico_plus_2.menu.opt.Optimize2=Optimize More (-O2)
pimoroni_pico_plus_2.menu.opt.Optimize2.build.flags.optimize=-O2
pimoroni_pico_plus_2.menu.opt.Optimize3=Optimize Even More (-O3)
pimoroni_pico_plus_2.menu.opt.Optimize3.build.flags.optimize=-O3
pimoroni_pico_plus_2.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pimoroni_pico_plus_2.menu.opt.Fast.build.flags.optimize=-Ofast
pimoroni_pico_plus_2.menu.opt.Debug=Debug (-Og)
pimoroni_pico_plus_2.menu.opt.Debug.build.flags.optimize=-Og
pimoroni_pico_plus_2.menu.opt.Disabled=Disabled (-O0)
pimoroni_pico_plus_2.menu.opt.Disabled.build.flags.optimize=-O0
pimoroni_pico_plus_2.menu.profile.Disabled=Disabled
pimoroni_pico_plus_2.menu.profile.Disabled.build.flags.profile=
pimoroni_pico_plus_2.menu.profile.Enabled=Enabled
pimoroni_pico_plus_2.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
pimoroni_pico_plus_2.menu.rtti.Disabled=Disabled
pimoroni_pico_plus_2.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pimoroni_pico_plus_2.menu.rtti.Enabled=Enabled
pimoroni_pico_plus_2.menu.rtti.Enabled.build.flags.rtti=
pimoroni_pico_plus_2.menu.stackprotect.Disabled=Disabled
pimoroni_pico_plus_2.menu.stackprotect.Disabled.build.flags.stackprotect=
pimoroni_pico_plus_2.menu.stackprotect.Enabled=Enabled
pimoroni_pico_plus_2.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
pimoroni_pico_plus_2.menu.exceptions.Disabled=Disabled
pimoroni_pico_plus_2.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pimoroni_pico_plus_2.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pimoroni_pico_plus_2.menu.exceptions.Enabled=Enabled
pimoroni_pico_plus_2.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pimoroni_pico_plus_2.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
pimoroni_pico_plus_2.menu.dbgport.Disabled=Disabled
pimoroni_pico_plus_2.menu.dbgport.Disabled.build.debug_port=
pimoroni_pico_plus_2.menu.dbgport.Serial=Serial
pimoroni_pico_plus_2.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
pimoroni_pico_plus_2.menu.dbgport.Serial1=Serial1
pimoroni_pico_plus_2.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
pimoroni_pico_plus_2.menu.dbgport.Serial2=Serial2
pimoroni_pico_plus_2.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
pimoroni_pico_plus_2.menu.dbgport.SerialSemi=SerialSemi
