earlephilhower/arduino-pico/boards.txt
pimoroni_pico_plus_2.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
pimoroni_pico_plus_2.menu.dbglvl.None=None
pimoroni_pico_plus_2.menu.dbglvl.None.build.debug_level=
pimoroni_pico_plus_2.menu.dbglvl.Core=Core
pimoroni_pico_plus_2.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
pimoroni_pico_plus_2.menu.dbglvl.SPI=SPI
pimoroni_pico_plus_2.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
pimoroni_pico_plus_2.menu.dbglvl.Wire=Wire
pimoroni_pico_plus_2.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
pimoroni_pico_plus_2.menu.dbglvl.Bluetooth=Bluetooth
pimoroni_pico_plus_2.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
pimoroni_pico_plus_2.menu.dbglvl.All=All
pimoroni_pico_plus_2.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
pimoroni_pico_plus_2.menu.dbglvl.NDEBUG=NDEBUG
pimoroni_pico_plus_2.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
pimoroni_pico_plus_2.menu.usbstack.picosdk=Pico SDK
pimoroni_pico_plus_2.menu.usbstack.picosdk.build.usbstack_flags=
pimoroni_pico_plus_2.menu.usbstack.tinyusb=Adafruit TinyUSB
pimoroni_pico_plus_2.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_pico_plus_2.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
pimoroni_pico_plus_2.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_pico_plus_2.menu.usbstack.nousb=No USB
pimoroni_pico_plus_2.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
pimoroni_pico_plus_2.menu.ipbtstack.ipv4only=IPv4 Only
pimoroni_pico_plus_2.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
pimoroni_pico_plus_2.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
pimoroni_pico_plus_2.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_pico_plus_2.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
pimoroni_pico_plus_2.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
pimoroni_pico_plus_2.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
pimoroni_pico_plus_2.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2.menu.uploadmethod.default=Default (UF2)
pimoroni_pico_plus_2.menu.uploadmethod.default.build.ram_length=512k
pimoroni_pico_plus_2.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_pico_plus_2.menu.uploadmethod.default.upload.maximum_data_size=524288
pimoroni_pico_plus_2.menu.uploadmethod.default.upload.tool=uf2conv
pimoroni_pico_plus_2.menu.uploadmethod.default.upload.tool.default=uf2conv
pimoroni_pico_plus_2.menu.uploadmethod.default.upload.tool.network=uf2conv-network
pimoroni_pico_plus_2.menu.uploadmethod.picotool=Picotool
pimoroni_pico_plus_2.menu.uploadmethod.picotool.build.ram_length=512k
pimoroni_pico_plus_2.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
pimoroni_pico_plus_2.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
pimoroni_pico_plus_2.menu.uploadmethod.picotool.upload.maximum_data_size=524288
pimoroni_pico_plus_2.menu.uploadmethod.picotool.upload.tool=picotool
pimoroni_pico_plus_2.menu.uploadmethod.picotool.upload.tool.default=picotool
pimoroni_pico_plus_2.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
pimoroni_pico_plus_2.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
pimoroni_pico_plus_2.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_pico_plus_2.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
pimoroni_pico_plus_2.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
pimoroni_pico_plus_2.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Pimoroni PicoPlus2W
# -----------------------------------
pimoroni_pico_plus_2w.name=Pimoroni PicoPlus2W
pimoroni_pico_plus_2w.vid.0=0x2e8a
pimoroni_pico_plus_2w.pid.0=0x100a
pimoroni_pico_plus_2w.vid.1=0x2e8a
pimoroni_pico_plus_2w.pid.1=0x110a
pimoroni_pico_plus_2w.vid.2=0x2e8a
pimoroni_pico_plus_2w.pid.2=0x500a
pimoroni_pico_plus_2w.vid.3=0x2e8a
pimoroni_pico_plus_2w.pid.3=0x510a
pimoroni_pico_plus_2w.vid.4=0x2e8a
pimoroni_pico_plus_2w.pid.4=0x900a
pimoroni_pico_plus_2w.vid.5=0x2e8a
pimoroni_pico_plus_2w.pid.5=0x910a
pimoroni_pico_plus_2w.vid.6=0x2e8a
pimoroni_pico_plus_2w.pid.6=0xd00a
pimoroni_pico_plus_2w.vid.7=0x2e8a
pimoroni_pico_plus_2w.pid.7=0xd10a
pimoroni_pico_plus_2w.upload_port.0.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.0.pid=0x100a
pimoroni_pico_plus_2w.upload_port.1.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.1.pid=0x110a
pimoroni_pico_plus_2w.upload_port.2.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.2.pid=0x500a
pimoroni_pico_plus_2w.upload_port.3.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.3.pid=0x510a
pimoroni_pico_plus_2w.upload_port.4.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.4.pid=0x900a
pimoroni_pico_plus_2w.upload_port.5.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.5.pid=0x910a
pimoroni_pico_plus_2w.upload_port.6.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.6.pid=0xd00a
pimoroni_pico_plus_2w.upload_port.7.vid=0x2e8a
pimoroni_pico_plus_2w.upload_port.7.pid=0xd10a
pimoroni_pico_plus_2w.build.usbvid=-DUSBD_VID=0x2e8a
pimoroni_pico_plus_2w.build.usbpid=-DUSBD_PID=0x100a
pimoroni_pico_plus_2w.build.usbpwr=-DUSBD_MAX_POWER_MA=500
pimoroni_pico_plus_2w.build.board=PIMORONI_PICO_PLUS_2W
pimoroni_pico_plus_2w.build.variant=pimoroni_pico_plus_2w
pimoroni_pico_plus_2w.upload.maximum_size=16777216
pimoroni_pico_plus_2w.upload.wait_for_upload_port=true
pimoroni_pico_plus_2w.upload.erase_cmd=
pimoroni_pico_plus_2w.serial.disableDTR=false
pimoroni_pico_plus_2w.serial.disableRTS=false
pimoroni_pico_plus_2w.build.f_cpu=125000000
pimoroni_pico_plus_2w.build.led=
pimoroni_pico_plus_2w.build.core=rp2040
pimoroni_pico_plus_2w.build.ldscript=memmap_default.ld
pimoroni_pico_plus_2w.build.boot2=none
pimoroni_pico_plus_2w.build.usb_manufacturer="Pimoroni"
pimoroni_pico_plus_2w.build.usb_product="PicoPlus2W"
pimoroni_pico_plus_2w.build.psram_length=0x800000
pimoroni_pico_plus_2w.build.extra_flags=-DPICO_CYW43_SUPPORTED=1 -DCYW43_PIN_WL_DYNAMIC=1
pimoroni_pico_plus_2w.menu.flash.16777216_0=16MB (no FS)
pimoroni_pico_plus_2w.menu.flash.16777216_0.upload.maximum_size=16769024
pimoroni_pico_plus_2w.menu.flash.16777216_0.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_0.build.flash_length=16769024
pimoroni_pico_plus_2w.menu.flash.16777216_0.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_0.build.fs_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_0.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
pimoroni_pico_plus_2w.menu.flash.16777216_65536.upload.maximum_size=16703488
pimoroni_pico_plus_2w.menu.flash.16777216_65536.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_65536.build.flash_length=16703488
pimoroni_pico_plus_2w.menu.flash.16777216_65536.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_65536.build.fs_start=285138944
pimoroni_pico_plus_2w.menu.flash.16777216_65536.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
pimoroni_pico_plus_2w.menu.flash.16777216_131072.upload.maximum_size=16637952
pimoroni_pico_plus_2w.menu.flash.16777216_131072.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_131072.build.flash_length=16637952
pimoroni_pico_plus_2w.menu.flash.16777216_131072.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_131072.build.fs_start=285073408
pimoroni_pico_plus_2w.menu.flash.16777216_131072.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
pimoroni_pico_plus_2w.menu.flash.16777216_262144.upload.maximum_size=16506880
pimoroni_pico_plus_2w.menu.flash.16777216_262144.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_262144.build.flash_length=16506880
pimoroni_pico_plus_2w.menu.flash.16777216_262144.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_262144.build.fs_start=284942336
pimoroni_pico_plus_2w.menu.flash.16777216_262144.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
pimoroni_pico_plus_2w.menu.flash.16777216_524288.upload.maximum_size=16244736
pimoroni_pico_plus_2w.menu.flash.16777216_524288.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_524288.build.flash_length=16244736
pimoroni_pico_plus_2w.menu.flash.16777216_524288.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_524288.build.fs_start=284680192
pimoroni_pico_plus_2w.menu.flash.16777216_524288.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
pimoroni_pico_plus_2w.menu.flash.16777216_1048576.upload.maximum_size=15720448
pimoroni_pico_plus_2w.menu.flash.16777216_1048576.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_1048576.build.flash_length=15720448
pimoroni_pico_plus_2w.menu.flash.16777216_1048576.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_1048576.build.fs_start=284155904
pimoroni_pico_plus_2w.menu.flash.16777216_1048576.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
pimoroni_pico_plus_2w.menu.flash.16777216_2097152.upload.maximum_size=14671872
pimoroni_pico_plus_2w.menu.flash.16777216_2097152.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_2097152.build.flash_length=14671872
pimoroni_pico_plus_2w.menu.flash.16777216_2097152.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_2097152.build.fs_start=283107328
pimoroni_pico_plus_2w.menu.flash.16777216_2097152.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
pimoroni_pico_plus_2w.menu.flash.16777216_3145728.upload.maximum_size=13623296
pimoroni_pico_plus_2w.menu.flash.16777216_3145728.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_3145728.build.flash_length=13623296
pimoroni_pico_plus_2w.menu.flash.16777216_3145728.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_3145728.build.fs_start=282058752
pimoroni_pico_plus_2w.menu.flash.16777216_3145728.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
pimoroni_pico_plus_2w.menu.flash.16777216_4194304.upload.maximum_size=12574720
pimoroni_pico_plus_2w.menu.flash.16777216_4194304.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_4194304.build.flash_length=12574720
pimoroni_pico_plus_2w.menu.flash.16777216_4194304.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_4194304.build.fs_start=281010176
pimoroni_pico_plus_2w.menu.flash.16777216_4194304.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
pimoroni_pico_plus_2w.menu.flash.16777216_5242880.upload.maximum_size=11526144
pimoroni_pico_plus_2w.menu.flash.16777216_5242880.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_5242880.build.flash_length=11526144
pimoroni_pico_plus_2w.menu.flash.16777216_5242880.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_5242880.build.fs_start=279961600
pimoroni_pico_plus_2w.menu.flash.16777216_5242880.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
pimoroni_pico_plus_2w.menu.flash.16777216_6291456.upload.maximum_size=10477568
pimoroni_pico_plus_2w.menu.flash.16777216_6291456.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_6291456.build.flash_length=10477568
pimoroni_pico_plus_2w.menu.flash.16777216_6291456.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_6291456.build.fs_start=278913024
pimoroni_pico_plus_2w.menu.flash.16777216_6291456.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
pimoroni_pico_plus_2w.menu.flash.16777216_7340032.upload.maximum_size=9428992
pimoroni_pico_plus_2w.menu.flash.16777216_7340032.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_7340032.build.flash_length=9428992
pimoroni_pico_plus_2w.menu.flash.16777216_7340032.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_7340032.build.fs_start=277864448
pimoroni_pico_plus_2w.menu.flash.16777216_7340032.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
pimoroni_pico_plus_2w.menu.flash.16777216_8388608.upload.maximum_size=8380416
pimoroni_pico_plus_2w.menu.flash.16777216_8388608.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_8388608.build.flash_length=8380416
pimoroni_pico_plus_2w.menu.flash.16777216_8388608.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_8388608.build.fs_start=276815872
pimoroni_pico_plus_2w.menu.flash.16777216_8388608.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
pimoroni_pico_plus_2w.menu.flash.16777216_9437184.upload.maximum_size=7331840
pimoroni_pico_plus_2w.menu.flash.16777216_9437184.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_9437184.build.flash_length=7331840
pimoroni_pico_plus_2w.menu.flash.16777216_9437184.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_9437184.build.fs_start=275767296
pimoroni_pico_plus_2w.menu.flash.16777216_9437184.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
pimoroni_pico_plus_2w.menu.flash.16777216_10485760.upload.maximum_size=6283264
pimoroni_pico_plus_2w.menu.flash.16777216_10485760.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_10485760.build.flash_length=6283264
pimoroni_pico_plus_2w.menu.flash.16777216_10485760.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_10485760.build.fs_start=274718720
pimoroni_pico_plus_2w.menu.flash.16777216_10485760.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
pimoroni_pico_plus_2w.menu.flash.16777216_11534336.upload.maximum_size=5234688
pimoroni_pico_plus_2w.menu.flash.16777216_11534336.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_11534336.build.flash_length=5234688
pimoroni_pico_plus_2w.menu.flash.16777216_11534336.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_11534336.build.fs_start=273670144
pimoroni_pico_plus_2w.menu.flash.16777216_11534336.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
pimoroni_pico_plus_2w.menu.flash.16777216_12582912.upload.maximum_size=4186112
pimoroni_pico_plus_2w.menu.flash.16777216_12582912.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_12582912.build.flash_length=4186112
pimoroni_pico_plus_2w.menu.flash.16777216_12582912.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_12582912.build.fs_start=272621568
pimoroni_pico_plus_2w.menu.flash.16777216_12582912.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
pimoroni_pico_plus_2w.menu.flash.16777216_13631488.upload.maximum_size=3137536
pimoroni_pico_plus_2w.menu.flash.16777216_13631488.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_13631488.build.flash_length=3137536
pimoroni_pico_plus_2w.menu.flash.16777216_13631488.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_13631488.build.fs_start=271572992
pimoroni_pico_plus_2w.menu.flash.16777216_13631488.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
pimoroni_pico_plus_2w.menu.flash.16777216_14680064.upload.maximum_size=2088960
pimoroni_pico_plus_2w.menu.flash.16777216_14680064.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_14680064.build.flash_length=2088960
pimoroni_pico_plus_2w.menu.flash.16777216_14680064.build.eeprom_start=285204480
