earlephilhower/arduino-pico/boards.txt
pimoroni_pico_plus_2w.menu.flash.16777216_14680064.build.fs_start=270524416
pimoroni_pico_plus_2w.menu.flash.16777216_14680064.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
pimoroni_pico_plus_2w.menu.flash.16777216_15728640.upload.maximum_size=1040384
pimoroni_pico_plus_2w.menu.flash.16777216_15728640.build.flash_total=16777216
pimoroni_pico_plus_2w.menu.flash.16777216_15728640.build.flash_length=1040384
pimoroni_pico_plus_2w.menu.flash.16777216_15728640.build.eeprom_start=285204480
pimoroni_pico_plus_2w.menu.flash.16777216_15728640.build.fs_start=269475840
pimoroni_pico_plus_2w.menu.flash.16777216_15728640.build.fs_end=285204480
pimoroni_pico_plus_2w.menu.arch.arm=ARM
pimoroni_pico_plus_2w.menu.arch.arm.build.chip=rp2350
pimoroni_pico_plus_2w.menu.arch.arm.build.toolchain=arm-none-eabi
pimoroni_pico_plus_2w.menu.arch.arm.build.toolchainpkg=pqt-gcc
pimoroni_pico_plus_2w.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
pimoroni_pico_plus_2w.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
pimoroni_pico_plus_2w.menu.arch.arm.build.mcu=cortex-m33
pimoroni_pico_plus_2w.menu.arch.riscv=RISC-V
pimoroni_pico_plus_2w.menu.arch.riscv.build.chip=rp2350-riscv
pimoroni_pico_plus_2w.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
pimoroni_pico_plus_2w.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
pimoroni_pico_plus_2w.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
pimoroni_pico_plus_2w.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
pimoroni_pico_plus_2w.menu.arch.riscv.build.mcu=rv32imac
pimoroni_pico_plus_2w.menu.freq.150=150 MHz
pimoroni_pico_plus_2w.menu.freq.150.build.f_cpu=150000000L
pimoroni_pico_plus_2w.menu.freq.50=50 MHz
pimoroni_pico_plus_2w.menu.freq.50.build.f_cpu=50000000L
pimoroni_pico_plus_2w.menu.freq.100=100 MHz
pimoroni_pico_plus_2w.menu.freq.100.build.f_cpu=100000000L
pimoroni_pico_plus_2w.menu.freq.120=120 MHz
pimoroni_pico_plus_2w.menu.freq.120.build.f_cpu=120000000L
pimoroni_pico_plus_2w.menu.freq.125=125 MHz
pimoroni_pico_plus_2w.menu.freq.125.build.f_cpu=125000000L
pimoroni_pico_plus_2w.menu.freq.128=128 MHz
pimoroni_pico_plus_2w.menu.freq.128.build.f_cpu=128000000L
pimoroni_pico_plus_2w.menu.freq.133=133 MHz
pimoroni_pico_plus_2w.menu.freq.133.build.f_cpu=133000000L
pimoroni_pico_plus_2w.menu.freq.176=176 MHz (Overclock)
pimoroni_pico_plus_2w.menu.freq.176.build.f_cpu=176000000L
pimoroni_pico_plus_2w.menu.freq.200=200 MHz (Overclock)
pimoroni_pico_plus_2w.menu.freq.200.build.f_cpu=200000000L
pimoroni_pico_plus_2w.menu.freq.225=225 MHz (Overclock)
pimoroni_pico_plus_2w.menu.freq.225.build.f_cpu=225000000L
pimoroni_pico_plus_2w.menu.freq.240=240 MHz (Overclock)
pimoroni_pico_plus_2w.menu.freq.240.build.f_cpu=240000000L
pimoroni_pico_plus_2w.menu.freq.250=250 MHz (Overclock)
pimoroni_pico_plus_2w.menu.freq.250.build.f_cpu=250000000L
pimoroni_pico_plus_2w.menu.freq.276=276 MHz (Overclock)
pimoroni_pico_plus_2w.menu.freq.276.build.f_cpu=276000000L
pimoroni_pico_plus_2w.menu.freq.300=300 MHz (Overclock)
pimoroni_pico_plus_2w.menu.freq.300.build.f_cpu=300000000L
pimoroni_pico_plus_2w.menu.opt.Small=Small (-Os) (standard)
pimoroni_pico_plus_2w.menu.opt.Small.build.flags.optimize=-Os
pimoroni_pico_plus_2w.menu.opt.Optimize=Optimize (-O)
pimoroni_pico_plus_2w.menu.opt.Optimize.build.flags.optimize=-O
pimoroni_pico_plus_2w.menu.opt.Optimize2=Optimize More (-O2)
pimoroni_pico_plus_2w.menu.opt.Optimize2.build.flags.optimize=-O2
pimoroni_pico_plus_2w.menu.opt.Optimize3=Optimize Even More (-O3)
pimoroni_pico_plus_2w.menu.opt.Optimize3.build.flags.optimize=-O3
pimoroni_pico_plus_2w.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pimoroni_pico_plus_2w.menu.opt.Fast.build.flags.optimize=-Ofast
pimoroni_pico_plus_2w.menu.opt.Debug=Debug (-Og)
pimoroni_pico_plus_2w.menu.opt.Debug.build.flags.optimize=-Og
pimoroni_pico_plus_2w.menu.opt.Disabled=Disabled (-O0)
pimoroni_pico_plus_2w.menu.opt.Disabled.build.flags.optimize=-O0
pimoroni_pico_plus_2w.menu.profile.Disabled=Disabled
pimoroni_pico_plus_2w.menu.profile.Disabled.build.flags.profile=
pimoroni_pico_plus_2w.menu.profile.Enabled=Enabled
pimoroni_pico_plus_2w.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
pimoroni_pico_plus_2w.menu.rtti.Disabled=Disabled
pimoroni_pico_plus_2w.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pimoroni_pico_plus_2w.menu.rtti.Enabled=Enabled
pimoroni_pico_plus_2w.menu.rtti.Enabled.build.flags.rtti=
pimoroni_pico_plus_2w.menu.stackprotect.Disabled=Disabled
pimoroni_pico_plus_2w.menu.stackprotect.Disabled.build.flags.stackprotect=
pimoroni_pico_plus_2w.menu.stackprotect.Enabled=Enabled
pimoroni_pico_plus_2w.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
pimoroni_pico_plus_2w.menu.exceptions.Disabled=Disabled
pimoroni_pico_plus_2w.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pimoroni_pico_plus_2w.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pimoroni_pico_plus_2w.menu.exceptions.Enabled=Enabled
pimoroni_pico_plus_2w.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pimoroni_pico_plus_2w.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
pimoroni_pico_plus_2w.menu.dbgport.Disabled=Disabled
pimoroni_pico_plus_2w.menu.dbgport.Disabled.build.debug_port=
pimoroni_pico_plus_2w.menu.dbgport.Serial=Serial
pimoroni_pico_plus_2w.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
pimoroni_pico_plus_2w.menu.dbgport.Serial1=Serial1
pimoroni_pico_plus_2w.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
pimoroni_pico_plus_2w.menu.dbgport.Serial2=Serial2
pimoroni_pico_plus_2w.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
pimoroni_pico_plus_2w.menu.dbgport.SerialSemi=SerialSemi
pimoroni_pico_plus_2w.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
pimoroni_pico_plus_2w.menu.dbglvl.None=None
pimoroni_pico_plus_2w.menu.dbglvl.None.build.debug_level=
pimoroni_pico_plus_2w.menu.dbglvl.Core=Core
pimoroni_pico_plus_2w.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
pimoroni_pico_plus_2w.menu.dbglvl.SPI=SPI
pimoroni_pico_plus_2w.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
pimoroni_pico_plus_2w.menu.dbglvl.Wire=Wire
pimoroni_pico_plus_2w.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
pimoroni_pico_plus_2w.menu.dbglvl.Bluetooth=Bluetooth
pimoroni_pico_plus_2w.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
pimoroni_pico_plus_2w.menu.dbglvl.All=All
pimoroni_pico_plus_2w.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
pimoroni_pico_plus_2w.menu.dbglvl.NDEBUG=NDEBUG
pimoroni_pico_plus_2w.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
pimoroni_pico_plus_2w.menu.usbstack.picosdk=Pico SDK
pimoroni_pico_plus_2w.menu.usbstack.picosdk.build.usbstack_flags=
pimoroni_pico_plus_2w.menu.usbstack.tinyusb=Adafruit TinyUSB
pimoroni_pico_plus_2w.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_pico_plus_2w.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
pimoroni_pico_plus_2w.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_pico_plus_2w.menu.usbstack.nousb=No USB
pimoroni_pico_plus_2w.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
pimoroni_pico_plus_2w.menu.wificountry.worldwide=Worldwide
pimoroni_pico_plus_2w.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
pimoroni_pico_plus_2w.menu.wificountry.australia=Australia
pimoroni_pico_plus_2w.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
pimoroni_pico_plus_2w.menu.wificountry.austria=Austria
pimoroni_pico_plus_2w.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
pimoroni_pico_plus_2w.menu.wificountry.belgium=Belgium
pimoroni_pico_plus_2w.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
pimoroni_pico_plus_2w.menu.wificountry.brazil=Brazil
pimoroni_pico_plus_2w.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
pimoroni_pico_plus_2w.menu.wificountry.canada=Canada
pimoroni_pico_plus_2w.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
pimoroni_pico_plus_2w.menu.wificountry.chile=Chile
pimoroni_pico_plus_2w.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
pimoroni_pico_plus_2w.menu.wificountry.china=China
pimoroni_pico_plus_2w.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
pimoroni_pico_plus_2w.menu.wificountry.colombia=Colombia
pimoroni_pico_plus_2w.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
pimoroni_pico_plus_2w.menu.wificountry.czech_republic=Czech Republic
pimoroni_pico_plus_2w.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
pimoroni_pico_plus_2w.menu.wificountry.denmark=Denmark
pimoroni_pico_plus_2w.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
pimoroni_pico_plus_2w.menu.wificountry.estonia=Estonia
pimoroni_pico_plus_2w.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
pimoroni_pico_plus_2w.menu.wificountry.finland=Finland
pimoroni_pico_plus_2w.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
pimoroni_pico_plus_2w.menu.wificountry.france=France
pimoroni_pico_plus_2w.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
pimoroni_pico_plus_2w.menu.wificountry.germany=Germany
pimoroni_pico_plus_2w.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
pimoroni_pico_plus_2w.menu.wificountry.greece=Greece
pimoroni_pico_plus_2w.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
pimoroni_pico_plus_2w.menu.wificountry.hong_kong=Hong Kong
pimoroni_pico_plus_2w.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
pimoroni_pico_plus_2w.menu.wificountry.hungary=Hungary
pimoroni_pico_plus_2w.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
pimoroni_pico_plus_2w.menu.wificountry.iceland=Iceland
pimoroni_pico_plus_2w.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
pimoroni_pico_plus_2w.menu.wificountry.india=India
pimoroni_pico_plus_2w.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
pimoroni_pico_plus_2w.menu.wificountry.israel=Israel
pimoroni_pico_plus_2w.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
pimoroni_pico_plus_2w.menu.wificountry.italy=Italy
pimoroni_pico_plus_2w.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
pimoroni_pico_plus_2w.menu.wificountry.japan=Japan
pimoroni_pico_plus_2w.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
pimoroni_pico_plus_2w.menu.wificountry.kenya=Kenya
pimoroni_pico_plus_2w.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
pimoroni_pico_plus_2w.menu.wificountry.latvia=Latvia
pimoroni_pico_plus_2w.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
pimoroni_pico_plus_2w.menu.wificountry.liechtenstein=Liechtenstein
pimoroni_pico_plus_2w.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
pimoroni_pico_plus_2w.menu.wificountry.lithuania=Lithuania
pimoroni_pico_plus_2w.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
pimoroni_pico_plus_2w.menu.wificountry.luxembourg=Luxembourg
pimoroni_pico_plus_2w.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
pimoroni_pico_plus_2w.menu.wificountry.malaysia=Malaysia
pimoroni_pico_plus_2w.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
pimoroni_pico_plus_2w.menu.wificountry.malta=Malta
pimoroni_pico_plus_2w.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
pimoroni_pico_plus_2w.menu.wificountry.mexico=Mexico
pimoroni_pico_plus_2w.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
pimoroni_pico_plus_2w.menu.wificountry.netherlands=Netherlands
pimoroni_pico_plus_2w.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
pimoroni_pico_plus_2w.menu.wificountry.new_zealand=New Zealand
pimoroni_pico_plus_2w.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
pimoroni_pico_plus_2w.menu.wificountry.nigeria=Nigeria
pimoroni_pico_plus_2w.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
pimoroni_pico_plus_2w.menu.wificountry.norway=Norway
pimoroni_pico_plus_2w.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
pimoroni_pico_plus_2w.menu.wificountry.peru=Peru
pimoroni_pico_plus_2w.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
pimoroni_pico_plus_2w.menu.wificountry.philippines=Philippines
pimoroni_pico_plus_2w.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
pimoroni_pico_plus_2w.menu.wificountry.poland=Poland
pimoroni_pico_plus_2w.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
pimoroni_pico_plus_2w.menu.wificountry.portugal=Portugal
pimoroni_pico_plus_2w.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
pimoroni_pico_plus_2w.menu.wificountry.singapore=Singapore
pimoroni_pico_plus_2w.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
pimoroni_pico_plus_2w.menu.wificountry.slovakia=Slovakia
pimoroni_pico_plus_2w.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
pimoroni_pico_plus_2w.menu.wificountry.slovenia=Slovenia
pimoroni_pico_plus_2w.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
pimoroni_pico_plus_2w.menu.wificountry.south_africa=South Africa
pimoroni_pico_plus_2w.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
pimoroni_pico_plus_2w.menu.wificountry.south_korea=South Korea
pimoroni_pico_plus_2w.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
pimoroni_pico_plus_2w.menu.wificountry.spain=Spain
pimoroni_pico_plus_2w.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
pimoroni_pico_plus_2w.menu.wificountry.sweden=Sweden
pimoroni_pico_plus_2w.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
pimoroni_pico_plus_2w.menu.wificountry.switzerland=Switzerland
pimoroni_pico_plus_2w.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
pimoroni_pico_plus_2w.menu.wificountry.taiwan=Taiwan
pimoroni_pico_plus_2w.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
pimoroni_pico_plus_2w.menu.wificountry.thailand=Thailand
pimoroni_pico_plus_2w.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
pimoroni_pico_plus_2w.menu.wificountry.turkey=Turkey
pimoroni_pico_plus_2w.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
pimoroni_pico_plus_2w.menu.wificountry.uk=UK
pimoroni_pico_plus_2w.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
pimoroni_pico_plus_2w.menu.wificountry.usa=USA
pimoroni_pico_plus_2w.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4only=IPv4 Only
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
pimoroni_pico_plus_2w.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_pico_plus_2w.menu.uploadmethod.default=Default (UF2)
pimoroni_pico_plus_2w.menu.uploadmethod.default.build.ram_length=512k
pimoroni_pico_plus_2w.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_pico_plus_2w.menu.uploadmethod.default.upload.maximum_data_size=524288
pimoroni_pico_plus_2w.menu.uploadmethod.default.upload.tool=uf2conv
pimoroni_pico_plus_2w.menu.uploadmethod.default.upload.tool.default=uf2conv
