earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Pimoroni Tiny2350
# -----------------------------------
pimoroni_tiny2350.name=Pimoroni Tiny2350
pimoroni_tiny2350.vid.0=0x2e8a
pimoroni_tiny2350.pid.0=0x100b
pimoroni_tiny2350.vid.1=0x2e8a
pimoroni_tiny2350.pid.1=0x110b
pimoroni_tiny2350.vid.2=0x2e8a
pimoroni_tiny2350.pid.2=0x500b
pimoroni_tiny2350.vid.3=0x2e8a
pimoroni_tiny2350.pid.3=0x510b
pimoroni_tiny2350.vid.4=0x2e8a
pimoroni_tiny2350.pid.4=0x900b
pimoroni_tiny2350.vid.5=0x2e8a
pimoroni_tiny2350.pid.5=0x910b
pimoroni_tiny2350.vid.6=0x2e8a
pimoroni_tiny2350.pid.6=0xd00b
pimoroni_tiny2350.vid.7=0x2e8a
pimoroni_tiny2350.pid.7=0xd10b
pimoroni_tiny2350.upload_port.0.vid=0x2e8a
pimoroni_tiny2350.upload_port.0.pid=0x100b
pimoroni_tiny2350.upload_port.1.vid=0x2e8a
pimoroni_tiny2350.upload_port.1.pid=0x110b
pimoroni_tiny2350.upload_port.2.vid=0x2e8a
pimoroni_tiny2350.upload_port.2.pid=0x500b
pimoroni_tiny2350.upload_port.3.vid=0x2e8a
pimoroni_tiny2350.upload_port.3.pid=0x510b
pimoroni_tiny2350.upload_port.4.vid=0x2e8a
pimoroni_tiny2350.upload_port.4.pid=0x900b
pimoroni_tiny2350.upload_port.5.vid=0x2e8a
pimoroni_tiny2350.upload_port.5.pid=0x910b
pimoroni_tiny2350.upload_port.6.vid=0x2e8a
pimoroni_tiny2350.upload_port.6.pid=0xd00b
pimoroni_tiny2350.upload_port.7.vid=0x2e8a
pimoroni_tiny2350.upload_port.7.pid=0xd10b
pimoroni_tiny2350.build.usbvid=-DUSBD_VID=0x2e8a
pimoroni_tiny2350.build.usbpid=-DUSBD_PID=0x100b
pimoroni_tiny2350.build.usbpwr=-DUSBD_MAX_POWER_MA=500
pimoroni_tiny2350.build.board=PIMORONI_TINY2350
pimoroni_tiny2350.build.variant=pimoroni_tiny2350
pimoroni_tiny2350.upload.maximum_size=4194304
pimoroni_tiny2350.upload.wait_for_upload_port=true
pimoroni_tiny2350.upload.erase_cmd=
pimoroni_tiny2350.serial.disableDTR=false
pimoroni_tiny2350.serial.disableRTS=false
pimoroni_tiny2350.build.f_cpu=125000000
pimoroni_tiny2350.build.led=
pimoroni_tiny2350.build.core=rp2040
pimoroni_tiny2350.build.ldscript=memmap_default.ld
pimoroni_tiny2350.build.boot2=none
pimoroni_tiny2350.build.usb_manufacturer="Pimoroni"
pimoroni_tiny2350.build.usb_product="Tiny2350"
pimoroni_tiny2350.build.psram_length=0x000000
pimoroni_tiny2350.menu.flash.4194304_0=4MB (no FS)
pimoroni_tiny2350.menu.flash.4194304_0.upload.maximum_size=4186112
pimoroni_tiny2350.menu.flash.4194304_0.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_0.build.flash_length=4186112
pimoroni_tiny2350.menu.flash.4194304_0.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_0.build.fs_start=272621568
pimoroni_tiny2350.menu.flash.4194304_0.build.fs_end=272621568
pimoroni_tiny2350.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
pimoroni_tiny2350.menu.flash.4194304_65536.upload.maximum_size=4120576
pimoroni_tiny2350.menu.flash.4194304_65536.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_65536.build.flash_length=4120576
pimoroni_tiny2350.menu.flash.4194304_65536.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_65536.build.fs_start=272556032
pimoroni_tiny2350.menu.flash.4194304_65536.build.fs_end=272621568
pimoroni_tiny2350.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
pimoroni_tiny2350.menu.flash.4194304_131072.upload.maximum_size=4055040
pimoroni_tiny2350.menu.flash.4194304_131072.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_131072.build.flash_length=4055040
pimoroni_tiny2350.menu.flash.4194304_131072.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_131072.build.fs_start=272490496
pimoroni_tiny2350.menu.flash.4194304_131072.build.fs_end=272621568
pimoroni_tiny2350.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
pimoroni_tiny2350.menu.flash.4194304_262144.upload.maximum_size=3923968
pimoroni_tiny2350.menu.flash.4194304_262144.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_262144.build.flash_length=3923968
pimoroni_tiny2350.menu.flash.4194304_262144.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_262144.build.fs_start=272359424
pimoroni_tiny2350.menu.flash.4194304_262144.build.fs_end=272621568
pimoroni_tiny2350.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
pimoroni_tiny2350.menu.flash.4194304_524288.upload.maximum_size=3661824
pimoroni_tiny2350.menu.flash.4194304_524288.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_524288.build.flash_length=3661824
pimoroni_tiny2350.menu.flash.4194304_524288.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_524288.build.fs_start=272097280
pimoroni_tiny2350.menu.flash.4194304_524288.build.fs_end=272621568
pimoroni_tiny2350.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
pimoroni_tiny2350.menu.flash.4194304_1048576.upload.maximum_size=3137536
pimoroni_tiny2350.menu.flash.4194304_1048576.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_1048576.build.flash_length=3137536
pimoroni_tiny2350.menu.flash.4194304_1048576.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_1048576.build.fs_start=271572992
pimoroni_tiny2350.menu.flash.4194304_1048576.build.fs_end=272621568
pimoroni_tiny2350.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
pimoroni_tiny2350.menu.flash.4194304_2097152.upload.maximum_size=2088960
pimoroni_tiny2350.menu.flash.4194304_2097152.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_2097152.build.flash_length=2088960
pimoroni_tiny2350.menu.flash.4194304_2097152.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_2097152.build.fs_start=270524416
pimoroni_tiny2350.menu.flash.4194304_2097152.build.fs_end=272621568
pimoroni_tiny2350.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
pimoroni_tiny2350.menu.flash.4194304_3145728.upload.maximum_size=1040384
pimoroni_tiny2350.menu.flash.4194304_3145728.build.flash_total=4194304
pimoroni_tiny2350.menu.flash.4194304_3145728.build.flash_length=1040384
pimoroni_tiny2350.menu.flash.4194304_3145728.build.eeprom_start=272621568
pimoroni_tiny2350.menu.flash.4194304_3145728.build.fs_start=269475840
pimoroni_tiny2350.menu.flash.4194304_3145728.build.fs_end=272621568
pimoroni_tiny2350.menu.arch.arm=ARM
pimoroni_tiny2350.menu.arch.arm.build.chip=rp2350
pimoroni_tiny2350.menu.arch.arm.build.toolchain=arm-none-eabi
pimoroni_tiny2350.menu.arch.arm.build.toolchainpkg=pqt-gcc
pimoroni_tiny2350.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
pimoroni_tiny2350.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
pimoroni_tiny2350.menu.arch.arm.build.mcu=cortex-m33
pimoroni_tiny2350.menu.arch.riscv=RISC-V
pimoroni_tiny2350.menu.arch.riscv.build.chip=rp2350-riscv
pimoroni_tiny2350.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
pimoroni_tiny2350.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
pimoroni_tiny2350.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
pimoroni_tiny2350.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
pimoroni_tiny2350.menu.arch.riscv.build.mcu=rv32imac
pimoroni_tiny2350.menu.freq.150=150 MHz
pimoroni_tiny2350.menu.freq.150.build.f_cpu=150000000L
pimoroni_tiny2350.menu.freq.50=50 MHz
pimoroni_tiny2350.menu.freq.50.build.f_cpu=50000000L
pimoroni_tiny2350.menu.freq.100=100 MHz
pimoroni_tiny2350.menu.freq.100.build.f_cpu=100000000L
pimoroni_tiny2350.menu.freq.120=120 MHz
pimoroni_tiny2350.menu.freq.120.build.f_cpu=120000000L
pimoroni_tiny2350.menu.freq.125=125 MHz
pimoroni_tiny2350.menu.freq.125.build.f_cpu=125000000L
pimoroni_tiny2350.menu.freq.128=128 MHz
pimoroni_tiny2350.menu.freq.128.build.f_cpu=128000000L
pimoroni_tiny2350.menu.freq.133=133 MHz
pimoroni_tiny2350.menu.freq.133.build.f_cpu=133000000L
pimoroni_tiny2350.menu.freq.176=176 MHz (Overclock)
pimoroni_tiny2350.menu.freq.176.build.f_cpu=176000000L
pimoroni_tiny2350.menu.freq.200=200 MHz (Overclock)
pimoroni_tiny2350.menu.freq.200.build.f_cpu=200000000L
pimoroni_tiny2350.menu.freq.225=225 MHz (Overclock)
pimoroni_tiny2350.menu.freq.225.build.f_cpu=225000000L
pimoroni_tiny2350.menu.freq.240=240 MHz (Overclock)
pimoroni_tiny2350.menu.freq.240.build.f_cpu=240000000L
pimoroni_tiny2350.menu.freq.250=250 MHz (Overclock)
pimoroni_tiny2350.menu.freq.250.build.f_cpu=250000000L
pimoroni_tiny2350.menu.freq.276=276 MHz (Overclock)
pimoroni_tiny2350.menu.freq.276.build.f_cpu=276000000L
pimoroni_tiny2350.menu.freq.300=300 MHz (Overclock)
pimoroni_tiny2350.menu.freq.300.build.f_cpu=300000000L
pimoroni_tiny2350.menu.opt.Small=Small (-Os) (standard)
pimoroni_tiny2350.menu.opt.Small.build.flags.optimize=-Os
pimoroni_tiny2350.menu.opt.Optimize=Optimize (-O)
pimoroni_tiny2350.menu.opt.Optimize.build.flags.optimize=-O
pimoroni_tiny2350.menu.opt.Optimize2=Optimize More (-O2)
pimoroni_tiny2350.menu.opt.Optimize2.build.flags.optimize=-O2
pimoroni_tiny2350.menu.opt.Optimize3=Optimize Even More (-O3)
pimoroni_tiny2350.menu.opt.Optimize3.build.flags.optimize=-O3
pimoroni_tiny2350.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pimoroni_tiny2350.menu.opt.Fast.build.flags.optimize=-Ofast
pimoroni_tiny2350.menu.opt.Debug=Debug (-Og)
pimoroni_tiny2350.menu.opt.Debug.build.flags.optimize=-Og
pimoroni_tiny2350.menu.opt.Disabled=Disabled (-O0)
pimoroni_tiny2350.menu.opt.Disabled.build.flags.optimize=-O0
pimoroni_tiny2350.menu.profile.Disabled=Disabled
pimoroni_tiny2350.menu.profile.Disabled.build.flags.profile=
pimoroni_tiny2350.menu.profile.Enabled=Enabled
pimoroni_tiny2350.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
pimoroni_tiny2350.menu.rtti.Disabled=Disabled
pimoroni_tiny2350.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pimoroni_tiny2350.menu.rtti.Enabled=Enabled
pimoroni_tiny2350.menu.rtti.Enabled.build.flags.rtti=
pimoroni_tiny2350.menu.stackprotect.Disabled=Disabled
pimoroni_tiny2350.menu.stackprotect.Disabled.build.flags.stackprotect=
pimoroni_tiny2350.menu.stackprotect.Enabled=Enabled
pimoroni_tiny2350.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
pimoroni_tiny2350.menu.exceptions.Disabled=Disabled
pimoroni_tiny2350.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pimoroni_tiny2350.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pimoroni_tiny2350.menu.exceptions.Enabled=Enabled
pimoroni_tiny2350.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pimoroni_tiny2350.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
pimoroni_tiny2350.menu.dbgport.Disabled=Disabled
pimoroni_tiny2350.menu.dbgport.Disabled.build.debug_port=
pimoroni_tiny2350.menu.dbgport.Serial=Serial
pimoroni_tiny2350.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
pimoroni_tiny2350.menu.dbgport.Serial1=Serial1
pimoroni_tiny2350.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
pimoroni_tiny2350.menu.dbgport.Serial2=Serial2
pimoroni_tiny2350.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
pimoroni_tiny2350.menu.dbgport.SerialSemi=SerialSemi
pimoroni_tiny2350.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
pimoroni_tiny2350.menu.dbglvl.None=None
pimoroni_tiny2350.menu.dbglvl.None.build.debug_level=
pimoroni_tiny2350.menu.dbglvl.Core=Core
pimoroni_tiny2350.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
pimoroni_tiny2350.menu.dbglvl.SPI=SPI
pimoroni_tiny2350.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
pimoroni_tiny2350.menu.dbglvl.Wire=Wire
pimoroni_tiny2350.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
pimoroni_tiny2350.menu.dbglvl.Bluetooth=Bluetooth
pimoroni_tiny2350.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
pimoroni_tiny2350.menu.dbglvl.All=All
pimoroni_tiny2350.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
pimoroni_tiny2350.menu.dbglvl.NDEBUG=NDEBUG
pimoroni_tiny2350.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
pimoroni_tiny2350.menu.usbstack.picosdk=Pico SDK
pimoroni_tiny2350.menu.usbstack.picosdk.build.usbstack_flags=
pimoroni_tiny2350.menu.usbstack.tinyusb=Adafruit TinyUSB
pimoroni_tiny2350.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_tiny2350.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
pimoroni_tiny2350.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pimoroni_tiny2350.menu.usbstack.nousb=No USB
pimoroni_tiny2350.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
pimoroni_tiny2350.menu.ipbtstack.ipv4only=IPv4 Only
pimoroni_tiny2350.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
pimoroni_tiny2350.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
pimoroni_tiny2350.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
pimoroni_tiny2350.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
pimoroni_tiny2350.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pimoroni_tiny2350.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
pimoroni_tiny2350.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
pimoroni_tiny2350.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pimoroni_tiny2350.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
pimoroni_tiny2350.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
pimoroni_tiny2350.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
pimoroni_tiny2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pimoroni_tiny2350.menu.uploadmethod.default=Default (UF2)
pimoroni_tiny2350.menu.uploadmethod.default.build.ram_length=512k
pimoroni_tiny2350.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_tiny2350.menu.uploadmethod.default.upload.maximum_data_size=524288
pimoroni_tiny2350.menu.uploadmethod.default.upload.tool=uf2conv
pimoroni_tiny2350.menu.uploadmethod.default.upload.tool.default=uf2conv
pimoroni_tiny2350.menu.uploadmethod.default.upload.tool.network=uf2conv-network
pimoroni_tiny2350.menu.uploadmethod.picotool=Picotool
pimoroni_tiny2350.menu.uploadmethod.picotool.build.ram_length=512k
pimoroni_tiny2350.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
pimoroni_tiny2350.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
pimoroni_tiny2350.menu.uploadmethod.picotool.upload.maximum_data_size=524288
pimoroni_tiny2350.menu.uploadmethod.picotool.upload.tool=picotool
pimoroni_tiny2350.menu.uploadmethod.picotool.upload.tool.default=picotool
pimoroni_tiny2350.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
pimoroni_tiny2350.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
pimoroni_tiny2350.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
pimoroni_tiny2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
pimoroni_tiny2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
pimoroni_tiny2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

