earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Pintronix PinMax
# -----------------------------------
pintronix_pinmax.name=Pintronix PinMax
pintronix_pinmax.vid.0=0x2e8a
pintronix_pinmax.pid.0=0x9101
pintronix_pinmax.vid.1=0x2e8a
pintronix_pinmax.pid.1=0xd101
pintronix_pinmax.upload_port.0.vid=0x2e8a
pintronix_pinmax.upload_port.0.pid=0x9101
pintronix_pinmax.upload_port.1.vid=0x2e8a
pintronix_pinmax.upload_port.1.pid=0xd101
pintronix_pinmax.build.usbvid=-DUSBD_VID=0x2e8a
pintronix_pinmax.build.usbpid=-DUSBD_PID=0x9101
pintronix_pinmax.build.usbpwr=-DUSBD_MAX_POWER_MA=250
pintronix_pinmax.build.board=PINTRONIX_PINMAX
pintronix_pinmax.build.mcu=cortex-m0plus
pintronix_pinmax.build.chip=rp2040
pintronix_pinmax.build.toolchain=arm-none-eabi
pintronix_pinmax.build.toolchainpkg=pqt-gcc
pintronix_pinmax.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
pintronix_pinmax.build.uf2family=--family rp2040
pintronix_pinmax.build.variant=pintronix_pinmax
pintronix_pinmax.upload.maximum_size=4194304
pintronix_pinmax.upload.wait_for_upload_port=true
pintronix_pinmax.upload.erase_cmd=
pintronix_pinmax.serial.disableDTR=false
pintronix_pinmax.serial.disableRTS=false
pintronix_pinmax.build.f_cpu=125000000
pintronix_pinmax.build.led=
pintronix_pinmax.build.core=rp2040
pintronix_pinmax.build.ldscript=memmap_default.ld
pintronix_pinmax.build.boot2=boot2_w25q080_2_padded_checksum
pintronix_pinmax.build.usb_manufacturer="Pintronix"
pintronix_pinmax.build.usb_product="PinMax"
pintronix_pinmax.menu.flash.4194304_0=4MB (no FS)
pintronix_pinmax.menu.flash.4194304_0.upload.maximum_size=4190208
pintronix_pinmax.menu.flash.4194304_0.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_0.build.flash_length=4190208
pintronix_pinmax.menu.flash.4194304_0.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_0.build.fs_start=272625664
pintronix_pinmax.menu.flash.4194304_0.build.fs_end=272625664
pintronix_pinmax.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
pintronix_pinmax.menu.flash.4194304_65536.upload.maximum_size=4124672
pintronix_pinmax.menu.flash.4194304_65536.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_65536.build.flash_length=4124672
pintronix_pinmax.menu.flash.4194304_65536.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_65536.build.fs_start=272560128
pintronix_pinmax.menu.flash.4194304_65536.build.fs_end=272625664
pintronix_pinmax.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
pintronix_pinmax.menu.flash.4194304_131072.upload.maximum_size=4059136
pintronix_pinmax.menu.flash.4194304_131072.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_131072.build.flash_length=4059136
pintronix_pinmax.menu.flash.4194304_131072.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_131072.build.fs_start=272494592
pintronix_pinmax.menu.flash.4194304_131072.build.fs_end=272625664
pintronix_pinmax.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
pintronix_pinmax.menu.flash.4194304_262144.upload.maximum_size=3928064
pintronix_pinmax.menu.flash.4194304_262144.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_262144.build.flash_length=3928064
pintronix_pinmax.menu.flash.4194304_262144.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_262144.build.fs_start=272363520
pintronix_pinmax.menu.flash.4194304_262144.build.fs_end=272625664
pintronix_pinmax.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
pintronix_pinmax.menu.flash.4194304_524288.upload.maximum_size=3665920
pintronix_pinmax.menu.flash.4194304_524288.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_524288.build.flash_length=3665920
pintronix_pinmax.menu.flash.4194304_524288.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_524288.build.fs_start=272101376
pintronix_pinmax.menu.flash.4194304_524288.build.fs_end=272625664
pintronix_pinmax.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
pintronix_pinmax.menu.flash.4194304_1048576.upload.maximum_size=3141632
pintronix_pinmax.menu.flash.4194304_1048576.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_1048576.build.flash_length=3141632
pintronix_pinmax.menu.flash.4194304_1048576.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_1048576.build.fs_start=271577088
pintronix_pinmax.menu.flash.4194304_1048576.build.fs_end=272625664
pintronix_pinmax.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
pintronix_pinmax.menu.flash.4194304_2097152.upload.maximum_size=2093056
pintronix_pinmax.menu.flash.4194304_2097152.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_2097152.build.flash_length=2093056
pintronix_pinmax.menu.flash.4194304_2097152.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_2097152.build.fs_start=270528512
pintronix_pinmax.menu.flash.4194304_2097152.build.fs_end=272625664
pintronix_pinmax.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
pintronix_pinmax.menu.flash.4194304_3145728.upload.maximum_size=1044480
pintronix_pinmax.menu.flash.4194304_3145728.build.flash_total=4194304
pintronix_pinmax.menu.flash.4194304_3145728.build.flash_length=1044480
pintronix_pinmax.menu.flash.4194304_3145728.build.eeprom_start=272625664
pintronix_pinmax.menu.flash.4194304_3145728.build.fs_start=269479936
pintronix_pinmax.menu.flash.4194304_3145728.build.fs_end=272625664
pintronix_pinmax.menu.freq.200=200 MHz
pintronix_pinmax.menu.freq.200.build.f_cpu=200000000L
pintronix_pinmax.menu.freq.50=50 MHz
pintronix_pinmax.menu.freq.50.build.f_cpu=50000000L
pintronix_pinmax.menu.freq.100=100 MHz
pintronix_pinmax.menu.freq.100.build.f_cpu=100000000L
pintronix_pinmax.menu.freq.120=120 MHz
pintronix_pinmax.menu.freq.120.build.f_cpu=120000000L
pintronix_pinmax.menu.freq.125=125 MHz
pintronix_pinmax.menu.freq.125.build.f_cpu=125000000L
pintronix_pinmax.menu.freq.128=128 MHz
pintronix_pinmax.menu.freq.128.build.f_cpu=128000000L
pintronix_pinmax.menu.freq.133=133 MHz
pintronix_pinmax.menu.freq.133.build.f_cpu=133000000L
pintronix_pinmax.menu.freq.150=150 MHz
pintronix_pinmax.menu.freq.150.build.f_cpu=150000000L
pintronix_pinmax.menu.freq.176=176 MHz
pintronix_pinmax.menu.freq.176.build.f_cpu=176000000L
pintronix_pinmax.menu.freq.225=225 MHz (Overclock)
pintronix_pinmax.menu.freq.225.build.f_cpu=225000000L
pintronix_pinmax.menu.freq.240=240 MHz (Overclock)
pintronix_pinmax.menu.freq.240.build.f_cpu=240000000L
pintronix_pinmax.menu.freq.250=250 MHz (Overclock)
pintronix_pinmax.menu.freq.250.build.f_cpu=250000000L
pintronix_pinmax.menu.freq.276=276 MHz (Overclock)
pintronix_pinmax.menu.freq.276.build.f_cpu=276000000L
pintronix_pinmax.menu.freq.300=300 MHz (Overclock)
pintronix_pinmax.menu.freq.300.build.f_cpu=300000000L
pintronix_pinmax.menu.opt.Small=Small (-Os) (standard)
pintronix_pinmax.menu.opt.Small.build.flags.optimize=-Os
pintronix_pinmax.menu.opt.Optimize=Optimize (-O)
pintronix_pinmax.menu.opt.Optimize.build.flags.optimize=-O
pintronix_pinmax.menu.opt.Optimize2=Optimize More (-O2)
pintronix_pinmax.menu.opt.Optimize2.build.flags.optimize=-O2
pintronix_pinmax.menu.opt.Optimize3=Optimize Even More (-O3)
pintronix_pinmax.menu.opt.Optimize3.build.flags.optimize=-O3
pintronix_pinmax.menu.opt.Fast=Fast (-Ofast) (maybe slower)
pintronix_pinmax.menu.opt.Fast.build.flags.optimize=-Ofast
pintronix_pinmax.menu.opt.Debug=Debug (-Og)
pintronix_pinmax.menu.opt.Debug.build.flags.optimize=-Og
pintronix_pinmax.menu.opt.Disabled=Disabled (-O0)
pintronix_pinmax.menu.opt.Disabled.build.flags.optimize=-O0
pintronix_pinmax.menu.profile.Disabled=Disabled
pintronix_pinmax.menu.profile.Disabled.build.flags.profile=
pintronix_pinmax.menu.profile.Enabled=Enabled
pintronix_pinmax.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
pintronix_pinmax.menu.rtti.Disabled=Disabled
pintronix_pinmax.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
pintronix_pinmax.menu.rtti.Enabled=Enabled
pintronix_pinmax.menu.rtti.Enabled.build.flags.rtti=
pintronix_pinmax.menu.stackprotect.Disabled=Disabled
pintronix_pinmax.menu.stackprotect.Disabled.build.flags.stackprotect=
pintronix_pinmax.menu.stackprotect.Enabled=Enabled
pintronix_pinmax.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
pintronix_pinmax.menu.exceptions.Disabled=Disabled
pintronix_pinmax.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
pintronix_pinmax.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
pintronix_pinmax.menu.exceptions.Enabled=Enabled
pintronix_pinmax.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
pintronix_pinmax.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
pintronix_pinmax.menu.dbgport.Disabled=Disabled
pintronix_pinmax.menu.dbgport.Disabled.build.debug_port=
pintronix_pinmax.menu.dbgport.Serial=Serial
pintronix_pinmax.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
pintronix_pinmax.menu.dbgport.Serial1=Serial1
pintronix_pinmax.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
pintronix_pinmax.menu.dbgport.Serial2=Serial2
pintronix_pinmax.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
pintronix_pinmax.menu.dbgport.SerialSemi=SerialSemi
pintronix_pinmax.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
pintronix_pinmax.menu.dbglvl.None=None
pintronix_pinmax.menu.dbglvl.None.build.debug_level=
pintronix_pinmax.menu.dbglvl.Core=Core
pintronix_pinmax.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
pintronix_pinmax.menu.dbglvl.SPI=SPI
pintronix_pinmax.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
pintronix_pinmax.menu.dbglvl.Wire=Wire
pintronix_pinmax.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
pintronix_pinmax.menu.dbglvl.Bluetooth=Bluetooth
pintronix_pinmax.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
pintronix_pinmax.menu.dbglvl.All=All
pintronix_pinmax.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
pintronix_pinmax.menu.dbglvl.NDEBUG=NDEBUG
pintronix_pinmax.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
pintronix_pinmax.menu.usbstack.picosdk=Pico SDK
pintronix_pinmax.menu.usbstack.picosdk.build.usbstack_flags=
pintronix_pinmax.menu.usbstack.tinyusb=Adafruit TinyUSB
pintronix_pinmax.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pintronix_pinmax.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
pintronix_pinmax.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
pintronix_pinmax.menu.usbstack.nousb=No USB
pintronix_pinmax.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
pintronix_pinmax.menu.ipbtstack.ipv4only=IPv4 Only
pintronix_pinmax.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
pintronix_pinmax.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
pintronix_pinmax.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
pintronix_pinmax.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
pintronix_pinmax.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
pintronix_pinmax.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
pintronix_pinmax.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
pintronix_pinmax.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pintronix_pinmax.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
pintronix_pinmax.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
pintronix_pinmax.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
pintronix_pinmax.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
pintronix_pinmax.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
pintronix_pinmax.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pintronix_pinmax.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
pintronix_pinmax.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
pintronix_pinmax.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
pintronix_pinmax.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
pintronix_pinmax.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
pintronix_pinmax.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pintronix_pinmax.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
pintronix_pinmax.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
pintronix_pinmax.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
pintronix_pinmax.menu.uploadmethod.default=Default (UF2)
pintronix_pinmax.menu.uploadmethod.default.build.ram_length=256k
pintronix_pinmax.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
pintronix_pinmax.menu.uploadmethod.default.upload.maximum_data_size=262144
pintronix_pinmax.menu.uploadmethod.default.upload.tool=uf2conv
pintronix_pinmax.menu.uploadmethod.default.upload.tool.default=uf2conv
pintronix_pinmax.menu.uploadmethod.default.upload.tool.network=uf2conv-network
pintronix_pinmax.menu.uploadmethod.picotool=Picotool
pintronix_pinmax.menu.uploadmethod.picotool.build.ram_length=256k
pintronix_pinmax.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
pintronix_pinmax.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
pintronix_pinmax.menu.uploadmethod.picotool.upload.maximum_data_size=262144
pintronix_pinmax.menu.uploadmethod.picotool.upload.tool=picotool
pintronix_pinmax.menu.uploadmethod.picotool.upload.tool.default=picotool
pintronix_pinmax.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
pintronix_pinmax.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
pintronix_pinmax.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
pintronix_pinmax.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
pintronix_pinmax.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
pintronix_pinmax.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

