earlephilhower/arduino-pico/boards.txt
redscorp_rp2040_eins.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
redscorp_rp2040_eins.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
redscorp_rp2040_eins.menu.usbstack.nousb=No USB
redscorp_rp2040_eins.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
redscorp_rp2040_eins.menu.ipbtstack.ipv4only=IPv4 Only
redscorp_rp2040_eins.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
redscorp_rp2040_eins.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
redscorp_rp2040_eins.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
redscorp_rp2040_eins.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
redscorp_rp2040_eins.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_eins.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
redscorp_rp2040_eins.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
redscorp_rp2040_eins.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
redscorp_rp2040_eins.menu.uploadmethod.default=Default (UF2)
redscorp_rp2040_eins.menu.uploadmethod.default.build.ram_length=256k
redscorp_rp2040_eins.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
redscorp_rp2040_eins.menu.uploadmethod.default.upload.maximum_data_size=262144
redscorp_rp2040_eins.menu.uploadmethod.default.upload.tool=uf2conv
redscorp_rp2040_eins.menu.uploadmethod.default.upload.tool.default=uf2conv
redscorp_rp2040_eins.menu.uploadmethod.default.upload.tool.network=uf2conv-network
redscorp_rp2040_eins.menu.uploadmethod.picotool=Picotool
redscorp_rp2040_eins.menu.uploadmethod.picotool.build.ram_length=256k
redscorp_rp2040_eins.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
redscorp_rp2040_eins.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
redscorp_rp2040_eins.menu.uploadmethod.picotool.upload.maximum_data_size=262144
redscorp_rp2040_eins.menu.uploadmethod.picotool.upload.tool=picotool
redscorp_rp2040_eins.menu.uploadmethod.picotool.upload.tool.default=picotool
redscorp_rp2040_eins.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
redscorp_rp2040_eins.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
redscorp_rp2040_eins.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
redscorp_rp2040_eins.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
redscorp_rp2040_eins.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
redscorp_rp2040_eins.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# redscorp RP2040-ProMini
# -----------------------------------
redscorp_rp2040_promini.name=redscorp RP2040-ProMini
redscorp_rp2040_promini.vid.0=0x2341
redscorp_rp2040_promini.pid.0=0x005f
redscorp_rp2040_promini.vid.1=0x2341
redscorp_rp2040_promini.pid.1=0x805f
redscorp_rp2040_promini.vid.2=0x2341
redscorp_rp2040_promini.pid.2=0x015f
redscorp_rp2040_promini.vid.3=0x2341
redscorp_rp2040_promini.pid.3=0x025f
redscorp_rp2040_promini.upload_port.0.vid=0x2341
redscorp_rp2040_promini.upload_port.0.pid=0x005f
redscorp_rp2040_promini.upload_port.1.vid=0x2341
redscorp_rp2040_promini.upload_port.1.pid=0x805f
redscorp_rp2040_promini.upload_port.2.vid=0x2341
redscorp_rp2040_promini.upload_port.2.pid=0x015f
redscorp_rp2040_promini.upload_port.3.vid=0x2341
redscorp_rp2040_promini.upload_port.3.pid=0x025f
redscorp_rp2040_promini.build.usbvid=-DUSBD_VID=0x2341
redscorp_rp2040_promini.build.usbpid=-DUSBD_PID=0x005f
redscorp_rp2040_promini.build.usbpwr=-DUSBD_MAX_POWER_MA=250
redscorp_rp2040_promini.build.board=REDSCORP_RP2040_PROMINI
redscorp_rp2040_promini.build.mcu=cortex-m0plus
redscorp_rp2040_promini.build.chip=rp2040
redscorp_rp2040_promini.build.toolchain=arm-none-eabi
redscorp_rp2040_promini.build.toolchainpkg=pqt-gcc
redscorp_rp2040_promini.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
redscorp_rp2040_promini.build.uf2family=--family rp2040
redscorp_rp2040_promini.build.variant=redscorp_rp2040_promini
redscorp_rp2040_promini.upload.maximum_size=16777216
redscorp_rp2040_promini.upload.wait_for_upload_port=true
redscorp_rp2040_promini.upload.erase_cmd=
redscorp_rp2040_promini.serial.disableDTR=false
redscorp_rp2040_promini.serial.disableRTS=false
redscorp_rp2040_promini.build.f_cpu=125000000
redscorp_rp2040_promini.build.led=
redscorp_rp2040_promini.build.core=rp2040
redscorp_rp2040_promini.build.ldscript=memmap_default.ld
redscorp_rp2040_promini.build.boot2=boot2_w25q080_2_padded_checksum
redscorp_rp2040_promini.build.usb_manufacturer="redscorp"
redscorp_rp2040_promini.build.usb_product="RP2040-ProMini"
redscorp_rp2040_promini.menu.flash.16777216_0=16MB (no FS)
redscorp_rp2040_promini.menu.flash.16777216_0.upload.maximum_size=16773120
redscorp_rp2040_promini.menu.flash.16777216_0.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_0.build.flash_length=16773120
redscorp_rp2040_promini.menu.flash.16777216_0.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_0.build.fs_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_0.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
redscorp_rp2040_promini.menu.flash.16777216_65536.upload.maximum_size=16707584
redscorp_rp2040_promini.menu.flash.16777216_65536.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_65536.build.flash_length=16707584
redscorp_rp2040_promini.menu.flash.16777216_65536.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_65536.build.fs_start=285143040
redscorp_rp2040_promini.menu.flash.16777216_65536.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
redscorp_rp2040_promini.menu.flash.16777216_131072.upload.maximum_size=16642048
redscorp_rp2040_promini.menu.flash.16777216_131072.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_131072.build.flash_length=16642048
redscorp_rp2040_promini.menu.flash.16777216_131072.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_131072.build.fs_start=285077504
redscorp_rp2040_promini.menu.flash.16777216_131072.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
redscorp_rp2040_promini.menu.flash.16777216_262144.upload.maximum_size=16510976
redscorp_rp2040_promini.menu.flash.16777216_262144.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_262144.build.flash_length=16510976
redscorp_rp2040_promini.menu.flash.16777216_262144.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_262144.build.fs_start=284946432
redscorp_rp2040_promini.menu.flash.16777216_262144.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
redscorp_rp2040_promini.menu.flash.16777216_524288.upload.maximum_size=16248832
redscorp_rp2040_promini.menu.flash.16777216_524288.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_524288.build.flash_length=16248832
redscorp_rp2040_promini.menu.flash.16777216_524288.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_524288.build.fs_start=284684288
redscorp_rp2040_promini.menu.flash.16777216_524288.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
redscorp_rp2040_promini.menu.flash.16777216_1048576.upload.maximum_size=15724544
redscorp_rp2040_promini.menu.flash.16777216_1048576.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_1048576.build.flash_length=15724544
redscorp_rp2040_promini.menu.flash.16777216_1048576.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_1048576.build.fs_start=284160000
redscorp_rp2040_promini.menu.flash.16777216_1048576.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
redscorp_rp2040_promini.menu.flash.16777216_2097152.upload.maximum_size=14675968
redscorp_rp2040_promini.menu.flash.16777216_2097152.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_2097152.build.flash_length=14675968
redscorp_rp2040_promini.menu.flash.16777216_2097152.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_2097152.build.fs_start=283111424
redscorp_rp2040_promini.menu.flash.16777216_2097152.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
redscorp_rp2040_promini.menu.flash.16777216_3145728.upload.maximum_size=13627392
redscorp_rp2040_promini.menu.flash.16777216_3145728.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_3145728.build.flash_length=13627392
redscorp_rp2040_promini.menu.flash.16777216_3145728.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_3145728.build.fs_start=282062848
redscorp_rp2040_promini.menu.flash.16777216_3145728.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
redscorp_rp2040_promini.menu.flash.16777216_4194304.upload.maximum_size=12578816
redscorp_rp2040_promini.menu.flash.16777216_4194304.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_4194304.build.flash_length=12578816
redscorp_rp2040_promini.menu.flash.16777216_4194304.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_4194304.build.fs_start=281014272
redscorp_rp2040_promini.menu.flash.16777216_4194304.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
redscorp_rp2040_promini.menu.flash.16777216_5242880.upload.maximum_size=11530240
redscorp_rp2040_promini.menu.flash.16777216_5242880.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_5242880.build.flash_length=11530240
redscorp_rp2040_promini.menu.flash.16777216_5242880.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_5242880.build.fs_start=279965696
redscorp_rp2040_promini.menu.flash.16777216_5242880.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
redscorp_rp2040_promini.menu.flash.16777216_6291456.upload.maximum_size=10481664
redscorp_rp2040_promini.menu.flash.16777216_6291456.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_6291456.build.flash_length=10481664
redscorp_rp2040_promini.menu.flash.16777216_6291456.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_6291456.build.fs_start=278917120
redscorp_rp2040_promini.menu.flash.16777216_6291456.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
redscorp_rp2040_promini.menu.flash.16777216_7340032.upload.maximum_size=9433088
redscorp_rp2040_promini.menu.flash.16777216_7340032.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_7340032.build.flash_length=9433088
redscorp_rp2040_promini.menu.flash.16777216_7340032.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_7340032.build.fs_start=277868544
redscorp_rp2040_promini.menu.flash.16777216_7340032.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
redscorp_rp2040_promini.menu.flash.16777216_8388608.upload.maximum_size=8384512
redscorp_rp2040_promini.menu.flash.16777216_8388608.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_8388608.build.flash_length=8384512
redscorp_rp2040_promini.menu.flash.16777216_8388608.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_8388608.build.fs_start=276819968
redscorp_rp2040_promini.menu.flash.16777216_8388608.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
redscorp_rp2040_promini.menu.flash.16777216_9437184.upload.maximum_size=7335936
redscorp_rp2040_promini.menu.flash.16777216_9437184.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_9437184.build.flash_length=7335936
redscorp_rp2040_promini.menu.flash.16777216_9437184.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_9437184.build.fs_start=275771392
redscorp_rp2040_promini.menu.flash.16777216_9437184.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
redscorp_rp2040_promini.menu.flash.16777216_10485760.upload.maximum_size=6287360
redscorp_rp2040_promini.menu.flash.16777216_10485760.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_10485760.build.flash_length=6287360
redscorp_rp2040_promini.menu.flash.16777216_10485760.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_10485760.build.fs_start=274722816
redscorp_rp2040_promini.menu.flash.16777216_10485760.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
redscorp_rp2040_promini.menu.flash.16777216_11534336.upload.maximum_size=5238784
redscorp_rp2040_promini.menu.flash.16777216_11534336.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_11534336.build.flash_length=5238784
redscorp_rp2040_promini.menu.flash.16777216_11534336.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_11534336.build.fs_start=273674240
redscorp_rp2040_promini.menu.flash.16777216_11534336.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
redscorp_rp2040_promini.menu.flash.16777216_12582912.upload.maximum_size=4190208
redscorp_rp2040_promini.menu.flash.16777216_12582912.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_12582912.build.flash_length=4190208
redscorp_rp2040_promini.menu.flash.16777216_12582912.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_12582912.build.fs_start=272625664
redscorp_rp2040_promini.menu.flash.16777216_12582912.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
redscorp_rp2040_promini.menu.flash.16777216_13631488.upload.maximum_size=3141632
redscorp_rp2040_promini.menu.flash.16777216_13631488.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_13631488.build.flash_length=3141632
redscorp_rp2040_promini.menu.flash.16777216_13631488.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_13631488.build.fs_start=271577088
redscorp_rp2040_promini.menu.flash.16777216_13631488.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
redscorp_rp2040_promini.menu.flash.16777216_14680064.upload.maximum_size=2093056
redscorp_rp2040_promini.menu.flash.16777216_14680064.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_14680064.build.flash_length=2093056
redscorp_rp2040_promini.menu.flash.16777216_14680064.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_14680064.build.fs_start=270528512
redscorp_rp2040_promini.menu.flash.16777216_14680064.build.fs_end=285208576
redscorp_rp2040_promini.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
redscorp_rp2040_promini.menu.flash.16777216_15728640.upload.maximum_size=1044480
redscorp_rp2040_promini.menu.flash.16777216_15728640.build.flash_total=16777216
redscorp_rp2040_promini.menu.flash.16777216_15728640.build.flash_length=1044480
redscorp_rp2040_promini.menu.flash.16777216_15728640.build.eeprom_start=285208576
redscorp_rp2040_promini.menu.flash.16777216_15728640.build.fs_start=269479936
redscorp_rp2040_promini.menu.flash.16777216_15728640.build.fs_end=285208576
redscorp_rp2040_promini.menu.freq.200=200 MHz
redscorp_rp2040_promini.menu.freq.200.build.f_cpu=200000000L
redscorp_rp2040_promini.menu.freq.50=50 MHz
redscorp_rp2040_promini.menu.freq.50.build.f_cpu=50000000L
redscorp_rp2040_promini.menu.freq.100=100 MHz
redscorp_rp2040_promini.menu.freq.100.build.f_cpu=100000000L
redscorp_rp2040_promini.menu.freq.120=120 MHz
redscorp_rp2040_promini.menu.freq.120.build.f_cpu=120000000L
redscorp_rp2040_promini.menu.freq.125=125 MHz
redscorp_rp2040_promini.menu.freq.125.build.f_cpu=125000000L
redscorp_rp2040_promini.menu.freq.128=128 MHz
redscorp_rp2040_promini.menu.freq.128.build.f_cpu=128000000L
redscorp_rp2040_promini.menu.freq.133=133 MHz
