earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Generic Sea-Picro
# -----------------------------------
sea_picro.name=Generic Sea-Picro
sea_picro.vid.0=0x2e8a
sea_picro.pid.0=0xf00a
sea_picro.vid.1=0x2e8a
sea_picro.pid.1=0xf10a
sea_picro.upload_port.0.vid=0x2e8a
sea_picro.upload_port.0.pid=0xf00a
sea_picro.upload_port.1.vid=0x2e8a
sea_picro.upload_port.1.pid=0xf10a
sea_picro.build.usbvid=-DUSBD_VID=0x2e8a
sea_picro.build.usbpid=-DUSBD_PID=0xf00a
sea_picro.build.usbpwr=-DUSBD_MAX_POWER_MA=500
sea_picro.build.board=SEA_PICRO
sea_picro.build.mcu=cortex-m0plus
sea_picro.build.chip=rp2040
sea_picro.build.toolchain=arm-none-eabi
sea_picro.build.toolchainpkg=pqt-gcc
sea_picro.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
sea_picro.build.uf2family=--family rp2040
sea_picro.build.variant=sea_picro
sea_picro.upload.maximum_size=8388608
sea_picro.upload.wait_for_upload_port=true
sea_picro.upload.erase_cmd=
sea_picro.serial.disableDTR=false
sea_picro.serial.disableRTS=false
sea_picro.build.f_cpu=125000000
sea_picro.build.led=
sea_picro.build.core=rp2040
sea_picro.build.ldscript=memmap_default.ld
sea_picro.build.boot2=boot2_w25q64jv_4_padded_checksum
sea_picro.build.usb_manufacturer="Generic"
sea_picro.build.usb_product="Sea-Picro"
sea_picro.menu.flash.8388608_0=8MB (no FS)
sea_picro.menu.flash.8388608_0.upload.maximum_size=8384512
sea_picro.menu.flash.8388608_0.build.flash_total=8388608
sea_picro.menu.flash.8388608_0.build.flash_length=8384512
sea_picro.menu.flash.8388608_0.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_0.build.fs_start=276819968
sea_picro.menu.flash.8388608_0.build.fs_end=276819968
sea_picro.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
sea_picro.menu.flash.8388608_65536.upload.maximum_size=8318976
sea_picro.menu.flash.8388608_65536.build.flash_total=8388608
sea_picro.menu.flash.8388608_65536.build.flash_length=8318976
sea_picro.menu.flash.8388608_65536.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_65536.build.fs_start=276754432
sea_picro.menu.flash.8388608_65536.build.fs_end=276819968
sea_picro.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
sea_picro.menu.flash.8388608_131072.upload.maximum_size=8253440
sea_picro.menu.flash.8388608_131072.build.flash_total=8388608
sea_picro.menu.flash.8388608_131072.build.flash_length=8253440
sea_picro.menu.flash.8388608_131072.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_131072.build.fs_start=276688896
sea_picro.menu.flash.8388608_131072.build.fs_end=276819968
sea_picro.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
sea_picro.menu.flash.8388608_262144.upload.maximum_size=8122368
sea_picro.menu.flash.8388608_262144.build.flash_total=8388608
sea_picro.menu.flash.8388608_262144.build.flash_length=8122368
sea_picro.menu.flash.8388608_262144.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_262144.build.fs_start=276557824
sea_picro.menu.flash.8388608_262144.build.fs_end=276819968
sea_picro.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
sea_picro.menu.flash.8388608_524288.upload.maximum_size=7860224
sea_picro.menu.flash.8388608_524288.build.flash_total=8388608
sea_picro.menu.flash.8388608_524288.build.flash_length=7860224
sea_picro.menu.flash.8388608_524288.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_524288.build.fs_start=276295680
sea_picro.menu.flash.8388608_524288.build.fs_end=276819968
sea_picro.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
sea_picro.menu.flash.8388608_1048576.upload.maximum_size=7335936
sea_picro.menu.flash.8388608_1048576.build.flash_total=8388608
sea_picro.menu.flash.8388608_1048576.build.flash_length=7335936
sea_picro.menu.flash.8388608_1048576.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_1048576.build.fs_start=275771392
sea_picro.menu.flash.8388608_1048576.build.fs_end=276819968
sea_picro.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
sea_picro.menu.flash.8388608_2097152.upload.maximum_size=6287360
sea_picro.menu.flash.8388608_2097152.build.flash_total=8388608
sea_picro.menu.flash.8388608_2097152.build.flash_length=6287360
sea_picro.menu.flash.8388608_2097152.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_2097152.build.fs_start=274722816
sea_picro.menu.flash.8388608_2097152.build.fs_end=276819968
sea_picro.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
sea_picro.menu.flash.8388608_3145728.upload.maximum_size=5238784
sea_picro.menu.flash.8388608_3145728.build.flash_total=8388608
sea_picro.menu.flash.8388608_3145728.build.flash_length=5238784
sea_picro.menu.flash.8388608_3145728.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_3145728.build.fs_start=273674240
sea_picro.menu.flash.8388608_3145728.build.fs_end=276819968
sea_picro.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
sea_picro.menu.flash.8388608_4194304.upload.maximum_size=4190208
sea_picro.menu.flash.8388608_4194304.build.flash_total=8388608
sea_picro.menu.flash.8388608_4194304.build.flash_length=4190208
sea_picro.menu.flash.8388608_4194304.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_4194304.build.fs_start=272625664
sea_picro.menu.flash.8388608_4194304.build.fs_end=276819968
sea_picro.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
sea_picro.menu.flash.8388608_5242880.upload.maximum_size=3141632
sea_picro.menu.flash.8388608_5242880.build.flash_total=8388608
sea_picro.menu.flash.8388608_5242880.build.flash_length=3141632
sea_picro.menu.flash.8388608_5242880.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_5242880.build.fs_start=271577088
sea_picro.menu.flash.8388608_5242880.build.fs_end=276819968
sea_picro.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
sea_picro.menu.flash.8388608_6291456.upload.maximum_size=2093056
sea_picro.menu.flash.8388608_6291456.build.flash_total=8388608
sea_picro.menu.flash.8388608_6291456.build.flash_length=2093056
sea_picro.menu.flash.8388608_6291456.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_6291456.build.fs_start=270528512
sea_picro.menu.flash.8388608_6291456.build.fs_end=276819968
sea_picro.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
sea_picro.menu.flash.8388608_7340032.upload.maximum_size=1044480
sea_picro.menu.flash.8388608_7340032.build.flash_total=8388608
sea_picro.menu.flash.8388608_7340032.build.flash_length=1044480
sea_picro.menu.flash.8388608_7340032.build.eeprom_start=276819968
sea_picro.menu.flash.8388608_7340032.build.fs_start=269479936
sea_picro.menu.flash.8388608_7340032.build.fs_end=276819968
sea_picro.menu.freq.200=200 MHz
sea_picro.menu.freq.200.build.f_cpu=200000000L
sea_picro.menu.freq.50=50 MHz
sea_picro.menu.freq.50.build.f_cpu=50000000L
sea_picro.menu.freq.100=100 MHz
sea_picro.menu.freq.100.build.f_cpu=100000000L
sea_picro.menu.freq.120=120 MHz
sea_picro.menu.freq.120.build.f_cpu=120000000L
sea_picro.menu.freq.125=125 MHz
sea_picro.menu.freq.125.build.f_cpu=125000000L
sea_picro.menu.freq.128=128 MHz
sea_picro.menu.freq.128.build.f_cpu=128000000L
sea_picro.menu.freq.133=133 MHz
sea_picro.menu.freq.133.build.f_cpu=133000000L
sea_picro.menu.freq.150=150 MHz
sea_picro.menu.freq.150.build.f_cpu=150000000L
sea_picro.menu.freq.176=176 MHz
sea_picro.menu.freq.176.build.f_cpu=176000000L
sea_picro.menu.freq.225=225 MHz (Overclock)
sea_picro.menu.freq.225.build.f_cpu=225000000L
sea_picro.menu.freq.240=240 MHz (Overclock)
sea_picro.menu.freq.240.build.f_cpu=240000000L
sea_picro.menu.freq.250=250 MHz (Overclock)
sea_picro.menu.freq.250.build.f_cpu=250000000L
sea_picro.menu.freq.276=276 MHz (Overclock)
sea_picro.menu.freq.276.build.f_cpu=276000000L
sea_picro.menu.freq.300=300 MHz (Overclock)
sea_picro.menu.freq.300.build.f_cpu=300000000L
sea_picro.menu.opt.Small=Small (-Os) (standard)
sea_picro.menu.opt.Small.build.flags.optimize=-Os
sea_picro.menu.opt.Optimize=Optimize (-O)
sea_picro.menu.opt.Optimize.build.flags.optimize=-O
sea_picro.menu.opt.Optimize2=Optimize More (-O2)
sea_picro.menu.opt.Optimize2.build.flags.optimize=-O2
sea_picro.menu.opt.Optimize3=Optimize Even More (-O3)
sea_picro.menu.opt.Optimize3.build.flags.optimize=-O3
sea_picro.menu.opt.Fast=Fast (-Ofast) (maybe slower)
sea_picro.menu.opt.Fast.build.flags.optimize=-Ofast
sea_picro.menu.opt.Debug=Debug (-Og)
sea_picro.menu.opt.Debug.build.flags.optimize=-Og
sea_picro.menu.opt.Disabled=Disabled (-O0)
sea_picro.menu.opt.Disabled.build.flags.optimize=-O0
sea_picro.menu.profile.Disabled=Disabled
sea_picro.menu.profile.Disabled.build.flags.profile=
sea_picro.menu.profile.Enabled=Enabled
sea_picro.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
sea_picro.menu.rtti.Disabled=Disabled
sea_picro.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
sea_picro.menu.rtti.Enabled=Enabled
sea_picro.menu.rtti.Enabled.build.flags.rtti=
sea_picro.menu.stackprotect.Disabled=Disabled
sea_picro.menu.stackprotect.Disabled.build.flags.stackprotect=
sea_picro.menu.stackprotect.Enabled=Enabled
sea_picro.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
sea_picro.menu.exceptions.Disabled=Disabled
sea_picro.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
sea_picro.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
sea_picro.menu.exceptions.Enabled=Enabled
sea_picro.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
sea_picro.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
sea_picro.menu.dbgport.Disabled=Disabled
sea_picro.menu.dbgport.Disabled.build.debug_port=
sea_picro.menu.dbgport.Serial=Serial
sea_picro.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
sea_picro.menu.dbgport.Serial1=Serial1
sea_picro.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
sea_picro.menu.dbgport.Serial2=Serial2
sea_picro.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sea_picro.menu.dbgport.SerialSemi=SerialSemi
sea_picro.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
sea_picro.menu.dbglvl.None=None
sea_picro.menu.dbglvl.None.build.debug_level=
sea_picro.menu.dbglvl.Core=Core
sea_picro.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sea_picro.menu.dbglvl.SPI=SPI
sea_picro.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sea_picro.menu.dbglvl.Wire=Wire
sea_picro.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sea_picro.menu.dbglvl.Bluetooth=Bluetooth
sea_picro.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
sea_picro.menu.dbglvl.All=All
sea_picro.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
sea_picro.menu.dbglvl.NDEBUG=NDEBUG
sea_picro.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sea_picro.menu.usbstack.picosdk=Pico SDK
sea_picro.menu.usbstack.picosdk.build.usbstack_flags=
sea_picro.menu.usbstack.tinyusb=Adafruit TinyUSB
sea_picro.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sea_picro.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
sea_picro.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sea_picro.menu.usbstack.nousb=No USB
sea_picro.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
sea_picro.menu.ipbtstack.ipv4only=IPv4 Only
sea_picro.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
sea_picro.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
sea_picro.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
sea_picro.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
sea_picro.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
sea_picro.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
sea_picro.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
sea_picro.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sea_picro.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
sea_picro.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
sea_picro.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sea_picro.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
sea_picro.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
sea_picro.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sea_picro.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
sea_picro.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
sea_picro.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sea_picro.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
sea_picro.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
sea_picro.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sea_picro.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
sea_picro.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
sea_picro.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sea_picro.menu.uploadmethod.default=Default (UF2)
sea_picro.menu.uploadmethod.default.build.ram_length=256k
sea_picro.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
sea_picro.menu.uploadmethod.default.upload.maximum_data_size=262144
sea_picro.menu.uploadmethod.default.upload.tool=uf2conv
sea_picro.menu.uploadmethod.default.upload.tool.default=uf2conv
sea_picro.menu.uploadmethod.default.upload.tool.network=uf2conv-network
sea_picro.menu.uploadmethod.picotool=Picotool
sea_picro.menu.uploadmethod.picotool.build.ram_length=256k
sea_picro.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
sea_picro.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
sea_picro.menu.uploadmethod.picotool.upload.maximum_data_size=262144
sea_picro.menu.uploadmethod.picotool.upload.tool=picotool
sea_picro.menu.uploadmethod.picotool.upload.tool.default=picotool
sea_picro.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
sea_picro.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
sea_picro.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
sea_picro.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
sea_picro.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
sea_picro.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

