earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Solder Party RP2350 Stamp XL
# -----------------------------------
solderparty_rp2350_stamp_xl.name=Solder Party RP2350 Stamp XL
solderparty_rp2350_stamp_xl.vid.0=0x1209
solderparty_rp2350_stamp_xl.pid.0=0xa184
solderparty_rp2350_stamp_xl.vid.1=0x1209
solderparty_rp2350_stamp_xl.pid.1=0xe184
solderparty_rp2350_stamp_xl.upload_port.0.vid=0x1209
solderparty_rp2350_stamp_xl.upload_port.0.pid=0xa184
solderparty_rp2350_stamp_xl.upload_port.1.vid=0x1209
solderparty_rp2350_stamp_xl.upload_port.1.pid=0xe184
solderparty_rp2350_stamp_xl.build.usbvid=-DUSBD_VID=0x1209
solderparty_rp2350_stamp_xl.build.usbpid=-DUSBD_PID=0xa184
solderparty_rp2350_stamp_xl.build.usbpwr=-DUSBD_MAX_POWER_MA=500
solderparty_rp2350_stamp_xl.build.board=SOLDERPARTY_RP2350_STAMP_XL
solderparty_rp2350_stamp_xl.build.variant=solderparty_rp2350_stamp_xl
solderparty_rp2350_stamp_xl.upload.maximum_size=16777216
solderparty_rp2350_stamp_xl.upload.wait_for_upload_port=true
solderparty_rp2350_stamp_xl.upload.erase_cmd=
solderparty_rp2350_stamp_xl.serial.disableDTR=false
solderparty_rp2350_stamp_xl.serial.disableRTS=false
solderparty_rp2350_stamp_xl.build.f_cpu=125000000
solderparty_rp2350_stamp_xl.build.led=
solderparty_rp2350_stamp_xl.build.core=rp2040
solderparty_rp2350_stamp_xl.build.ldscript=memmap_default.ld
solderparty_rp2350_stamp_xl.build.boot2=none
solderparty_rp2350_stamp_xl.build.usb_manufacturer="Solder Party"
solderparty_rp2350_stamp_xl.build.usb_product="RP2350 Stamp XL"
solderparty_rp2350_stamp_xl.build.psram_length=0x000000
solderparty_rp2350_stamp_xl.menu.flash.16777216_0=16MB (no FS)
solderparty_rp2350_stamp_xl.menu.flash.16777216_0.upload.maximum_size=16769024
solderparty_rp2350_stamp_xl.menu.flash.16777216_0.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_0.build.flash_length=16769024
solderparty_rp2350_stamp_xl.menu.flash.16777216_0.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_0.build.fs_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_0.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_65536.upload.maximum_size=16703488
solderparty_rp2350_stamp_xl.menu.flash.16777216_65536.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_65536.build.flash_length=16703488
solderparty_rp2350_stamp_xl.menu.flash.16777216_65536.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_65536.build.fs_start=285138944
solderparty_rp2350_stamp_xl.menu.flash.16777216_65536.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_131072.upload.maximum_size=16637952
solderparty_rp2350_stamp_xl.menu.flash.16777216_131072.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_131072.build.flash_length=16637952
solderparty_rp2350_stamp_xl.menu.flash.16777216_131072.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_131072.build.fs_start=285073408
solderparty_rp2350_stamp_xl.menu.flash.16777216_131072.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_262144.upload.maximum_size=16506880
solderparty_rp2350_stamp_xl.menu.flash.16777216_262144.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_262144.build.flash_length=16506880
solderparty_rp2350_stamp_xl.menu.flash.16777216_262144.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_262144.build.fs_start=284942336
solderparty_rp2350_stamp_xl.menu.flash.16777216_262144.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_524288.upload.maximum_size=16244736
solderparty_rp2350_stamp_xl.menu.flash.16777216_524288.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_524288.build.flash_length=16244736
solderparty_rp2350_stamp_xl.menu.flash.16777216_524288.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_524288.build.fs_start=284680192
solderparty_rp2350_stamp_xl.menu.flash.16777216_524288.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_1048576.upload.maximum_size=15720448
solderparty_rp2350_stamp_xl.menu.flash.16777216_1048576.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_1048576.build.flash_length=15720448
solderparty_rp2350_stamp_xl.menu.flash.16777216_1048576.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_1048576.build.fs_start=284155904
solderparty_rp2350_stamp_xl.menu.flash.16777216_1048576.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_2097152.upload.maximum_size=14671872
solderparty_rp2350_stamp_xl.menu.flash.16777216_2097152.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_2097152.build.flash_length=14671872
solderparty_rp2350_stamp_xl.menu.flash.16777216_2097152.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_2097152.build.fs_start=283107328
solderparty_rp2350_stamp_xl.menu.flash.16777216_2097152.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_3145728.upload.maximum_size=13623296
solderparty_rp2350_stamp_xl.menu.flash.16777216_3145728.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_3145728.build.flash_length=13623296
solderparty_rp2350_stamp_xl.menu.flash.16777216_3145728.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_3145728.build.fs_start=282058752
solderparty_rp2350_stamp_xl.menu.flash.16777216_3145728.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_4194304.upload.maximum_size=12574720
solderparty_rp2350_stamp_xl.menu.flash.16777216_4194304.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_4194304.build.flash_length=12574720
solderparty_rp2350_stamp_xl.menu.flash.16777216_4194304.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_4194304.build.fs_start=281010176
solderparty_rp2350_stamp_xl.menu.flash.16777216_4194304.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_5242880.upload.maximum_size=11526144
solderparty_rp2350_stamp_xl.menu.flash.16777216_5242880.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_5242880.build.flash_length=11526144
solderparty_rp2350_stamp_xl.menu.flash.16777216_5242880.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_5242880.build.fs_start=279961600
solderparty_rp2350_stamp_xl.menu.flash.16777216_5242880.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_6291456.upload.maximum_size=10477568
solderparty_rp2350_stamp_xl.menu.flash.16777216_6291456.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_6291456.build.flash_length=10477568
solderparty_rp2350_stamp_xl.menu.flash.16777216_6291456.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_6291456.build.fs_start=278913024
solderparty_rp2350_stamp_xl.menu.flash.16777216_6291456.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_7340032.upload.maximum_size=9428992
solderparty_rp2350_stamp_xl.menu.flash.16777216_7340032.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_7340032.build.flash_length=9428992
solderparty_rp2350_stamp_xl.menu.flash.16777216_7340032.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_7340032.build.fs_start=277864448
solderparty_rp2350_stamp_xl.menu.flash.16777216_7340032.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_8388608.upload.maximum_size=8380416
solderparty_rp2350_stamp_xl.menu.flash.16777216_8388608.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_8388608.build.flash_length=8380416
solderparty_rp2350_stamp_xl.menu.flash.16777216_8388608.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_8388608.build.fs_start=276815872
solderparty_rp2350_stamp_xl.menu.flash.16777216_8388608.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_9437184.upload.maximum_size=7331840
solderparty_rp2350_stamp_xl.menu.flash.16777216_9437184.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_9437184.build.flash_length=7331840
solderparty_rp2350_stamp_xl.menu.flash.16777216_9437184.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_9437184.build.fs_start=275767296
solderparty_rp2350_stamp_xl.menu.flash.16777216_9437184.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_10485760.upload.maximum_size=6283264
solderparty_rp2350_stamp_xl.menu.flash.16777216_10485760.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_10485760.build.flash_length=6283264
solderparty_rp2350_stamp_xl.menu.flash.16777216_10485760.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_10485760.build.fs_start=274718720
solderparty_rp2350_stamp_xl.menu.flash.16777216_10485760.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_11534336.upload.maximum_size=5234688
solderparty_rp2350_stamp_xl.menu.flash.16777216_11534336.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_11534336.build.flash_length=5234688
solderparty_rp2350_stamp_xl.menu.flash.16777216_11534336.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_11534336.build.fs_start=273670144
solderparty_rp2350_stamp_xl.menu.flash.16777216_11534336.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_12582912.upload.maximum_size=4186112
solderparty_rp2350_stamp_xl.menu.flash.16777216_12582912.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_12582912.build.flash_length=4186112
solderparty_rp2350_stamp_xl.menu.flash.16777216_12582912.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_12582912.build.fs_start=272621568
solderparty_rp2350_stamp_xl.menu.flash.16777216_12582912.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_13631488.upload.maximum_size=3137536
solderparty_rp2350_stamp_xl.menu.flash.16777216_13631488.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_13631488.build.flash_length=3137536
solderparty_rp2350_stamp_xl.menu.flash.16777216_13631488.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_13631488.build.fs_start=271572992
solderparty_rp2350_stamp_xl.menu.flash.16777216_13631488.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_14680064.upload.maximum_size=2088960
solderparty_rp2350_stamp_xl.menu.flash.16777216_14680064.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_14680064.build.flash_length=2088960
solderparty_rp2350_stamp_xl.menu.flash.16777216_14680064.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_14680064.build.fs_start=270524416
solderparty_rp2350_stamp_xl.menu.flash.16777216_14680064.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
solderparty_rp2350_stamp_xl.menu.flash.16777216_15728640.upload.maximum_size=1040384
solderparty_rp2350_stamp_xl.menu.flash.16777216_15728640.build.flash_total=16777216
solderparty_rp2350_stamp_xl.menu.flash.16777216_15728640.build.flash_length=1040384
solderparty_rp2350_stamp_xl.menu.flash.16777216_15728640.build.eeprom_start=285204480
solderparty_rp2350_stamp_xl.menu.flash.16777216_15728640.build.fs_start=269475840
solderparty_rp2350_stamp_xl.menu.flash.16777216_15728640.build.fs_end=285204480
solderparty_rp2350_stamp_xl.menu.arch.arm=ARM
solderparty_rp2350_stamp_xl.menu.arch.arm.build.chip=rp2350
solderparty_rp2350_stamp_xl.menu.arch.arm.build.toolchain=arm-none-eabi
solderparty_rp2350_stamp_xl.menu.arch.arm.build.toolchainpkg=pqt-gcc
solderparty_rp2350_stamp_xl.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
solderparty_rp2350_stamp_xl.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
solderparty_rp2350_stamp_xl.menu.arch.arm.build.mcu=cortex-m33
solderparty_rp2350_stamp_xl.menu.arch.riscv=RISC-V
solderparty_rp2350_stamp_xl.menu.arch.riscv.build.chip=rp2350-riscv
solderparty_rp2350_stamp_xl.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
solderparty_rp2350_stamp_xl.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
solderparty_rp2350_stamp_xl.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
solderparty_rp2350_stamp_xl.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
solderparty_rp2350_stamp_xl.menu.arch.riscv.build.mcu=rv32imac
solderparty_rp2350_stamp_xl.menu.freq.150=150 MHz
solderparty_rp2350_stamp_xl.menu.freq.150.build.f_cpu=150000000L
solderparty_rp2350_stamp_xl.menu.freq.50=50 MHz
solderparty_rp2350_stamp_xl.menu.freq.50.build.f_cpu=50000000L
solderparty_rp2350_stamp_xl.menu.freq.100=100 MHz
solderparty_rp2350_stamp_xl.menu.freq.100.build.f_cpu=100000000L
solderparty_rp2350_stamp_xl.menu.freq.120=120 MHz
solderparty_rp2350_stamp_xl.menu.freq.120.build.f_cpu=120000000L
solderparty_rp2350_stamp_xl.menu.freq.125=125 MHz
solderparty_rp2350_stamp_xl.menu.freq.125.build.f_cpu=125000000L
solderparty_rp2350_stamp_xl.menu.freq.128=128 MHz
solderparty_rp2350_stamp_xl.menu.freq.128.build.f_cpu=128000000L
solderparty_rp2350_stamp_xl.menu.freq.133=133 MHz
solderparty_rp2350_stamp_xl.menu.freq.133.build.f_cpu=133000000L
solderparty_rp2350_stamp_xl.menu.freq.176=176 MHz (Overclock)
solderparty_rp2350_stamp_xl.menu.freq.176.build.f_cpu=176000000L
solderparty_rp2350_stamp_xl.menu.freq.200=200 MHz (Overclock)
solderparty_rp2350_stamp_xl.menu.freq.200.build.f_cpu=200000000L
solderparty_rp2350_stamp_xl.menu.freq.225=225 MHz (Overclock)
solderparty_rp2350_stamp_xl.menu.freq.225.build.f_cpu=225000000L
solderparty_rp2350_stamp_xl.menu.freq.240=240 MHz (Overclock)
solderparty_rp2350_stamp_xl.menu.freq.240.build.f_cpu=240000000L
solderparty_rp2350_stamp_xl.menu.freq.250=250 MHz (Overclock)
solderparty_rp2350_stamp_xl.menu.freq.250.build.f_cpu=250000000L
solderparty_rp2350_stamp_xl.menu.freq.276=276 MHz (Overclock)
solderparty_rp2350_stamp_xl.menu.freq.276.build.f_cpu=276000000L
solderparty_rp2350_stamp_xl.menu.freq.300=300 MHz (Overclock)
solderparty_rp2350_stamp_xl.menu.freq.300.build.f_cpu=300000000L
solderparty_rp2350_stamp_xl.menu.opt.Small=Small (-Os) (standard)
solderparty_rp2350_stamp_xl.menu.opt.Small.build.flags.optimize=-Os
solderparty_rp2350_stamp_xl.menu.opt.Optimize=Optimize (-O)
solderparty_rp2350_stamp_xl.menu.opt.Optimize.build.flags.optimize=-O
solderparty_rp2350_stamp_xl.menu.opt.Optimize2=Optimize More (-O2)
solderparty_rp2350_stamp_xl.menu.opt.Optimize2.build.flags.optimize=-O2
solderparty_rp2350_stamp_xl.menu.opt.Optimize3=Optimize Even More (-O3)
solderparty_rp2350_stamp_xl.menu.opt.Optimize3.build.flags.optimize=-O3
solderparty_rp2350_stamp_xl.menu.opt.Fast=Fast (-Ofast) (maybe slower)
solderparty_rp2350_stamp_xl.menu.opt.Fast.build.flags.optimize=-Ofast
solderparty_rp2350_stamp_xl.menu.opt.Debug=Debug (-Og)
solderparty_rp2350_stamp_xl.menu.opt.Debug.build.flags.optimize=-Og
solderparty_rp2350_stamp_xl.menu.opt.Disabled=Disabled (-O0)
solderparty_rp2350_stamp_xl.menu.opt.Disabled.build.flags.optimize=-O0
solderparty_rp2350_stamp_xl.menu.profile.Disabled=Disabled
solderparty_rp2350_stamp_xl.menu.profile.Disabled.build.flags.profile=
solderparty_rp2350_stamp_xl.menu.profile.Enabled=Enabled
solderparty_rp2350_stamp_xl.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
solderparty_rp2350_stamp_xl.menu.rtti.Disabled=Disabled
solderparty_rp2350_stamp_xl.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
solderparty_rp2350_stamp_xl.menu.rtti.Enabled=Enabled
solderparty_rp2350_stamp_xl.menu.rtti.Enabled.build.flags.rtti=
solderparty_rp2350_stamp_xl.menu.stackprotect.Disabled=Disabled
solderparty_rp2350_stamp_xl.menu.stackprotect.Disabled.build.flags.stackprotect=
solderparty_rp2350_stamp_xl.menu.stackprotect.Enabled=Enabled
solderparty_rp2350_stamp_xl.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
solderparty_rp2350_stamp_xl.menu.exceptions.Disabled=Disabled
solderparty_rp2350_stamp_xl.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
solderparty_rp2350_stamp_xl.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
