earlephilhower/arduino-pico/boards.txt
solderparty_rp2350_stamp_xl.menu.exceptions.Enabled=Enabled
solderparty_rp2350_stamp_xl.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
solderparty_rp2350_stamp_xl.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
solderparty_rp2350_stamp_xl.menu.dbgport.Disabled=Disabled
solderparty_rp2350_stamp_xl.menu.dbgport.Disabled.build.debug_port=
solderparty_rp2350_stamp_xl.menu.dbgport.Serial=Serial
solderparty_rp2350_stamp_xl.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
solderparty_rp2350_stamp_xl.menu.dbgport.Serial1=Serial1
solderparty_rp2350_stamp_xl.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
solderparty_rp2350_stamp_xl.menu.dbgport.Serial2=Serial2
solderparty_rp2350_stamp_xl.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
solderparty_rp2350_stamp_xl.menu.dbgport.SerialSemi=SerialSemi
solderparty_rp2350_stamp_xl.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
solderparty_rp2350_stamp_xl.menu.dbglvl.None=None
solderparty_rp2350_stamp_xl.menu.dbglvl.None.build.debug_level=
solderparty_rp2350_stamp_xl.menu.dbglvl.Core=Core
solderparty_rp2350_stamp_xl.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
solderparty_rp2350_stamp_xl.menu.dbglvl.SPI=SPI
solderparty_rp2350_stamp_xl.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
solderparty_rp2350_stamp_xl.menu.dbglvl.Wire=Wire
solderparty_rp2350_stamp_xl.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
solderparty_rp2350_stamp_xl.menu.dbglvl.Bluetooth=Bluetooth
solderparty_rp2350_stamp_xl.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
solderparty_rp2350_stamp_xl.menu.dbglvl.All=All
solderparty_rp2350_stamp_xl.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
solderparty_rp2350_stamp_xl.menu.dbglvl.NDEBUG=NDEBUG
solderparty_rp2350_stamp_xl.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
solderparty_rp2350_stamp_xl.menu.usbstack.picosdk=Pico SDK
solderparty_rp2350_stamp_xl.menu.usbstack.picosdk.build.usbstack_flags=
solderparty_rp2350_stamp_xl.menu.usbstack.tinyusb=Adafruit TinyUSB
solderparty_rp2350_stamp_xl.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
solderparty_rp2350_stamp_xl.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
solderparty_rp2350_stamp_xl.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
solderparty_rp2350_stamp_xl.menu.usbstack.nousb=No USB
solderparty_rp2350_stamp_xl.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4only=IPv4 Only
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
solderparty_rp2350_stamp_xl.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
solderparty_rp2350_stamp_xl.menu.uploadmethod.default=Default (UF2)
solderparty_rp2350_stamp_xl.menu.uploadmethod.default.build.ram_length=512k
solderparty_rp2350_stamp_xl.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
solderparty_rp2350_stamp_xl.menu.uploadmethod.default.upload.maximum_data_size=524288
solderparty_rp2350_stamp_xl.menu.uploadmethod.default.upload.tool=uf2conv
solderparty_rp2350_stamp_xl.menu.uploadmethod.default.upload.tool.default=uf2conv
solderparty_rp2350_stamp_xl.menu.uploadmethod.default.upload.tool.network=uf2conv-network
solderparty_rp2350_stamp_xl.menu.uploadmethod.picotool=Picotool
solderparty_rp2350_stamp_xl.menu.uploadmethod.picotool.build.ram_length=512k
solderparty_rp2350_stamp_xl.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
solderparty_rp2350_stamp_xl.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
solderparty_rp2350_stamp_xl.menu.uploadmethod.picotool.upload.maximum_data_size=524288
solderparty_rp2350_stamp_xl.menu.uploadmethod.picotool.upload.tool=picotool
solderparty_rp2350_stamp_xl.menu.uploadmethod.picotool.upload.tool.default=picotool
solderparty_rp2350_stamp_xl.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
solderparty_rp2350_stamp_xl.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
solderparty_rp2350_stamp_xl.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
solderparty_rp2350_stamp_xl.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
solderparty_rp2350_stamp_xl.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
solderparty_rp2350_stamp_xl.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

