earlephilhower/arduino-pico/boards.txt
sparkfun_micromodrp2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sparkfun_micromodrp2040.menu.dbgport.SerialSemi=SerialSemi
sparkfun_micromodrp2040.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
sparkfun_micromodrp2040.menu.dbglvl.None=None
sparkfun_micromodrp2040.menu.dbglvl.None.build.debug_level=
sparkfun_micromodrp2040.menu.dbglvl.Core=Core
sparkfun_micromodrp2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sparkfun_micromodrp2040.menu.dbglvl.SPI=SPI
sparkfun_micromodrp2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sparkfun_micromodrp2040.menu.dbglvl.Wire=Wire
sparkfun_micromodrp2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sparkfun_micromodrp2040.menu.dbglvl.Bluetooth=Bluetooth
sparkfun_micromodrp2040.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
sparkfun_micromodrp2040.menu.dbglvl.All=All
sparkfun_micromodrp2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
sparkfun_micromodrp2040.menu.dbglvl.NDEBUG=NDEBUG
sparkfun_micromodrp2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sparkfun_micromodrp2040.menu.usbstack.picosdk=Pico SDK
sparkfun_micromodrp2040.menu.usbstack.picosdk.build.usbstack_flags=
sparkfun_micromodrp2040.menu.usbstack.tinyusb=Adafruit TinyUSB
sparkfun_micromodrp2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_micromodrp2040.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
sparkfun_micromodrp2040.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_micromodrp2040.menu.usbstack.nousb=No USB
sparkfun_micromodrp2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
sparkfun_micromodrp2040.menu.ipbtstack.ipv4only=IPv4 Only
sparkfun_micromodrp2040.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_micromodrp2040.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
sparkfun_micromodrp2040.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_micromodrp2040.menu.uploadmethod.default=Default (UF2)
sparkfun_micromodrp2040.menu.uploadmethod.default.build.ram_length=256k
sparkfun_micromodrp2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.maximum_data_size=262144
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.tool=uf2conv
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.tool.default=uf2conv
sparkfun_micromodrp2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
sparkfun_micromodrp2040.menu.uploadmethod.picotool=Picotool
sparkfun_micromodrp2040.menu.uploadmethod.picotool.build.ram_length=256k
sparkfun_micromodrp2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
sparkfun_micromodrp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
sparkfun_micromodrp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
sparkfun_micromodrp2040.menu.uploadmethod.picotool.upload.tool=picotool
sparkfun_micromodrp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
sparkfun_micromodrp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# SparkFun ProMicro RP2040
# -----------------------------------
sparkfun_promicrorp2040.name=SparkFun ProMicro RP2040
sparkfun_promicrorp2040.vid.0=0x1b4f
sparkfun_promicrorp2040.pid.0=0x0026
sparkfun_promicrorp2040.vid.1=0x1b4f
sparkfun_promicrorp2040.pid.1=0x0126
sparkfun_promicrorp2040.vid.2=0x1b4f
sparkfun_promicrorp2040.pid.2=0x4026
sparkfun_promicrorp2040.vid.3=0x1b4f
sparkfun_promicrorp2040.pid.3=0x4126
sparkfun_promicrorp2040.vid.4=0x1b4f
sparkfun_promicrorp2040.pid.4=0x8026
sparkfun_promicrorp2040.vid.5=0x1b4f
sparkfun_promicrorp2040.pid.5=0x8126
sparkfun_promicrorp2040.vid.6=0x1b4f
sparkfun_promicrorp2040.pid.6=0xc026
sparkfun_promicrorp2040.vid.7=0x1b4f
sparkfun_promicrorp2040.pid.7=0xc126
sparkfun_promicrorp2040.upload_port.0.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.0.pid=0x0026
sparkfun_promicrorp2040.upload_port.1.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.1.pid=0x0126
sparkfun_promicrorp2040.upload_port.2.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.2.pid=0x4026
sparkfun_promicrorp2040.upload_port.3.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.3.pid=0x4126
sparkfun_promicrorp2040.upload_port.4.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.4.pid=0x8026
sparkfun_promicrorp2040.upload_port.5.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.5.pid=0x8126
sparkfun_promicrorp2040.upload_port.6.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.6.pid=0xc026
sparkfun_promicrorp2040.upload_port.7.vid=0x1b4f
sparkfun_promicrorp2040.upload_port.7.pid=0xc126
sparkfun_promicrorp2040.build.usbvid=-DUSBD_VID=0x1b4f
sparkfun_promicrorp2040.build.usbpid=-DUSBD_PID=0x0026
sparkfun_promicrorp2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250
sparkfun_promicrorp2040.build.board=SPARKFUN_PROMICRO_RP2040
sparkfun_promicrorp2040.build.mcu=cortex-m0plus
sparkfun_promicrorp2040.build.chip=rp2040
sparkfun_promicrorp2040.build.toolchain=arm-none-eabi
sparkfun_promicrorp2040.build.toolchainpkg=pqt-gcc
sparkfun_promicrorp2040.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
sparkfun_promicrorp2040.build.uf2family=--family rp2040
sparkfun_promicrorp2040.build.variant=sparkfun_promicrorp2040
sparkfun_promicrorp2040.upload.maximum_size=16777216
sparkfun_promicrorp2040.upload.wait_for_upload_port=true
sparkfun_promicrorp2040.upload.erase_cmd=
sparkfun_promicrorp2040.serial.disableDTR=false
sparkfun_promicrorp2040.serial.disableRTS=false
sparkfun_promicrorp2040.build.f_cpu=125000000
sparkfun_promicrorp2040.build.led=
sparkfun_promicrorp2040.build.core=rp2040
sparkfun_promicrorp2040.build.ldscript=memmap_default.ld
sparkfun_promicrorp2040.build.boot2=boot2_generic_03h_4_padded_checksum
sparkfun_promicrorp2040.build.usb_manufacturer="SparkFun"
sparkfun_promicrorp2040.build.usb_product="ProMicro RP2040"
sparkfun_promicrorp2040.menu.flash.16777216_0=16MB (no FS)
sparkfun_promicrorp2040.menu.flash.16777216_0.upload.maximum_size=16773120
sparkfun_promicrorp2040.menu.flash.16777216_0.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_0.build.flash_length=16773120
sparkfun_promicrorp2040.menu.flash.16777216_0.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_0.build.fs_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_0.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
sparkfun_promicrorp2040.menu.flash.16777216_65536.upload.maximum_size=16707584
sparkfun_promicrorp2040.menu.flash.16777216_65536.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_65536.build.flash_length=16707584
sparkfun_promicrorp2040.menu.flash.16777216_65536.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_65536.build.fs_start=285143040
sparkfun_promicrorp2040.menu.flash.16777216_65536.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
sparkfun_promicrorp2040.menu.flash.16777216_131072.upload.maximum_size=16642048
sparkfun_promicrorp2040.menu.flash.16777216_131072.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_131072.build.flash_length=16642048
sparkfun_promicrorp2040.menu.flash.16777216_131072.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_131072.build.fs_start=285077504
sparkfun_promicrorp2040.menu.flash.16777216_131072.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
sparkfun_promicrorp2040.menu.flash.16777216_262144.upload.maximum_size=16510976
sparkfun_promicrorp2040.menu.flash.16777216_262144.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_262144.build.flash_length=16510976
sparkfun_promicrorp2040.menu.flash.16777216_262144.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_262144.build.fs_start=284946432
sparkfun_promicrorp2040.menu.flash.16777216_262144.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
sparkfun_promicrorp2040.menu.flash.16777216_524288.upload.maximum_size=16248832
sparkfun_promicrorp2040.menu.flash.16777216_524288.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_524288.build.flash_length=16248832
sparkfun_promicrorp2040.menu.flash.16777216_524288.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_524288.build.fs_start=284684288
sparkfun_promicrorp2040.menu.flash.16777216_524288.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
sparkfun_promicrorp2040.menu.flash.16777216_1048576.upload.maximum_size=15724544
sparkfun_promicrorp2040.menu.flash.16777216_1048576.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_1048576.build.flash_length=15724544
sparkfun_promicrorp2040.menu.flash.16777216_1048576.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_1048576.build.fs_start=284160000
sparkfun_promicrorp2040.menu.flash.16777216_1048576.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
sparkfun_promicrorp2040.menu.flash.16777216_2097152.upload.maximum_size=14675968
sparkfun_promicrorp2040.menu.flash.16777216_2097152.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_2097152.build.flash_length=14675968
sparkfun_promicrorp2040.menu.flash.16777216_2097152.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_2097152.build.fs_start=283111424
sparkfun_promicrorp2040.menu.flash.16777216_2097152.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
sparkfun_promicrorp2040.menu.flash.16777216_3145728.upload.maximum_size=13627392
sparkfun_promicrorp2040.menu.flash.16777216_3145728.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_3145728.build.flash_length=13627392
sparkfun_promicrorp2040.menu.flash.16777216_3145728.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_3145728.build.fs_start=282062848
sparkfun_promicrorp2040.menu.flash.16777216_3145728.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
sparkfun_promicrorp2040.menu.flash.16777216_4194304.upload.maximum_size=12578816
sparkfun_promicrorp2040.menu.flash.16777216_4194304.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_4194304.build.flash_length=12578816
sparkfun_promicrorp2040.menu.flash.16777216_4194304.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_4194304.build.fs_start=281014272
sparkfun_promicrorp2040.menu.flash.16777216_4194304.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
sparkfun_promicrorp2040.menu.flash.16777216_5242880.upload.maximum_size=11530240
sparkfun_promicrorp2040.menu.flash.16777216_5242880.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_5242880.build.flash_length=11530240
sparkfun_promicrorp2040.menu.flash.16777216_5242880.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_5242880.build.fs_start=279965696
sparkfun_promicrorp2040.menu.flash.16777216_5242880.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
sparkfun_promicrorp2040.menu.flash.16777216_6291456.upload.maximum_size=10481664
sparkfun_promicrorp2040.menu.flash.16777216_6291456.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_6291456.build.flash_length=10481664
sparkfun_promicrorp2040.menu.flash.16777216_6291456.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_6291456.build.fs_start=278917120
sparkfun_promicrorp2040.menu.flash.16777216_6291456.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
sparkfun_promicrorp2040.menu.flash.16777216_7340032.upload.maximum_size=9433088
sparkfun_promicrorp2040.menu.flash.16777216_7340032.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_7340032.build.flash_length=9433088
sparkfun_promicrorp2040.menu.flash.16777216_7340032.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_7340032.build.fs_start=277868544
sparkfun_promicrorp2040.menu.flash.16777216_7340032.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
sparkfun_promicrorp2040.menu.flash.16777216_8388608.upload.maximum_size=8384512
sparkfun_promicrorp2040.menu.flash.16777216_8388608.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_8388608.build.flash_length=8384512
sparkfun_promicrorp2040.menu.flash.16777216_8388608.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_8388608.build.fs_start=276819968
sparkfun_promicrorp2040.menu.flash.16777216_8388608.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
sparkfun_promicrorp2040.menu.flash.16777216_9437184.upload.maximum_size=7335936
sparkfun_promicrorp2040.menu.flash.16777216_9437184.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_9437184.build.flash_length=7335936
sparkfun_promicrorp2040.menu.flash.16777216_9437184.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_9437184.build.fs_start=275771392
sparkfun_promicrorp2040.menu.flash.16777216_9437184.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
sparkfun_promicrorp2040.menu.flash.16777216_10485760.upload.maximum_size=6287360
sparkfun_promicrorp2040.menu.flash.16777216_10485760.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_10485760.build.flash_length=6287360
sparkfun_promicrorp2040.menu.flash.16777216_10485760.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_10485760.build.fs_start=274722816
sparkfun_promicrorp2040.menu.flash.16777216_10485760.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
sparkfun_promicrorp2040.menu.flash.16777216_11534336.upload.maximum_size=5238784
sparkfun_promicrorp2040.menu.flash.16777216_11534336.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_11534336.build.flash_length=5238784
sparkfun_promicrorp2040.menu.flash.16777216_11534336.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_11534336.build.fs_start=273674240
sparkfun_promicrorp2040.menu.flash.16777216_11534336.build.fs_end=285208576
sparkfun_promicrorp2040.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
sparkfun_promicrorp2040.menu.flash.16777216_12582912.upload.maximum_size=4190208
sparkfun_promicrorp2040.menu.flash.16777216_12582912.build.flash_total=16777216
sparkfun_promicrorp2040.menu.flash.16777216_12582912.build.flash_length=4190208
sparkfun_promicrorp2040.menu.flash.16777216_12582912.build.eeprom_start=285208576
sparkfun_promicrorp2040.menu.flash.16777216_12582912.build.fs_start=272625664
sparkfun_promicrorp2040.menu.flash.16777216_12582912.build.fs_end=285208576
