earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# SparkFun Thing Plus RP2350
# -----------------------------------
sparkfun_thingplusrp2350.name=SparkFun Thing Plus RP2350
sparkfun_thingplusrp2350.vid.0=0x1b4f
sparkfun_thingplusrp2350.pid.0=0x0038
sparkfun_thingplusrp2350.vid.1=0x1b4f
sparkfun_thingplusrp2350.pid.1=0x0138
sparkfun_thingplusrp2350.vid.2=0x1b4f
sparkfun_thingplusrp2350.pid.2=0x4038
sparkfun_thingplusrp2350.vid.3=0x1b4f
sparkfun_thingplusrp2350.pid.3=0x4138
sparkfun_thingplusrp2350.vid.4=0x1b4f
sparkfun_thingplusrp2350.pid.4=0x8038
sparkfun_thingplusrp2350.vid.5=0x1b4f
sparkfun_thingplusrp2350.pid.5=0x8138
sparkfun_thingplusrp2350.vid.6=0x1b4f
sparkfun_thingplusrp2350.pid.6=0xc038
sparkfun_thingplusrp2350.vid.7=0x1b4f
sparkfun_thingplusrp2350.pid.7=0xc138
sparkfun_thingplusrp2350.upload_port.0.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.0.pid=0x0038
sparkfun_thingplusrp2350.upload_port.1.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.1.pid=0x0138
sparkfun_thingplusrp2350.upload_port.2.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.2.pid=0x4038
sparkfun_thingplusrp2350.upload_port.3.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.3.pid=0x4138
sparkfun_thingplusrp2350.upload_port.4.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.4.pid=0x8038
sparkfun_thingplusrp2350.upload_port.5.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.5.pid=0x8138
sparkfun_thingplusrp2350.upload_port.6.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.6.pid=0xc038
sparkfun_thingplusrp2350.upload_port.7.vid=0x1b4f
sparkfun_thingplusrp2350.upload_port.7.pid=0xc138
sparkfun_thingplusrp2350.build.usbvid=-DUSBD_VID=0x1b4f
sparkfun_thingplusrp2350.build.usbpid=-DUSBD_PID=0x0038
sparkfun_thingplusrp2350.build.usbpwr=-DUSBD_MAX_POWER_MA=250
sparkfun_thingplusrp2350.build.board=SPARKFUN_THINGPLUS_RP2350
sparkfun_thingplusrp2350.build.variant=sparkfun_thingplusrp2350
sparkfun_thingplusrp2350.upload.maximum_size=16777216
sparkfun_thingplusrp2350.upload.wait_for_upload_port=true
sparkfun_thingplusrp2350.upload.erase_cmd=
sparkfun_thingplusrp2350.serial.disableDTR=false
sparkfun_thingplusrp2350.serial.disableRTS=false
sparkfun_thingplusrp2350.build.f_cpu=125000000
sparkfun_thingplusrp2350.build.led=
sparkfun_thingplusrp2350.build.core=rp2040
sparkfun_thingplusrp2350.build.ldscript=memmap_default.ld
sparkfun_thingplusrp2350.build.boot2=none
sparkfun_thingplusrp2350.build.usb_manufacturer="SparkFun"
sparkfun_thingplusrp2350.build.usb_product="Thing Plus RP2350"
sparkfun_thingplusrp2350.build.psram_length=0x800000
sparkfun_thingplusrp2350.build.extra_flags=-DPICO_CYW43_SUPPORTED=1 -DCYW43_PIN_WL_DYNAMIC=1
sparkfun_thingplusrp2350.menu.flash.16777216_0=16MB (no FS)
sparkfun_thingplusrp2350.menu.flash.16777216_0.upload.maximum_size=16769024
sparkfun_thingplusrp2350.menu.flash.16777216_0.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_0.build.flash_length=16769024
sparkfun_thingplusrp2350.menu.flash.16777216_0.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_0.build.fs_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_0.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
sparkfun_thingplusrp2350.menu.flash.16777216_65536.upload.maximum_size=16703488
sparkfun_thingplusrp2350.menu.flash.16777216_65536.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_65536.build.flash_length=16703488
sparkfun_thingplusrp2350.menu.flash.16777216_65536.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_65536.build.fs_start=285138944
sparkfun_thingplusrp2350.menu.flash.16777216_65536.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
sparkfun_thingplusrp2350.menu.flash.16777216_131072.upload.maximum_size=16637952
sparkfun_thingplusrp2350.menu.flash.16777216_131072.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_131072.build.flash_length=16637952
sparkfun_thingplusrp2350.menu.flash.16777216_131072.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_131072.build.fs_start=285073408
sparkfun_thingplusrp2350.menu.flash.16777216_131072.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
sparkfun_thingplusrp2350.menu.flash.16777216_262144.upload.maximum_size=16506880
sparkfun_thingplusrp2350.menu.flash.16777216_262144.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_262144.build.flash_length=16506880
sparkfun_thingplusrp2350.menu.flash.16777216_262144.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_262144.build.fs_start=284942336
sparkfun_thingplusrp2350.menu.flash.16777216_262144.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
sparkfun_thingplusrp2350.menu.flash.16777216_524288.upload.maximum_size=16244736
sparkfun_thingplusrp2350.menu.flash.16777216_524288.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_524288.build.flash_length=16244736
sparkfun_thingplusrp2350.menu.flash.16777216_524288.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_524288.build.fs_start=284680192
sparkfun_thingplusrp2350.menu.flash.16777216_524288.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
sparkfun_thingplusrp2350.menu.flash.16777216_1048576.upload.maximum_size=15720448
sparkfun_thingplusrp2350.menu.flash.16777216_1048576.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_1048576.build.flash_length=15720448
sparkfun_thingplusrp2350.menu.flash.16777216_1048576.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_1048576.build.fs_start=284155904
sparkfun_thingplusrp2350.menu.flash.16777216_1048576.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
sparkfun_thingplusrp2350.menu.flash.16777216_2097152.upload.maximum_size=14671872
sparkfun_thingplusrp2350.menu.flash.16777216_2097152.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_2097152.build.flash_length=14671872
sparkfun_thingplusrp2350.menu.flash.16777216_2097152.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_2097152.build.fs_start=283107328
sparkfun_thingplusrp2350.menu.flash.16777216_2097152.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
sparkfun_thingplusrp2350.menu.flash.16777216_3145728.upload.maximum_size=13623296
sparkfun_thingplusrp2350.menu.flash.16777216_3145728.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_3145728.build.flash_length=13623296
sparkfun_thingplusrp2350.menu.flash.16777216_3145728.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_3145728.build.fs_start=282058752
sparkfun_thingplusrp2350.menu.flash.16777216_3145728.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
sparkfun_thingplusrp2350.menu.flash.16777216_4194304.upload.maximum_size=12574720
sparkfun_thingplusrp2350.menu.flash.16777216_4194304.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_4194304.build.flash_length=12574720
sparkfun_thingplusrp2350.menu.flash.16777216_4194304.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_4194304.build.fs_start=281010176
sparkfun_thingplusrp2350.menu.flash.16777216_4194304.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
sparkfun_thingplusrp2350.menu.flash.16777216_5242880.upload.maximum_size=11526144
sparkfun_thingplusrp2350.menu.flash.16777216_5242880.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_5242880.build.flash_length=11526144
sparkfun_thingplusrp2350.menu.flash.16777216_5242880.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_5242880.build.fs_start=279961600
sparkfun_thingplusrp2350.menu.flash.16777216_5242880.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
sparkfun_thingplusrp2350.menu.flash.16777216_6291456.upload.maximum_size=10477568
sparkfun_thingplusrp2350.menu.flash.16777216_6291456.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_6291456.build.flash_length=10477568
sparkfun_thingplusrp2350.menu.flash.16777216_6291456.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_6291456.build.fs_start=278913024
sparkfun_thingplusrp2350.menu.flash.16777216_6291456.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
sparkfun_thingplusrp2350.menu.flash.16777216_7340032.upload.maximum_size=9428992
sparkfun_thingplusrp2350.menu.flash.16777216_7340032.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_7340032.build.flash_length=9428992
sparkfun_thingplusrp2350.menu.flash.16777216_7340032.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_7340032.build.fs_start=277864448
sparkfun_thingplusrp2350.menu.flash.16777216_7340032.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
sparkfun_thingplusrp2350.menu.flash.16777216_8388608.upload.maximum_size=8380416
sparkfun_thingplusrp2350.menu.flash.16777216_8388608.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_8388608.build.flash_length=8380416
sparkfun_thingplusrp2350.menu.flash.16777216_8388608.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_8388608.build.fs_start=276815872
sparkfun_thingplusrp2350.menu.flash.16777216_8388608.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
sparkfun_thingplusrp2350.menu.flash.16777216_9437184.upload.maximum_size=7331840
sparkfun_thingplusrp2350.menu.flash.16777216_9437184.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_9437184.build.flash_length=7331840
sparkfun_thingplusrp2350.menu.flash.16777216_9437184.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_9437184.build.fs_start=275767296
sparkfun_thingplusrp2350.menu.flash.16777216_9437184.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
sparkfun_thingplusrp2350.menu.flash.16777216_10485760.upload.maximum_size=6283264
sparkfun_thingplusrp2350.menu.flash.16777216_10485760.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_10485760.build.flash_length=6283264
sparkfun_thingplusrp2350.menu.flash.16777216_10485760.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_10485760.build.fs_start=274718720
sparkfun_thingplusrp2350.menu.flash.16777216_10485760.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
sparkfun_thingplusrp2350.menu.flash.16777216_11534336.upload.maximum_size=5234688
sparkfun_thingplusrp2350.menu.flash.16777216_11534336.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_11534336.build.flash_length=5234688
sparkfun_thingplusrp2350.menu.flash.16777216_11534336.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_11534336.build.fs_start=273670144
sparkfun_thingplusrp2350.menu.flash.16777216_11534336.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
sparkfun_thingplusrp2350.menu.flash.16777216_12582912.upload.maximum_size=4186112
sparkfun_thingplusrp2350.menu.flash.16777216_12582912.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_12582912.build.flash_length=4186112
sparkfun_thingplusrp2350.menu.flash.16777216_12582912.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_12582912.build.fs_start=272621568
sparkfun_thingplusrp2350.menu.flash.16777216_12582912.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
sparkfun_thingplusrp2350.menu.flash.16777216_13631488.upload.maximum_size=3137536
sparkfun_thingplusrp2350.menu.flash.16777216_13631488.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_13631488.build.flash_length=3137536
sparkfun_thingplusrp2350.menu.flash.16777216_13631488.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_13631488.build.fs_start=271572992
sparkfun_thingplusrp2350.menu.flash.16777216_13631488.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
sparkfun_thingplusrp2350.menu.flash.16777216_14680064.upload.maximum_size=2088960
sparkfun_thingplusrp2350.menu.flash.16777216_14680064.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_14680064.build.flash_length=2088960
sparkfun_thingplusrp2350.menu.flash.16777216_14680064.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_14680064.build.fs_start=270524416
sparkfun_thingplusrp2350.menu.flash.16777216_14680064.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
sparkfun_thingplusrp2350.menu.flash.16777216_15728640.upload.maximum_size=1040384
sparkfun_thingplusrp2350.menu.flash.16777216_15728640.build.flash_total=16777216
sparkfun_thingplusrp2350.menu.flash.16777216_15728640.build.flash_length=1040384
sparkfun_thingplusrp2350.menu.flash.16777216_15728640.build.eeprom_start=285204480
sparkfun_thingplusrp2350.menu.flash.16777216_15728640.build.fs_start=269475840
sparkfun_thingplusrp2350.menu.flash.16777216_15728640.build.fs_end=285204480
sparkfun_thingplusrp2350.menu.arch.arm=ARM
sparkfun_thingplusrp2350.menu.arch.arm.build.chip=rp2350
sparkfun_thingplusrp2350.menu.arch.arm.build.toolchain=arm-none-eabi
sparkfun_thingplusrp2350.menu.arch.arm.build.toolchainpkg=pqt-gcc
sparkfun_thingplusrp2350.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
sparkfun_thingplusrp2350.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
sparkfun_thingplusrp2350.menu.arch.arm.build.mcu=cortex-m33
sparkfun_thingplusrp2350.menu.arch.riscv=RISC-V
sparkfun_thingplusrp2350.menu.arch.riscv.build.chip=rp2350-riscv
sparkfun_thingplusrp2350.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
sparkfun_thingplusrp2350.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
sparkfun_thingplusrp2350.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
sparkfun_thingplusrp2350.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
sparkfun_thingplusrp2350.menu.arch.riscv.build.mcu=rv32imac
sparkfun_thingplusrp2350.menu.freq.150=150 MHz
sparkfun_thingplusrp2350.menu.freq.150.build.f_cpu=150000000L
sparkfun_thingplusrp2350.menu.freq.50=50 MHz
sparkfun_thingplusrp2350.menu.freq.50.build.f_cpu=50000000L
sparkfun_thingplusrp2350.menu.freq.100=100 MHz
sparkfun_thingplusrp2350.menu.freq.100.build.f_cpu=100000000L
sparkfun_thingplusrp2350.menu.freq.120=120 MHz
sparkfun_thingplusrp2350.menu.freq.120.build.f_cpu=120000000L
sparkfun_thingplusrp2350.menu.freq.125=125 MHz
sparkfun_thingplusrp2350.menu.freq.125.build.f_cpu=125000000L
sparkfun_thingplusrp2350.menu.freq.128=128 MHz
sparkfun_thingplusrp2350.menu.freq.128.build.f_cpu=128000000L
sparkfun_thingplusrp2350.menu.freq.133=133 MHz
sparkfun_thingplusrp2350.menu.freq.133.build.f_cpu=133000000L
sparkfun_thingplusrp2350.menu.freq.176=176 MHz (Overclock)
sparkfun_thingplusrp2350.menu.freq.176.build.f_cpu=176000000L
sparkfun_thingplusrp2350.menu.freq.200=200 MHz (Overclock)
sparkfun_thingplusrp2350.menu.freq.200.build.f_cpu=200000000L
sparkfun_thingplusrp2350.menu.freq.225=225 MHz (Overclock)
sparkfun_thingplusrp2350.menu.freq.225.build.f_cpu=225000000L
sparkfun_thingplusrp2350.menu.freq.240=240 MHz (Overclock)
sparkfun_thingplusrp2350.menu.freq.240.build.f_cpu=240000000L
sparkfun_thingplusrp2350.menu.freq.250=250 MHz (Overclock)
sparkfun_thingplusrp2350.menu.freq.250.build.f_cpu=250000000L
sparkfun_thingplusrp2350.menu.freq.276=276 MHz (Overclock)
sparkfun_thingplusrp2350.menu.freq.276.build.f_cpu=276000000L
sparkfun_thingplusrp2350.menu.freq.300=300 MHz (Overclock)
sparkfun_thingplusrp2350.menu.freq.300.build.f_cpu=300000000L
sparkfun_thingplusrp2350.menu.opt.Small=Small (-Os) (standard)
sparkfun_thingplusrp2350.menu.opt.Small.build.flags.optimize=-Os
sparkfun_thingplusrp2350.menu.opt.Optimize=Optimize (-O)
sparkfun_thingplusrp2350.menu.opt.Optimize.build.flags.optimize=-O
sparkfun_thingplusrp2350.menu.opt.Optimize2=Optimize More (-O2)
sparkfun_thingplusrp2350.menu.opt.Optimize2.build.flags.optimize=-O2
sparkfun_thingplusrp2350.menu.opt.Optimize3=Optimize Even More (-O3)
sparkfun_thingplusrp2350.menu.opt.Optimize3.build.flags.optimize=-O3
sparkfun_thingplusrp2350.menu.opt.Fast=Fast (-Ofast) (maybe slower)
sparkfun_thingplusrp2350.menu.opt.Fast.build.flags.optimize=-Ofast
sparkfun_thingplusrp2350.menu.opt.Debug=Debug (-Og)
sparkfun_thingplusrp2350.menu.opt.Debug.build.flags.optimize=-Og
sparkfun_thingplusrp2350.menu.opt.Disabled=Disabled (-O0)
sparkfun_thingplusrp2350.menu.opt.Disabled.build.flags.optimize=-O0
sparkfun_thingplusrp2350.menu.profile.Disabled=Disabled
sparkfun_thingplusrp2350.menu.profile.Disabled.build.flags.profile=
sparkfun_thingplusrp2350.menu.profile.Enabled=Enabled
sparkfun_thingplusrp2350.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
sparkfun_thingplusrp2350.menu.rtti.Disabled=Disabled
sparkfun_thingplusrp2350.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
sparkfun_thingplusrp2350.menu.rtti.Enabled=Enabled
sparkfun_thingplusrp2350.menu.rtti.Enabled.build.flags.rtti=
sparkfun_thingplusrp2350.menu.stackprotect.Disabled=Disabled
sparkfun_thingplusrp2350.menu.stackprotect.Disabled.build.flags.stackprotect=
