earlephilhower/arduino-pico/boards.txt
sparkfun_thingplusrp2350.menu.stackprotect.Enabled=Enabled
sparkfun_thingplusrp2350.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
sparkfun_thingplusrp2350.menu.exceptions.Disabled=Disabled
sparkfun_thingplusrp2350.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
sparkfun_thingplusrp2350.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
sparkfun_thingplusrp2350.menu.exceptions.Enabled=Enabled
sparkfun_thingplusrp2350.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
sparkfun_thingplusrp2350.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
sparkfun_thingplusrp2350.menu.dbgport.Disabled=Disabled
sparkfun_thingplusrp2350.menu.dbgport.Disabled.build.debug_port=
sparkfun_thingplusrp2350.menu.dbgport.Serial=Serial
sparkfun_thingplusrp2350.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
sparkfun_thingplusrp2350.menu.dbgport.Serial1=Serial1
sparkfun_thingplusrp2350.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
sparkfun_thingplusrp2350.menu.dbgport.Serial2=Serial2
sparkfun_thingplusrp2350.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sparkfun_thingplusrp2350.menu.dbgport.SerialSemi=SerialSemi
sparkfun_thingplusrp2350.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
sparkfun_thingplusrp2350.menu.dbglvl.None=None
sparkfun_thingplusrp2350.menu.dbglvl.None.build.debug_level=
sparkfun_thingplusrp2350.menu.dbglvl.Core=Core
sparkfun_thingplusrp2350.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sparkfun_thingplusrp2350.menu.dbglvl.SPI=SPI
sparkfun_thingplusrp2350.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sparkfun_thingplusrp2350.menu.dbglvl.Wire=Wire
sparkfun_thingplusrp2350.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sparkfun_thingplusrp2350.menu.dbglvl.Bluetooth=Bluetooth
sparkfun_thingplusrp2350.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
sparkfun_thingplusrp2350.menu.dbglvl.All=All
sparkfun_thingplusrp2350.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
sparkfun_thingplusrp2350.menu.dbglvl.NDEBUG=NDEBUG
sparkfun_thingplusrp2350.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sparkfun_thingplusrp2350.menu.usbstack.picosdk=Pico SDK
sparkfun_thingplusrp2350.menu.usbstack.picosdk.build.usbstack_flags=
sparkfun_thingplusrp2350.menu.usbstack.tinyusb=Adafruit TinyUSB
sparkfun_thingplusrp2350.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_thingplusrp2350.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
sparkfun_thingplusrp2350.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_thingplusrp2350.menu.usbstack.nousb=No USB
sparkfun_thingplusrp2350.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
sparkfun_thingplusrp2350.menu.wificountry.worldwide=Worldwide
sparkfun_thingplusrp2350.menu.wificountry.worldwide.build.wificc=-DWIFICC=CYW43_COUNTRY_WORLDWIDE
sparkfun_thingplusrp2350.menu.wificountry.australia=Australia
sparkfun_thingplusrp2350.menu.wificountry.australia.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRALIA
sparkfun_thingplusrp2350.menu.wificountry.austria=Austria
sparkfun_thingplusrp2350.menu.wificountry.austria.build.wificc=-DWIFICC=CYW43_COUNTRY_AUSTRIA
sparkfun_thingplusrp2350.menu.wificountry.belgium=Belgium
sparkfun_thingplusrp2350.menu.wificountry.belgium.build.wificc=-DWIFICC=CYW43_COUNTRY_BELGIUM
sparkfun_thingplusrp2350.menu.wificountry.brazil=Brazil
sparkfun_thingplusrp2350.menu.wificountry.brazil.build.wificc=-DWIFICC=CYW43_COUNTRY_BRAZIL
sparkfun_thingplusrp2350.menu.wificountry.canada=Canada
sparkfun_thingplusrp2350.menu.wificountry.canada.build.wificc=-DWIFICC=CYW43_COUNTRY_CANADA
sparkfun_thingplusrp2350.menu.wificountry.chile=Chile
sparkfun_thingplusrp2350.menu.wificountry.chile.build.wificc=-DWIFICC=CYW43_COUNTRY_CHILE
sparkfun_thingplusrp2350.menu.wificountry.china=China
sparkfun_thingplusrp2350.menu.wificountry.china.build.wificc=-DWIFICC=CYW43_COUNTRY_CHINA
sparkfun_thingplusrp2350.menu.wificountry.colombia=Colombia
sparkfun_thingplusrp2350.menu.wificountry.colombia.build.wificc=-DWIFICC=CYW43_COUNTRY_COLOMBIA
sparkfun_thingplusrp2350.menu.wificountry.czech_republic=Czech Republic
sparkfun_thingplusrp2350.menu.wificountry.czech_republic.build.wificc=-DWIFICC=CYW43_COUNTRY_CZECH_REPUBLIC
sparkfun_thingplusrp2350.menu.wificountry.denmark=Denmark
sparkfun_thingplusrp2350.menu.wificountry.denmark.build.wificc=-DWIFICC=CYW43_COUNTRY_DENMARK
sparkfun_thingplusrp2350.menu.wificountry.estonia=Estonia
sparkfun_thingplusrp2350.menu.wificountry.estonia.build.wificc=-DWIFICC=CYW43_COUNTRY_ESTONIA
sparkfun_thingplusrp2350.menu.wificountry.finland=Finland
sparkfun_thingplusrp2350.menu.wificountry.finland.build.wificc=-DWIFICC=CYW43_COUNTRY_FINLAND
sparkfun_thingplusrp2350.menu.wificountry.france=France
sparkfun_thingplusrp2350.menu.wificountry.france.build.wificc=-DWIFICC=CYW43_COUNTRY_FRANCE
sparkfun_thingplusrp2350.menu.wificountry.germany=Germany
sparkfun_thingplusrp2350.menu.wificountry.germany.build.wificc=-DWIFICC=CYW43_COUNTRY_GERMANY
sparkfun_thingplusrp2350.menu.wificountry.greece=Greece
sparkfun_thingplusrp2350.menu.wificountry.greece.build.wificc=-DWIFICC=CYW43_COUNTRY_GREECE
sparkfun_thingplusrp2350.menu.wificountry.hong_kong=Hong Kong
sparkfun_thingplusrp2350.menu.wificountry.hong_kong.build.wificc=-DWIFICC=CYW43_COUNTRY_HONG_KONG
sparkfun_thingplusrp2350.menu.wificountry.hungary=Hungary
sparkfun_thingplusrp2350.menu.wificountry.hungary.build.wificc=-DWIFICC=CYW43_COUNTRY_HUNGARY
sparkfun_thingplusrp2350.menu.wificountry.iceland=Iceland
sparkfun_thingplusrp2350.menu.wificountry.iceland.build.wificc=-DWIFICC=CYW43_COUNTRY_ICELAND
sparkfun_thingplusrp2350.menu.wificountry.india=India
sparkfun_thingplusrp2350.menu.wificountry.india.build.wificc=-DWIFICC=CYW43_COUNTRY_INDIA
sparkfun_thingplusrp2350.menu.wificountry.israel=Israel
sparkfun_thingplusrp2350.menu.wificountry.israel.build.wificc=-DWIFICC=CYW43_COUNTRY_ISRAEL
sparkfun_thingplusrp2350.menu.wificountry.italy=Italy
sparkfun_thingplusrp2350.menu.wificountry.italy.build.wificc=-DWIFICC=CYW43_COUNTRY_ITALY
sparkfun_thingplusrp2350.menu.wificountry.japan=Japan
sparkfun_thingplusrp2350.menu.wificountry.japan.build.wificc=-DWIFICC=CYW43_COUNTRY_JAPAN
sparkfun_thingplusrp2350.menu.wificountry.kenya=Kenya
sparkfun_thingplusrp2350.menu.wificountry.kenya.build.wificc=-DWIFICC=CYW43_COUNTRY_KENYA
sparkfun_thingplusrp2350.menu.wificountry.latvia=Latvia
sparkfun_thingplusrp2350.menu.wificountry.latvia.build.wificc=-DWIFICC=CYW43_COUNTRY_LATVIA
sparkfun_thingplusrp2350.menu.wificountry.liechtenstein=Liechtenstein
sparkfun_thingplusrp2350.menu.wificountry.liechtenstein.build.wificc=-DWIFICC=CYW43_COUNTRY_LIECHTENSTEIN
sparkfun_thingplusrp2350.menu.wificountry.lithuania=Lithuania
sparkfun_thingplusrp2350.menu.wificountry.lithuania.build.wificc=-DWIFICC=CYW43_COUNTRY_LITHUANIA
sparkfun_thingplusrp2350.menu.wificountry.luxembourg=Luxembourg
sparkfun_thingplusrp2350.menu.wificountry.luxembourg.build.wificc=-DWIFICC=CYW43_COUNTRY_LUXEMBOURG
sparkfun_thingplusrp2350.menu.wificountry.malaysia=Malaysia
sparkfun_thingplusrp2350.menu.wificountry.malaysia.build.wificc=-DWIFICC=CYW43_COUNTRY_MALAYSIA
sparkfun_thingplusrp2350.menu.wificountry.malta=Malta
sparkfun_thingplusrp2350.menu.wificountry.malta.build.wificc=-DWIFICC=CYW43_COUNTRY_MALTA
sparkfun_thingplusrp2350.menu.wificountry.mexico=Mexico
sparkfun_thingplusrp2350.menu.wificountry.mexico.build.wificc=-DWIFICC=CYW43_COUNTRY_MEXICO
sparkfun_thingplusrp2350.menu.wificountry.netherlands=Netherlands
sparkfun_thingplusrp2350.menu.wificountry.netherlands.build.wificc=-DWIFICC=CYW43_COUNTRY_NETHERLANDS
sparkfun_thingplusrp2350.menu.wificountry.new_zealand=New Zealand
sparkfun_thingplusrp2350.menu.wificountry.new_zealand.build.wificc=-DWIFICC=CYW43_COUNTRY_NEW_ZEALAND
sparkfun_thingplusrp2350.menu.wificountry.nigeria=Nigeria
sparkfun_thingplusrp2350.menu.wificountry.nigeria.build.wificc=-DWIFICC=CYW43_COUNTRY_NIGERIA
sparkfun_thingplusrp2350.menu.wificountry.norway=Norway
sparkfun_thingplusrp2350.menu.wificountry.norway.build.wificc=-DWIFICC=CYW43_COUNTRY_NORWAY
sparkfun_thingplusrp2350.menu.wificountry.peru=Peru
sparkfun_thingplusrp2350.menu.wificountry.peru.build.wificc=-DWIFICC=CYW43_COUNTRY_PERU
sparkfun_thingplusrp2350.menu.wificountry.philippines=Philippines
sparkfun_thingplusrp2350.menu.wificountry.philippines.build.wificc=-DWIFICC=CYW43_COUNTRY_PHILIPPINES
sparkfun_thingplusrp2350.menu.wificountry.poland=Poland
sparkfun_thingplusrp2350.menu.wificountry.poland.build.wificc=-DWIFICC=CYW43_COUNTRY_POLAND
sparkfun_thingplusrp2350.menu.wificountry.portugal=Portugal
sparkfun_thingplusrp2350.menu.wificountry.portugal.build.wificc=-DWIFICC=CYW43_COUNTRY_PORTUGAL
sparkfun_thingplusrp2350.menu.wificountry.singapore=Singapore
sparkfun_thingplusrp2350.menu.wificountry.singapore.build.wificc=-DWIFICC=CYW43_COUNTRY_SINGAPORE
sparkfun_thingplusrp2350.menu.wificountry.slovakia=Slovakia
sparkfun_thingplusrp2350.menu.wificountry.slovakia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVAKIA
sparkfun_thingplusrp2350.menu.wificountry.slovenia=Slovenia
sparkfun_thingplusrp2350.menu.wificountry.slovenia.build.wificc=-DWIFICC=CYW43_COUNTRY_SLOVENIA
sparkfun_thingplusrp2350.menu.wificountry.south_africa=South Africa
sparkfun_thingplusrp2350.menu.wificountry.south_africa.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_AFRICA
sparkfun_thingplusrp2350.menu.wificountry.south_korea=South Korea
sparkfun_thingplusrp2350.menu.wificountry.south_korea.build.wificc=-DWIFICC=CYW43_COUNTRY_SOUTH_KOREA
sparkfun_thingplusrp2350.menu.wificountry.spain=Spain
sparkfun_thingplusrp2350.menu.wificountry.spain.build.wificc=-DWIFICC=CYW43_COUNTRY_SPAIN
sparkfun_thingplusrp2350.menu.wificountry.sweden=Sweden
sparkfun_thingplusrp2350.menu.wificountry.sweden.build.wificc=-DWIFICC=CYW43_COUNTRY_SWEDEN
sparkfun_thingplusrp2350.menu.wificountry.switzerland=Switzerland
sparkfun_thingplusrp2350.menu.wificountry.switzerland.build.wificc=-DWIFICC=CYW43_COUNTRY_SWITZERLAND
sparkfun_thingplusrp2350.menu.wificountry.taiwan=Taiwan
sparkfun_thingplusrp2350.menu.wificountry.taiwan.build.wificc=-DWIFICC=CYW43_COUNTRY_TAIWAN
sparkfun_thingplusrp2350.menu.wificountry.thailand=Thailand
sparkfun_thingplusrp2350.menu.wificountry.thailand.build.wificc=-DWIFICC=CYW43_COUNTRY_THAILAND
sparkfun_thingplusrp2350.menu.wificountry.turkey=Turkey
sparkfun_thingplusrp2350.menu.wificountry.turkey.build.wificc=-DWIFICC=CYW43_COUNTRY_TURKEY
sparkfun_thingplusrp2350.menu.wificountry.uk=UK
sparkfun_thingplusrp2350.menu.wificountry.uk.build.wificc=-DWIFICC=CYW43_COUNTRY_UK
sparkfun_thingplusrp2350.menu.wificountry.usa=USA
sparkfun_thingplusrp2350.menu.wificountry.usa.build.wificc=-DWIFICC=CYW43_COUNTRY_USA
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4only=IPv4 Only
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
sparkfun_thingplusrp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_thingplusrp2350.menu.uploadmethod.default=Default (UF2)
sparkfun_thingplusrp2350.menu.uploadmethod.default.build.ram_length=512k
sparkfun_thingplusrp2350.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_thingplusrp2350.menu.uploadmethod.default.upload.maximum_data_size=524288
sparkfun_thingplusrp2350.menu.uploadmethod.default.upload.tool=uf2conv
sparkfun_thingplusrp2350.menu.uploadmethod.default.upload.tool.default=uf2conv
sparkfun_thingplusrp2350.menu.uploadmethod.default.upload.tool.network=uf2conv-network
sparkfun_thingplusrp2350.menu.uploadmethod.picotool=Picotool
sparkfun_thingplusrp2350.menu.uploadmethod.picotool.build.ram_length=512k
sparkfun_thingplusrp2350.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
sparkfun_thingplusrp2350.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
sparkfun_thingplusrp2350.menu.uploadmethod.picotool.upload.maximum_data_size=524288
sparkfun_thingplusrp2350.menu.uploadmethod.picotool.upload.tool=picotool
sparkfun_thingplusrp2350.menu.uploadmethod.picotool.upload.tool.default=picotool
sparkfun_thingplusrp2350.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
sparkfun_thingplusrp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
sparkfun_thingplusrp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_thingplusrp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
sparkfun_thingplusrp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
sparkfun_thingplusrp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

