earlephilhower/arduino-pico/boards.txt
sparkfun_iotnode_lorawanrp2350.menu.opt.Optimize.build.flags.optimize=-O
sparkfun_iotnode_lorawanrp2350.menu.opt.Optimize2=Optimize More (-O2)
sparkfun_iotnode_lorawanrp2350.menu.opt.Optimize2.build.flags.optimize=-O2
sparkfun_iotnode_lorawanrp2350.menu.opt.Optimize3=Optimize Even More (-O3)
sparkfun_iotnode_lorawanrp2350.menu.opt.Optimize3.build.flags.optimize=-O3
sparkfun_iotnode_lorawanrp2350.menu.opt.Fast=Fast (-Ofast) (maybe slower)
sparkfun_iotnode_lorawanrp2350.menu.opt.Fast.build.flags.optimize=-Ofast
sparkfun_iotnode_lorawanrp2350.menu.opt.Debug=Debug (-Og)
sparkfun_iotnode_lorawanrp2350.menu.opt.Debug.build.flags.optimize=-Og
sparkfun_iotnode_lorawanrp2350.menu.opt.Disabled=Disabled (-O0)
sparkfun_iotnode_lorawanrp2350.menu.opt.Disabled.build.flags.optimize=-O0
sparkfun_iotnode_lorawanrp2350.menu.profile.Disabled=Disabled
sparkfun_iotnode_lorawanrp2350.menu.profile.Disabled.build.flags.profile=
sparkfun_iotnode_lorawanrp2350.menu.profile.Enabled=Enabled
sparkfun_iotnode_lorawanrp2350.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
sparkfun_iotnode_lorawanrp2350.menu.rtti.Disabled=Disabled
sparkfun_iotnode_lorawanrp2350.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
sparkfun_iotnode_lorawanrp2350.menu.rtti.Enabled=Enabled
sparkfun_iotnode_lorawanrp2350.menu.rtti.Enabled.build.flags.rtti=
sparkfun_iotnode_lorawanrp2350.menu.stackprotect.Disabled=Disabled
sparkfun_iotnode_lorawanrp2350.menu.stackprotect.Disabled.build.flags.stackprotect=
sparkfun_iotnode_lorawanrp2350.menu.stackprotect.Enabled=Enabled
sparkfun_iotnode_lorawanrp2350.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
sparkfun_iotnode_lorawanrp2350.menu.exceptions.Disabled=Disabled
sparkfun_iotnode_lorawanrp2350.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
sparkfun_iotnode_lorawanrp2350.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
sparkfun_iotnode_lorawanrp2350.menu.exceptions.Enabled=Enabled
sparkfun_iotnode_lorawanrp2350.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
sparkfun_iotnode_lorawanrp2350.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Disabled=Disabled
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Disabled.build.debug_port=
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Serial=Serial
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Serial1=Serial1
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Serial2=Serial2
sparkfun_iotnode_lorawanrp2350.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sparkfun_iotnode_lorawanrp2350.menu.dbgport.SerialSemi=SerialSemi
sparkfun_iotnode_lorawanrp2350.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.None=None
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.None.build.debug_level=
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.Core=Core
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.SPI=SPI
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.Wire=Wire
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.Bluetooth=Bluetooth
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.All=All
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.NDEBUG=NDEBUG
sparkfun_iotnode_lorawanrp2350.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sparkfun_iotnode_lorawanrp2350.menu.usbstack.picosdk=Pico SDK
sparkfun_iotnode_lorawanrp2350.menu.usbstack.picosdk.build.usbstack_flags=
sparkfun_iotnode_lorawanrp2350.menu.usbstack.tinyusb=Adafruit TinyUSB
sparkfun_iotnode_lorawanrp2350.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_iotnode_lorawanrp2350.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
sparkfun_iotnode_lorawanrp2350.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_iotnode_lorawanrp2350.menu.usbstack.nousb=No USB
sparkfun_iotnode_lorawanrp2350.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4only=IPv4 Only
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
sparkfun_iotnode_lorawanrp2350.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.default=Default (UF2)
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.default.build.ram_length=512k
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.default.upload.maximum_data_size=524288
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.default.upload.tool=uf2conv
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.default.upload.tool.default=uf2conv
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.default.upload.tool.network=uf2conv-network
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picotool=Picotool
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picotool.build.ram_length=512k
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picotool.upload.maximum_data_size=524288
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picotool.upload.tool=picotool
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picotool.upload.tool.default=picotool
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
sparkfun_iotnode_lorawanrp2350.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

