earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# SparkFun XRP Controller (Beta)
# -----------------------------------
sparkfun_xrp_controller_beta.name=SparkFun XRP Controller (Beta)
sparkfun_xrp_controller_beta.vid.0=0x1b4f
sparkfun_xrp_controller_beta.pid.0=0x0045
sparkfun_xrp_controller_beta.vid.1=0x1b4f
sparkfun_xrp_controller_beta.pid.1=0x0145
sparkfun_xrp_controller_beta.vid.2=0x1b4f
sparkfun_xrp_controller_beta.pid.2=0x4045
sparkfun_xrp_controller_beta.vid.3=0x1b4f
sparkfun_xrp_controller_beta.pid.3=0x4145
sparkfun_xrp_controller_beta.vid.4=0x1b4f
sparkfun_xrp_controller_beta.pid.4=0x8045
sparkfun_xrp_controller_beta.vid.5=0x1b4f
sparkfun_xrp_controller_beta.pid.5=0x8145
sparkfun_xrp_controller_beta.vid.6=0x1b4f
sparkfun_xrp_controller_beta.pid.6=0xc045
sparkfun_xrp_controller_beta.vid.7=0x1b4f
sparkfun_xrp_controller_beta.pid.7=0xc145
sparkfun_xrp_controller_beta.upload_port.0.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.0.pid=0x0045
sparkfun_xrp_controller_beta.upload_port.1.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.1.pid=0x0145
sparkfun_xrp_controller_beta.upload_port.2.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.2.pid=0x4045
sparkfun_xrp_controller_beta.upload_port.3.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.3.pid=0x4145
sparkfun_xrp_controller_beta.upload_port.4.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.4.pid=0x8045
sparkfun_xrp_controller_beta.upload_port.5.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.5.pid=0x8145
sparkfun_xrp_controller_beta.upload_port.6.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.6.pid=0xc045
sparkfun_xrp_controller_beta.upload_port.7.vid=0x1b4f
sparkfun_xrp_controller_beta.upload_port.7.pid=0xc145
sparkfun_xrp_controller_beta.build.usbvid=-DUSBD_VID=0x1b4f
sparkfun_xrp_controller_beta.build.usbpid=-DUSBD_PID=0x0045
sparkfun_xrp_controller_beta.build.usbpwr=-DUSBD_MAX_POWER_MA=250
sparkfun_xrp_controller_beta.build.board=SPARKFUN_XRP_CONTROLLER_BETA
sparkfun_xrp_controller_beta.build.mcu=cortex-m0plus
sparkfun_xrp_controller_beta.build.chip=rp2040
sparkfun_xrp_controller_beta.build.toolchain=arm-none-eabi
sparkfun_xrp_controller_beta.build.toolchainpkg=pqt-gcc
sparkfun_xrp_controller_beta.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
sparkfun_xrp_controller_beta.build.uf2family=--family rp2040
sparkfun_xrp_controller_beta.build.variant=sparkfun_xrp_controller_beta
sparkfun_xrp_controller_beta.upload.maximum_size=2097152
sparkfun_xrp_controller_beta.upload.wait_for_upload_port=true
sparkfun_xrp_controller_beta.upload.erase_cmd=
sparkfun_xrp_controller_beta.serial.disableDTR=false
sparkfun_xrp_controller_beta.serial.disableRTS=false
sparkfun_xrp_controller_beta.build.f_cpu=125000000
sparkfun_xrp_controller_beta.build.led=
sparkfun_xrp_controller_beta.build.core=rp2040
sparkfun_xrp_controller_beta.build.ldscript=memmap_default.ld
sparkfun_xrp_controller_beta.build.boot2=boot2_w25q080_2_padded_checksum
sparkfun_xrp_controller_beta.build.usb_manufacturer="SparkFun"
sparkfun_xrp_controller_beta.build.usb_product="XRP Controller (Beta)"
sparkfun_xrp_controller_beta.build.extra_flags=-DPICO_CYW43_SUPPORTED=1 -DCYW43_PIN_WL_DYNAMIC=1
sparkfun_xrp_controller_beta.menu.flash.2097152_0=2MB (no FS)
sparkfun_xrp_controller_beta.menu.flash.2097152_0.upload.maximum_size=2093056
sparkfun_xrp_controller_beta.menu.flash.2097152_0.build.flash_total=2097152
sparkfun_xrp_controller_beta.menu.flash.2097152_0.build.flash_length=2093056
sparkfun_xrp_controller_beta.menu.flash.2097152_0.build.eeprom_start=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_0.build.fs_start=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_0.build.fs_end=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
sparkfun_xrp_controller_beta.menu.flash.2097152_65536.upload.maximum_size=2027520
sparkfun_xrp_controller_beta.menu.flash.2097152_65536.build.flash_total=2097152
sparkfun_xrp_controller_beta.menu.flash.2097152_65536.build.flash_length=2027520
sparkfun_xrp_controller_beta.menu.flash.2097152_65536.build.eeprom_start=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_65536.build.fs_start=270462976
sparkfun_xrp_controller_beta.menu.flash.2097152_65536.build.fs_end=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
sparkfun_xrp_controller_beta.menu.flash.2097152_131072.upload.maximum_size=1961984
sparkfun_xrp_controller_beta.menu.flash.2097152_131072.build.flash_total=2097152
sparkfun_xrp_controller_beta.menu.flash.2097152_131072.build.flash_length=1961984
sparkfun_xrp_controller_beta.menu.flash.2097152_131072.build.eeprom_start=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_131072.build.fs_start=270397440
sparkfun_xrp_controller_beta.menu.flash.2097152_131072.build.fs_end=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
sparkfun_xrp_controller_beta.menu.flash.2097152_262144.upload.maximum_size=1830912
sparkfun_xrp_controller_beta.menu.flash.2097152_262144.build.flash_total=2097152
sparkfun_xrp_controller_beta.menu.flash.2097152_262144.build.flash_length=1830912
sparkfun_xrp_controller_beta.menu.flash.2097152_262144.build.eeprom_start=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_262144.build.fs_start=270266368
sparkfun_xrp_controller_beta.menu.flash.2097152_262144.build.fs_end=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
sparkfun_xrp_controller_beta.menu.flash.2097152_524288.upload.maximum_size=1568768
sparkfun_xrp_controller_beta.menu.flash.2097152_524288.build.flash_total=2097152
sparkfun_xrp_controller_beta.menu.flash.2097152_524288.build.flash_length=1568768
sparkfun_xrp_controller_beta.menu.flash.2097152_524288.build.eeprom_start=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_524288.build.fs_start=270004224
sparkfun_xrp_controller_beta.menu.flash.2097152_524288.build.fs_end=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
sparkfun_xrp_controller_beta.menu.flash.2097152_1048576.upload.maximum_size=1044480
sparkfun_xrp_controller_beta.menu.flash.2097152_1048576.build.flash_total=2097152
sparkfun_xrp_controller_beta.menu.flash.2097152_1048576.build.flash_length=1044480
sparkfun_xrp_controller_beta.menu.flash.2097152_1048576.build.eeprom_start=270528512
sparkfun_xrp_controller_beta.menu.flash.2097152_1048576.build.fs_start=269479936
sparkfun_xrp_controller_beta.menu.flash.2097152_1048576.build.fs_end=270528512
sparkfun_xrp_controller_beta.menu.freq.200=200 MHz
sparkfun_xrp_controller_beta.menu.freq.200.build.f_cpu=200000000L
sparkfun_xrp_controller_beta.menu.freq.50=50 MHz
sparkfun_xrp_controller_beta.menu.freq.50.build.f_cpu=50000000L
sparkfun_xrp_controller_beta.menu.freq.100=100 MHz
sparkfun_xrp_controller_beta.menu.freq.100.build.f_cpu=100000000L
sparkfun_xrp_controller_beta.menu.freq.120=120 MHz
sparkfun_xrp_controller_beta.menu.freq.120.build.f_cpu=120000000L
sparkfun_xrp_controller_beta.menu.freq.125=125 MHz
sparkfun_xrp_controller_beta.menu.freq.125.build.f_cpu=125000000L
sparkfun_xrp_controller_beta.menu.freq.128=128 MHz
sparkfun_xrp_controller_beta.menu.freq.128.build.f_cpu=128000000L
sparkfun_xrp_controller_beta.menu.freq.133=133 MHz
sparkfun_xrp_controller_beta.menu.freq.133.build.f_cpu=133000000L
sparkfun_xrp_controller_beta.menu.freq.150=150 MHz
sparkfun_xrp_controller_beta.menu.freq.150.build.f_cpu=150000000L
sparkfun_xrp_controller_beta.menu.freq.176=176 MHz
sparkfun_xrp_controller_beta.menu.freq.176.build.f_cpu=176000000L
sparkfun_xrp_controller_beta.menu.freq.225=225 MHz (Overclock)
sparkfun_xrp_controller_beta.menu.freq.225.build.f_cpu=225000000L
sparkfun_xrp_controller_beta.menu.freq.240=240 MHz (Overclock)
sparkfun_xrp_controller_beta.menu.freq.240.build.f_cpu=240000000L
sparkfun_xrp_controller_beta.menu.freq.250=250 MHz (Overclock)
sparkfun_xrp_controller_beta.menu.freq.250.build.f_cpu=250000000L
sparkfun_xrp_controller_beta.menu.freq.276=276 MHz (Overclock)
sparkfun_xrp_controller_beta.menu.freq.276.build.f_cpu=276000000L
sparkfun_xrp_controller_beta.menu.freq.300=300 MHz (Overclock)
sparkfun_xrp_controller_beta.menu.freq.300.build.f_cpu=300000000L
sparkfun_xrp_controller_beta.menu.opt.Small=Small (-Os) (standard)
sparkfun_xrp_controller_beta.menu.opt.Small.build.flags.optimize=-Os
sparkfun_xrp_controller_beta.menu.opt.Optimize=Optimize (-O)
sparkfun_xrp_controller_beta.menu.opt.Optimize.build.flags.optimize=-O
sparkfun_xrp_controller_beta.menu.opt.Optimize2=Optimize More (-O2)
sparkfun_xrp_controller_beta.menu.opt.Optimize2.build.flags.optimize=-O2
sparkfun_xrp_controller_beta.menu.opt.Optimize3=Optimize Even More (-O3)
sparkfun_xrp_controller_beta.menu.opt.Optimize3.build.flags.optimize=-O3
sparkfun_xrp_controller_beta.menu.opt.Fast=Fast (-Ofast) (maybe slower)
sparkfun_xrp_controller_beta.menu.opt.Fast.build.flags.optimize=-Ofast
sparkfun_xrp_controller_beta.menu.opt.Debug=Debug (-Og)
sparkfun_xrp_controller_beta.menu.opt.Debug.build.flags.optimize=-Og
sparkfun_xrp_controller_beta.menu.opt.Disabled=Disabled (-O0)
sparkfun_xrp_controller_beta.menu.opt.Disabled.build.flags.optimize=-O0
sparkfun_xrp_controller_beta.menu.profile.Disabled=Disabled
sparkfun_xrp_controller_beta.menu.profile.Disabled.build.flags.profile=
sparkfun_xrp_controller_beta.menu.profile.Enabled=Enabled
sparkfun_xrp_controller_beta.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
sparkfun_xrp_controller_beta.menu.rtti.Disabled=Disabled
sparkfun_xrp_controller_beta.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
sparkfun_xrp_controller_beta.menu.rtti.Enabled=Enabled
sparkfun_xrp_controller_beta.menu.rtti.Enabled.build.flags.rtti=
sparkfun_xrp_controller_beta.menu.stackprotect.Disabled=Disabled
sparkfun_xrp_controller_beta.menu.stackprotect.Disabled.build.flags.stackprotect=
sparkfun_xrp_controller_beta.menu.stackprotect.Enabled=Enabled
sparkfun_xrp_controller_beta.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
sparkfun_xrp_controller_beta.menu.exceptions.Disabled=Disabled
sparkfun_xrp_controller_beta.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
sparkfun_xrp_controller_beta.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
sparkfun_xrp_controller_beta.menu.exceptions.Enabled=Enabled
sparkfun_xrp_controller_beta.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
sparkfun_xrp_controller_beta.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
sparkfun_xrp_controller_beta.menu.dbgport.Disabled=Disabled
sparkfun_xrp_controller_beta.menu.dbgport.Disabled.build.debug_port=
sparkfun_xrp_controller_beta.menu.dbgport.Serial=Serial
sparkfun_xrp_controller_beta.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
sparkfun_xrp_controller_beta.menu.dbgport.Serial1=Serial1
sparkfun_xrp_controller_beta.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
sparkfun_xrp_controller_beta.menu.dbgport.Serial2=Serial2
sparkfun_xrp_controller_beta.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
sparkfun_xrp_controller_beta.menu.dbgport.SerialSemi=SerialSemi
sparkfun_xrp_controller_beta.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
sparkfun_xrp_controller_beta.menu.dbglvl.None=None
sparkfun_xrp_controller_beta.menu.dbglvl.None.build.debug_level=
sparkfun_xrp_controller_beta.menu.dbglvl.Core=Core
sparkfun_xrp_controller_beta.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
sparkfun_xrp_controller_beta.menu.dbglvl.SPI=SPI
sparkfun_xrp_controller_beta.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
sparkfun_xrp_controller_beta.menu.dbglvl.Wire=Wire
sparkfun_xrp_controller_beta.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
sparkfun_xrp_controller_beta.menu.dbglvl.Bluetooth=Bluetooth
sparkfun_xrp_controller_beta.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
sparkfun_xrp_controller_beta.menu.dbglvl.All=All
sparkfun_xrp_controller_beta.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
sparkfun_xrp_controller_beta.menu.dbglvl.NDEBUG=NDEBUG
sparkfun_xrp_controller_beta.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
sparkfun_xrp_controller_beta.menu.usbstack.picosdk=Pico SDK
sparkfun_xrp_controller_beta.menu.usbstack.picosdk.build.usbstack_flags=
sparkfun_xrp_controller_beta.menu.usbstack.tinyusb=Adafruit TinyUSB
sparkfun_xrp_controller_beta.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_xrp_controller_beta.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
sparkfun_xrp_controller_beta.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
sparkfun_xrp_controller_beta.menu.usbstack.nousb=No USB
sparkfun_xrp_controller_beta.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4only=IPv4 Only
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
sparkfun_xrp_controller_beta.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
sparkfun_xrp_controller_beta.menu.uploadmethod.default=Default (UF2)
sparkfun_xrp_controller_beta.menu.uploadmethod.default.build.ram_length=256k
sparkfun_xrp_controller_beta.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_xrp_controller_beta.menu.uploadmethod.default.upload.maximum_data_size=262144
sparkfun_xrp_controller_beta.menu.uploadmethod.default.upload.tool=uf2conv
sparkfun_xrp_controller_beta.menu.uploadmethod.default.upload.tool.default=uf2conv
sparkfun_xrp_controller_beta.menu.uploadmethod.default.upload.tool.network=uf2conv-network
sparkfun_xrp_controller_beta.menu.uploadmethod.picotool=Picotool
sparkfun_xrp_controller_beta.menu.uploadmethod.picotool.build.ram_length=256k
sparkfun_xrp_controller_beta.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
sparkfun_xrp_controller_beta.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
sparkfun_xrp_controller_beta.menu.uploadmethod.picotool.upload.maximum_data_size=262144
sparkfun_xrp_controller_beta.menu.uploadmethod.picotool.upload.tool=picotool
sparkfun_xrp_controller_beta.menu.uploadmethod.picotool.upload.tool.default=picotool
sparkfun_xrp_controller_beta.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
sparkfun_xrp_controller_beta.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
sparkfun_xrp_controller_beta.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
sparkfun_xrp_controller_beta.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
sparkfun_xrp_controller_beta.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
sparkfun_xrp_controller_beta.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

