earlephilhower/arduino-pico/boards.txt
waveshare_rp2040_plus_16mb.menu.flash.16777216_12582912.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.upload.maximum_size=3141632
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.build.flash_length=3141632
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.build.fs_start=271577088
waveshare_rp2040_plus_16mb.menu.flash.16777216_13631488.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_14680064.upload.maximum_size=2093056
waveshare_rp2040_plus_16mb.menu.flash.16777216_14680064.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_14680064.build.flash_length=2093056
waveshare_rp2040_plus_16mb.menu.flash.16777216_14680064.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_14680064.build.fs_start=270528512
waveshare_rp2040_plus_16mb.menu.flash.16777216_14680064.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
waveshare_rp2040_plus_16mb.menu.flash.16777216_15728640.upload.maximum_size=1044480
waveshare_rp2040_plus_16mb.menu.flash.16777216_15728640.build.flash_total=16777216
waveshare_rp2040_plus_16mb.menu.flash.16777216_15728640.build.flash_length=1044480
waveshare_rp2040_plus_16mb.menu.flash.16777216_15728640.build.eeprom_start=285208576
waveshare_rp2040_plus_16mb.menu.flash.16777216_15728640.build.fs_start=269479936
waveshare_rp2040_plus_16mb.menu.flash.16777216_15728640.build.fs_end=285208576
waveshare_rp2040_plus_16mb.menu.freq.200=200 MHz
waveshare_rp2040_plus_16mb.menu.freq.200.build.f_cpu=200000000L
waveshare_rp2040_plus_16mb.menu.freq.50=50 MHz
waveshare_rp2040_plus_16mb.menu.freq.50.build.f_cpu=50000000L
waveshare_rp2040_plus_16mb.menu.freq.100=100 MHz
waveshare_rp2040_plus_16mb.menu.freq.100.build.f_cpu=100000000L
waveshare_rp2040_plus_16mb.menu.freq.120=120 MHz
waveshare_rp2040_plus_16mb.menu.freq.120.build.f_cpu=120000000L
waveshare_rp2040_plus_16mb.menu.freq.125=125 MHz
waveshare_rp2040_plus_16mb.menu.freq.125.build.f_cpu=125000000L
waveshare_rp2040_plus_16mb.menu.freq.128=128 MHz
waveshare_rp2040_plus_16mb.menu.freq.128.build.f_cpu=128000000L
waveshare_rp2040_plus_16mb.menu.freq.133=133 MHz
waveshare_rp2040_plus_16mb.menu.freq.133.build.f_cpu=133000000L
waveshare_rp2040_plus_16mb.menu.freq.150=150 MHz
waveshare_rp2040_plus_16mb.menu.freq.150.build.f_cpu=150000000L
waveshare_rp2040_plus_16mb.menu.freq.176=176 MHz
waveshare_rp2040_plus_16mb.menu.freq.176.build.f_cpu=176000000L
waveshare_rp2040_plus_16mb.menu.freq.225=225 MHz (Overclock)
waveshare_rp2040_plus_16mb.menu.freq.225.build.f_cpu=225000000L
waveshare_rp2040_plus_16mb.menu.freq.240=240 MHz (Overclock)
waveshare_rp2040_plus_16mb.menu.freq.240.build.f_cpu=240000000L
waveshare_rp2040_plus_16mb.menu.freq.250=250 MHz (Overclock)
waveshare_rp2040_plus_16mb.menu.freq.250.build.f_cpu=250000000L
waveshare_rp2040_plus_16mb.menu.freq.276=276 MHz (Overclock)
waveshare_rp2040_plus_16mb.menu.freq.276.build.f_cpu=276000000L
waveshare_rp2040_plus_16mb.menu.freq.300=300 MHz (Overclock)
waveshare_rp2040_plus_16mb.menu.freq.300.build.f_cpu=300000000L
waveshare_rp2040_plus_16mb.menu.opt.Small=Small (-Os) (standard)
waveshare_rp2040_plus_16mb.menu.opt.Small.build.flags.optimize=-Os
waveshare_rp2040_plus_16mb.menu.opt.Optimize=Optimize (-O)
waveshare_rp2040_plus_16mb.menu.opt.Optimize.build.flags.optimize=-O
waveshare_rp2040_plus_16mb.menu.opt.Optimize2=Optimize More (-O2)
waveshare_rp2040_plus_16mb.menu.opt.Optimize2.build.flags.optimize=-O2
waveshare_rp2040_plus_16mb.menu.opt.Optimize3=Optimize Even More (-O3)
waveshare_rp2040_plus_16mb.menu.opt.Optimize3.build.flags.optimize=-O3
waveshare_rp2040_plus_16mb.menu.opt.Fast=Fast (-Ofast) (maybe slower)
waveshare_rp2040_plus_16mb.menu.opt.Fast.build.flags.optimize=-Ofast
waveshare_rp2040_plus_16mb.menu.opt.Debug=Debug (-Og)
waveshare_rp2040_plus_16mb.menu.opt.Debug.build.flags.optimize=-Og
waveshare_rp2040_plus_16mb.menu.opt.Disabled=Disabled (-O0)
waveshare_rp2040_plus_16mb.menu.opt.Disabled.build.flags.optimize=-O0
waveshare_rp2040_plus_16mb.menu.profile.Disabled=Disabled
waveshare_rp2040_plus_16mb.menu.profile.Disabled.build.flags.profile=
waveshare_rp2040_plus_16mb.menu.profile.Enabled=Enabled
waveshare_rp2040_plus_16mb.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
waveshare_rp2040_plus_16mb.menu.rtti.Disabled=Disabled
waveshare_rp2040_plus_16mb.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
waveshare_rp2040_plus_16mb.menu.rtti.Enabled=Enabled
waveshare_rp2040_plus_16mb.menu.rtti.Enabled.build.flags.rtti=
waveshare_rp2040_plus_16mb.menu.stackprotect.Disabled=Disabled
waveshare_rp2040_plus_16mb.menu.stackprotect.Disabled.build.flags.stackprotect=
waveshare_rp2040_plus_16mb.menu.stackprotect.Enabled=Enabled
waveshare_rp2040_plus_16mb.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
waveshare_rp2040_plus_16mb.menu.exceptions.Disabled=Disabled
waveshare_rp2040_plus_16mb.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
waveshare_rp2040_plus_16mb.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
waveshare_rp2040_plus_16mb.menu.exceptions.Enabled=Enabled
waveshare_rp2040_plus_16mb.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
waveshare_rp2040_plus_16mb.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
waveshare_rp2040_plus_16mb.menu.dbgport.Disabled=Disabled
waveshare_rp2040_plus_16mb.menu.dbgport.Disabled.build.debug_port=
waveshare_rp2040_plus_16mb.menu.dbgport.Serial=Serial
waveshare_rp2040_plus_16mb.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
waveshare_rp2040_plus_16mb.menu.dbgport.Serial1=Serial1
waveshare_rp2040_plus_16mb.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
waveshare_rp2040_plus_16mb.menu.dbgport.Serial2=Serial2
waveshare_rp2040_plus_16mb.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
waveshare_rp2040_plus_16mb.menu.dbgport.SerialSemi=SerialSemi
waveshare_rp2040_plus_16mb.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
waveshare_rp2040_plus_16mb.menu.dbglvl.None=None
waveshare_rp2040_plus_16mb.menu.dbglvl.None.build.debug_level=
waveshare_rp2040_plus_16mb.menu.dbglvl.Core=Core
waveshare_rp2040_plus_16mb.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
waveshare_rp2040_plus_16mb.menu.dbglvl.SPI=SPI
waveshare_rp2040_plus_16mb.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
waveshare_rp2040_plus_16mb.menu.dbglvl.Wire=Wire
waveshare_rp2040_plus_16mb.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
waveshare_rp2040_plus_16mb.menu.dbglvl.Bluetooth=Bluetooth
waveshare_rp2040_plus_16mb.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
waveshare_rp2040_plus_16mb.menu.dbglvl.All=All
waveshare_rp2040_plus_16mb.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
waveshare_rp2040_plus_16mb.menu.dbglvl.NDEBUG=NDEBUG
waveshare_rp2040_plus_16mb.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
waveshare_rp2040_plus_16mb.menu.usbstack.picosdk=Pico SDK
waveshare_rp2040_plus_16mb.menu.usbstack.picosdk.build.usbstack_flags=
waveshare_rp2040_plus_16mb.menu.usbstack.tinyusb=Adafruit TinyUSB
waveshare_rp2040_plus_16mb.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
waveshare_rp2040_plus_16mb.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
waveshare_rp2040_plus_16mb.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
waveshare_rp2040_plus_16mb.menu.usbstack.nousb=No USB
waveshare_rp2040_plus_16mb.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4only=IPv4 Only
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libipv4-ipv6-bt.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4onlybig.build.libpicow=libipv4-big.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6big.build.libpicow=libipv4-ipv6-big.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4btcblebig.build.libpicow=libipv4-bt-big.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libipv4-ipv6-bt-big.a
waveshare_rp2040_plus_16mb.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
waveshare_rp2040_plus_16mb.menu.uploadmethod.default=Default (UF2)
waveshare_rp2040_plus_16mb.menu.uploadmethod.default.build.ram_length=256k
waveshare_rp2040_plus_16mb.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
waveshare_rp2040_plus_16mb.menu.uploadmethod.default.upload.maximum_data_size=262144
waveshare_rp2040_plus_16mb.menu.uploadmethod.default.upload.tool=uf2conv
waveshare_rp2040_plus_16mb.menu.uploadmethod.default.upload.tool.default=uf2conv
waveshare_rp2040_plus_16mb.menu.uploadmethod.default.upload.tool.network=uf2conv-network
waveshare_rp2040_plus_16mb.menu.uploadmethod.picotool=Picotool
waveshare_rp2040_plus_16mb.menu.uploadmethod.picotool.build.ram_length=256k
waveshare_rp2040_plus_16mb.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
waveshare_rp2040_plus_16mb.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
waveshare_rp2040_plus_16mb.menu.uploadmethod.picotool.upload.maximum_data_size=262144
waveshare_rp2040_plus_16mb.menu.uploadmethod.picotool.upload.tool=picotool
waveshare_rp2040_plus_16mb.menu.uploadmethod.picotool.upload.tool.default=picotool
waveshare_rp2040_plus_16mb.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
waveshare_rp2040_plus_16mb.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
waveshare_rp2040_plus_16mb.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
waveshare_rp2040_plus_16mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
waveshare_rp2040_plus_16mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
waveshare_rp2040_plus_16mb.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

