earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Waveshare RP2350 Plus
# -----------------------------------
waveshare_rp2350_plus.name=Waveshare RP2350 Plus
waveshare_rp2350_plus.vid.0=0x2e8a
waveshare_rp2350_plus.pid.0=0x10b1
waveshare_rp2350_plus.vid.1=0x2e8a
waveshare_rp2350_plus.pid.1=0x11b1
waveshare_rp2350_plus.vid.2=0x2e8a
waveshare_rp2350_plus.pid.2=0x50b1
waveshare_rp2350_plus.vid.3=0x2e8a
waveshare_rp2350_plus.pid.3=0x51b1
waveshare_rp2350_plus.vid.4=0x2e8a
waveshare_rp2350_plus.pid.4=0x90b1
waveshare_rp2350_plus.vid.5=0x2e8a
waveshare_rp2350_plus.pid.5=0x91b1
waveshare_rp2350_plus.vid.6=0x2e8a
waveshare_rp2350_plus.pid.6=0xd0b1
waveshare_rp2350_plus.vid.7=0x2e8a
waveshare_rp2350_plus.pid.7=0xd1b1
waveshare_rp2350_plus.upload_port.0.vid=0x2e8a
waveshare_rp2350_plus.upload_port.0.pid=0x10b1
waveshare_rp2350_plus.upload_port.1.vid=0x2e8a
waveshare_rp2350_plus.upload_port.1.pid=0x11b1
waveshare_rp2350_plus.upload_port.2.vid=0x2e8a
waveshare_rp2350_plus.upload_port.2.pid=0x50b1
waveshare_rp2350_plus.upload_port.3.vid=0x2e8a
waveshare_rp2350_plus.upload_port.3.pid=0x51b1
waveshare_rp2350_plus.upload_port.4.vid=0x2e8a
waveshare_rp2350_plus.upload_port.4.pid=0x90b1
waveshare_rp2350_plus.upload_port.5.vid=0x2e8a
waveshare_rp2350_plus.upload_port.5.pid=0x91b1
waveshare_rp2350_plus.upload_port.6.vid=0x2e8a
waveshare_rp2350_plus.upload_port.6.pid=0xd0b1
waveshare_rp2350_plus.upload_port.7.vid=0x2e8a
waveshare_rp2350_plus.upload_port.7.pid=0xd1b1
waveshare_rp2350_plus.build.usbvid=-DUSBD_VID=0x2e8a
waveshare_rp2350_plus.build.usbpid=-DUSBD_PID=0x10b1
waveshare_rp2350_plus.build.usbpwr=-DUSBD_MAX_POWER_MA=500
waveshare_rp2350_plus.build.board=WAVESHARE_RP2350_PLUS
waveshare_rp2350_plus.build.variant=waveshare_rp2350_plus
waveshare_rp2350_plus.upload.maximum_size=4194304
waveshare_rp2350_plus.upload.wait_for_upload_port=true
waveshare_rp2350_plus.upload.erase_cmd=
waveshare_rp2350_plus.serial.disableDTR=false
waveshare_rp2350_plus.serial.disableRTS=false
waveshare_rp2350_plus.build.f_cpu=125000000
waveshare_rp2350_plus.build.led=
waveshare_rp2350_plus.build.core=rp2040
waveshare_rp2350_plus.build.ldscript=memmap_default.ld
waveshare_rp2350_plus.build.boot2=none
waveshare_rp2350_plus.build.usb_manufacturer="Waveshare"
waveshare_rp2350_plus.build.usb_product="RP2350 Plus"
waveshare_rp2350_plus.build.psram_length=0x000000
waveshare_rp2350_plus.menu.flash.4194304_0=4MB (no FS)
waveshare_rp2350_plus.menu.flash.4194304_0.upload.maximum_size=4186112
waveshare_rp2350_plus.menu.flash.4194304_0.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_0.build.flash_length=4186112
waveshare_rp2350_plus.menu.flash.4194304_0.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_0.build.fs_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_0.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
waveshare_rp2350_plus.menu.flash.4194304_65536.upload.maximum_size=4120576
waveshare_rp2350_plus.menu.flash.4194304_65536.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_65536.build.flash_length=4120576
waveshare_rp2350_plus.menu.flash.4194304_65536.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_65536.build.fs_start=272556032
waveshare_rp2350_plus.menu.flash.4194304_65536.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
waveshare_rp2350_plus.menu.flash.4194304_131072.upload.maximum_size=4055040
waveshare_rp2350_plus.menu.flash.4194304_131072.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_131072.build.flash_length=4055040
waveshare_rp2350_plus.menu.flash.4194304_131072.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_131072.build.fs_start=272490496
waveshare_rp2350_plus.menu.flash.4194304_131072.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
waveshare_rp2350_plus.menu.flash.4194304_262144.upload.maximum_size=3923968
waveshare_rp2350_plus.menu.flash.4194304_262144.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_262144.build.flash_length=3923968
waveshare_rp2350_plus.menu.flash.4194304_262144.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_262144.build.fs_start=272359424
waveshare_rp2350_plus.menu.flash.4194304_262144.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
waveshare_rp2350_plus.menu.flash.4194304_524288.upload.maximum_size=3661824
waveshare_rp2350_plus.menu.flash.4194304_524288.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_524288.build.flash_length=3661824
waveshare_rp2350_plus.menu.flash.4194304_524288.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_524288.build.fs_start=272097280
waveshare_rp2350_plus.menu.flash.4194304_524288.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
waveshare_rp2350_plus.menu.flash.4194304_1048576.upload.maximum_size=3137536
waveshare_rp2350_plus.menu.flash.4194304_1048576.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_1048576.build.flash_length=3137536
waveshare_rp2350_plus.menu.flash.4194304_1048576.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_1048576.build.fs_start=271572992
waveshare_rp2350_plus.menu.flash.4194304_1048576.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
waveshare_rp2350_plus.menu.flash.4194304_2097152.upload.maximum_size=2088960
waveshare_rp2350_plus.menu.flash.4194304_2097152.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_2097152.build.flash_length=2088960
waveshare_rp2350_plus.menu.flash.4194304_2097152.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_2097152.build.fs_start=270524416
waveshare_rp2350_plus.menu.flash.4194304_2097152.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
waveshare_rp2350_plus.menu.flash.4194304_3145728.upload.maximum_size=1040384
waveshare_rp2350_plus.menu.flash.4194304_3145728.build.flash_total=4194304
waveshare_rp2350_plus.menu.flash.4194304_3145728.build.flash_length=1040384
waveshare_rp2350_plus.menu.flash.4194304_3145728.build.eeprom_start=272621568
waveshare_rp2350_plus.menu.flash.4194304_3145728.build.fs_start=269475840
waveshare_rp2350_plus.menu.flash.4194304_3145728.build.fs_end=272621568
waveshare_rp2350_plus.menu.flash.16777216_0=16MB (no FS)
waveshare_rp2350_plus.menu.flash.16777216_0.upload.maximum_size=16769024
waveshare_rp2350_plus.menu.flash.16777216_0.build.flash_total=16777216
waveshare_rp2350_plus.menu.flash.16777216_0.build.flash_length=16769024
waveshare_rp2350_plus.menu.flash.16777216_0.build.eeprom_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_0.build.fs_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_0.build.fs_end=285204480
waveshare_rp2350_plus.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
waveshare_rp2350_plus.menu.flash.16777216_15728640.upload.maximum_size=1040384
waveshare_rp2350_plus.menu.flash.16777216_15728640.build.flash_total=16777216
waveshare_rp2350_plus.menu.flash.16777216_15728640.build.flash_length=1040384
waveshare_rp2350_plus.menu.flash.16777216_15728640.build.eeprom_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_15728640.build.fs_start=269475840
waveshare_rp2350_plus.menu.flash.16777216_15728640.build.fs_end=285204480
waveshare_rp2350_plus.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
waveshare_rp2350_plus.menu.flash.16777216_14680064.upload.maximum_size=2088960
waveshare_rp2350_plus.menu.flash.16777216_14680064.build.flash_total=16777216
waveshare_rp2350_plus.menu.flash.16777216_14680064.build.flash_length=2088960
waveshare_rp2350_plus.menu.flash.16777216_14680064.build.eeprom_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_14680064.build.fs_start=270524416
waveshare_rp2350_plus.menu.flash.16777216_14680064.build.fs_end=285204480
waveshare_rp2350_plus.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
waveshare_rp2350_plus.menu.flash.16777216_12582912.upload.maximum_size=4186112
waveshare_rp2350_plus.menu.flash.16777216_12582912.build.flash_total=16777216
waveshare_rp2350_plus.menu.flash.16777216_12582912.build.flash_length=4186112
waveshare_rp2350_plus.menu.flash.16777216_12582912.build.eeprom_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_12582912.build.fs_start=272621568
waveshare_rp2350_plus.menu.flash.16777216_12582912.build.fs_end=285204480
waveshare_rp2350_plus.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
waveshare_rp2350_plus.menu.flash.16777216_8388608.upload.maximum_size=8380416
waveshare_rp2350_plus.menu.flash.16777216_8388608.build.flash_total=16777216
waveshare_rp2350_plus.menu.flash.16777216_8388608.build.flash_length=8380416
waveshare_rp2350_plus.menu.flash.16777216_8388608.build.eeprom_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_8388608.build.fs_start=276815872
waveshare_rp2350_plus.menu.flash.16777216_8388608.build.fs_end=285204480
waveshare_rp2350_plus.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
waveshare_rp2350_plus.menu.flash.16777216_4194304.upload.maximum_size=12574720
waveshare_rp2350_plus.menu.flash.16777216_4194304.build.flash_total=16777216
waveshare_rp2350_plus.menu.flash.16777216_4194304.build.flash_length=12574720
waveshare_rp2350_plus.menu.flash.16777216_4194304.build.eeprom_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_4194304.build.fs_start=281010176
waveshare_rp2350_plus.menu.flash.16777216_4194304.build.fs_end=285204480
waveshare_rp2350_plus.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
waveshare_rp2350_plus.menu.flash.16777216_2097152.upload.maximum_size=14671872
waveshare_rp2350_plus.menu.flash.16777216_2097152.build.flash_total=16777216
waveshare_rp2350_plus.menu.flash.16777216_2097152.build.flash_length=14671872
waveshare_rp2350_plus.menu.flash.16777216_2097152.build.eeprom_start=285204480
waveshare_rp2350_plus.menu.flash.16777216_2097152.build.fs_start=283107328
waveshare_rp2350_plus.menu.flash.16777216_2097152.build.fs_end=285204480
waveshare_rp2350_plus.menu.arch.arm=ARM
waveshare_rp2350_plus.menu.arch.arm.build.chip=rp2350
waveshare_rp2350_plus.menu.arch.arm.build.toolchain=arm-none-eabi
waveshare_rp2350_plus.menu.arch.arm.build.toolchainpkg=pqt-gcc
waveshare_rp2350_plus.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
waveshare_rp2350_plus.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
waveshare_rp2350_plus.menu.arch.arm.build.mcu=cortex-m33
waveshare_rp2350_plus.menu.arch.riscv=RISC-V
waveshare_rp2350_plus.menu.arch.riscv.build.chip=rp2350-riscv
waveshare_rp2350_plus.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
waveshare_rp2350_plus.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
waveshare_rp2350_plus.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
waveshare_rp2350_plus.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
waveshare_rp2350_plus.menu.arch.riscv.build.mcu=rv32imac
waveshare_rp2350_plus.menu.freq.150=150 MHz
waveshare_rp2350_plus.menu.freq.150.build.f_cpu=150000000L
waveshare_rp2350_plus.menu.freq.50=50 MHz
waveshare_rp2350_plus.menu.freq.50.build.f_cpu=50000000L
waveshare_rp2350_plus.menu.freq.100=100 MHz
waveshare_rp2350_plus.menu.freq.100.build.f_cpu=100000000L
waveshare_rp2350_plus.menu.freq.120=120 MHz
waveshare_rp2350_plus.menu.freq.120.build.f_cpu=120000000L
waveshare_rp2350_plus.menu.freq.125=125 MHz
waveshare_rp2350_plus.menu.freq.125.build.f_cpu=125000000L
waveshare_rp2350_plus.menu.freq.128=128 MHz
waveshare_rp2350_plus.menu.freq.128.build.f_cpu=128000000L
waveshare_rp2350_plus.menu.freq.133=133 MHz
waveshare_rp2350_plus.menu.freq.133.build.f_cpu=133000000L
waveshare_rp2350_plus.menu.freq.176=176 MHz (Overclock)
waveshare_rp2350_plus.menu.freq.176.build.f_cpu=176000000L
waveshare_rp2350_plus.menu.freq.200=200 MHz (Overclock)
waveshare_rp2350_plus.menu.freq.200.build.f_cpu=200000000L
waveshare_rp2350_plus.menu.freq.225=225 MHz (Overclock)
waveshare_rp2350_plus.menu.freq.225.build.f_cpu=225000000L
waveshare_rp2350_plus.menu.freq.240=240 MHz (Overclock)
waveshare_rp2350_plus.menu.freq.240.build.f_cpu=240000000L
waveshare_rp2350_plus.menu.freq.250=250 MHz (Overclock)
waveshare_rp2350_plus.menu.freq.250.build.f_cpu=250000000L
waveshare_rp2350_plus.menu.freq.276=276 MHz (Overclock)
waveshare_rp2350_plus.menu.freq.276.build.f_cpu=276000000L
waveshare_rp2350_plus.menu.freq.300=300 MHz (Overclock)
waveshare_rp2350_plus.menu.freq.300.build.f_cpu=300000000L
waveshare_rp2350_plus.menu.opt.Small=Small (-Os) (standard)
waveshare_rp2350_plus.menu.opt.Small.build.flags.optimize=-Os
waveshare_rp2350_plus.menu.opt.Optimize=Optimize (-O)
waveshare_rp2350_plus.menu.opt.Optimize.build.flags.optimize=-O
waveshare_rp2350_plus.menu.opt.Optimize2=Optimize More (-O2)
waveshare_rp2350_plus.menu.opt.Optimize2.build.flags.optimize=-O2
waveshare_rp2350_plus.menu.opt.Optimize3=Optimize Even More (-O3)
waveshare_rp2350_plus.menu.opt.Optimize3.build.flags.optimize=-O3
waveshare_rp2350_plus.menu.opt.Fast=Fast (-Ofast) (maybe slower)
waveshare_rp2350_plus.menu.opt.Fast.build.flags.optimize=-Ofast
waveshare_rp2350_plus.menu.opt.Debug=Debug (-Og)
waveshare_rp2350_plus.menu.opt.Debug.build.flags.optimize=-Og
waveshare_rp2350_plus.menu.opt.Disabled=Disabled (-O0)
waveshare_rp2350_plus.menu.opt.Disabled.build.flags.optimize=-O0
waveshare_rp2350_plus.menu.profile.Disabled=Disabled
waveshare_rp2350_plus.menu.profile.Disabled.build.flags.profile=
waveshare_rp2350_plus.menu.profile.Enabled=Enabled
waveshare_rp2350_plus.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
waveshare_rp2350_plus.menu.rtti.Disabled=Disabled
waveshare_rp2350_plus.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
waveshare_rp2350_plus.menu.rtti.Enabled=Enabled
waveshare_rp2350_plus.menu.rtti.Enabled.build.flags.rtti=
waveshare_rp2350_plus.menu.stackprotect.Disabled=Disabled
waveshare_rp2350_plus.menu.stackprotect.Disabled.build.flags.stackprotect=
waveshare_rp2350_plus.menu.stackprotect.Enabled=Enabled
waveshare_rp2350_plus.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
waveshare_rp2350_plus.menu.exceptions.Disabled=Disabled
waveshare_rp2350_plus.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
waveshare_rp2350_plus.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
waveshare_rp2350_plus.menu.exceptions.Enabled=Enabled
waveshare_rp2350_plus.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
waveshare_rp2350_plus.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
waveshare_rp2350_plus.menu.dbgport.Disabled=Disabled
waveshare_rp2350_plus.menu.dbgport.Disabled.build.debug_port=
waveshare_rp2350_plus.menu.dbgport.Serial=Serial
waveshare_rp2350_plus.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
waveshare_rp2350_plus.menu.dbgport.Serial1=Serial1
waveshare_rp2350_plus.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
waveshare_rp2350_plus.menu.dbgport.Serial2=Serial2
waveshare_rp2350_plus.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
waveshare_rp2350_plus.menu.dbgport.SerialSemi=SerialSemi
waveshare_rp2350_plus.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
waveshare_rp2350_plus.menu.dbglvl.None=None
waveshare_rp2350_plus.menu.dbglvl.None.build.debug_level=
waveshare_rp2350_plus.menu.dbglvl.Core=Core
waveshare_rp2350_plus.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
waveshare_rp2350_plus.menu.dbglvl.SPI=SPI
waveshare_rp2350_plus.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
waveshare_rp2350_plus.menu.dbglvl.Wire=Wire
waveshare_rp2350_plus.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
waveshare_rp2350_plus.menu.dbglvl.Bluetooth=Bluetooth
waveshare_rp2350_plus.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
waveshare_rp2350_plus.menu.dbglvl.All=All
waveshare_rp2350_plus.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
waveshare_rp2350_plus.menu.dbglvl.NDEBUG=NDEBUG
waveshare_rp2350_plus.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
waveshare_rp2350_plus.menu.usbstack.picosdk=Pico SDK
waveshare_rp2350_plus.menu.usbstack.picosdk.build.usbstack_flags=
waveshare_rp2350_plus.menu.usbstack.tinyusb=Adafruit TinyUSB
waveshare_rp2350_plus.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
waveshare_rp2350_plus.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
waveshare_rp2350_plus.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
waveshare_rp2350_plus.menu.usbstack.nousb=No USB
waveshare_rp2350_plus.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
waveshare_rp2350_plus.menu.ipbtstack.ipv4only=IPv4 Only
waveshare_rp2350_plus.menu.ipbtstack.ipv4only.build.libpicow=libipv4.a
waveshare_rp2350_plus.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
waveshare_rp2350_plus.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
waveshare_rp2350_plus.menu.ipbtstack.ipv4ipv6.build.libpicow=libipv4-ipv6.a
waveshare_rp2350_plus.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
waveshare_rp2350_plus.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
waveshare_rp2350_plus.menu.ipbtstack.ipv4btcble.build.libpicow=libipv4-bt.a
waveshare_rp2350_plus.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
waveshare_rp2350_plus.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
